zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/**
 * \brief Component description for PIC32CZ/CA70 PORT
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_PORT_COMPONENT_H_
#define _PIC32CZ_CA70_PORT_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_PORT Port
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PORT */
/* ========================================================================== */

/* -------- PORT_PER : (PORT Offset: 0x00) (/W 32) PORT Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  PORT Enable                                   */
    uint32_t P1:1;                      /**< bit:      1  PORT Enable                                   */
    uint32_t P2:1;                      /**< bit:      2  PORT Enable                                   */
    uint32_t P3:1;                      /**< bit:      3  PORT Enable                                   */
    uint32_t P4:1;                      /**< bit:      4  PORT Enable                                   */
    uint32_t P5:1;                      /**< bit:      5  PORT Enable                                   */
    uint32_t P6:1;                      /**< bit:      6  PORT Enable                                   */
    uint32_t P7:1;                      /**< bit:      7  PORT Enable                                   */
    uint32_t P8:1;                      /**< bit:      8  PORT Enable                                   */
    uint32_t P9:1;                      /**< bit:      9  PORT Enable                                   */
    uint32_t P10:1;                     /**< bit:     10  PORT Enable                                   */
    uint32_t P11:1;                     /**< bit:     11  PORT Enable                                   */
    uint32_t P12:1;                     /**< bit:     12  PORT Enable                                   */
    uint32_t P13:1;                     /**< bit:     13  PORT Enable                                   */
    uint32_t P14:1;                     /**< bit:     14  PORT Enable                                   */
    uint32_t P15:1;                     /**< bit:     15  PORT Enable                                   */
    uint32_t P16:1;                     /**< bit:     16  PORT Enable                                   */
    uint32_t P17:1;                     /**< bit:     17  PORT Enable                                   */
    uint32_t P18:1;                     /**< bit:     18  PORT Enable                                   */
    uint32_t P19:1;                     /**< bit:     19  PORT Enable                                   */
    uint32_t P20:1;                     /**< bit:     20  PORT Enable                                   */
    uint32_t P21:1;                     /**< bit:     21  PORT Enable                                   */
    uint32_t P22:1;                     /**< bit:     22  PORT Enable                                   */
    uint32_t P23:1;                     /**< bit:     23  PORT Enable                                   */
    uint32_t P24:1;                     /**< bit:     24  PORT Enable                                   */
    uint32_t P25:1;                     /**< bit:     25  PORT Enable                                   */
    uint32_t P26:1;                     /**< bit:     26  PORT Enable                                   */
    uint32_t P27:1;                     /**< bit:     27  PORT Enable                                   */
    uint32_t P28:1;                     /**< bit:     28  PORT Enable                                   */
    uint32_t P29:1;                     /**< bit:     29  PORT Enable                                   */
    uint32_t P30:1;                     /**< bit:     30  PORT Enable                                   */
    uint32_t P31:1;                     /**< bit:     31  PORT Enable                                   */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  PORT Enable                                   */
  };
  uint32_t w;
} __PORT_PER_bits_t;

#define PORT_PER_P0_Pos                       (0)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P0_Msk                       (0x1U << PORT_PER_P0_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P1_Pos                       (1)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P1_Msk                       (0x1U << PORT_PER_P1_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P2_Pos                       (2)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P2_Msk                       (0x1U << PORT_PER_P2_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P3_Pos                       (3)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P3_Msk                       (0x1U << PORT_PER_P3_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P4_Pos                       (4)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P4_Msk                       (0x1U << PORT_PER_P4_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P5_Pos                       (5)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P5_Msk                       (0x1U << PORT_PER_P5_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P6_Pos                       (6)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P6_Msk                       (0x1U << PORT_PER_P6_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P7_Pos                       (7)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P7_Msk                       (0x1U << PORT_PER_P7_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P8_Pos                       (8)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P8_Msk                       (0x1U << PORT_PER_P8_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P9_Pos                       (9)                                            /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P9_Msk                       (0x1U << PORT_PER_P9_Pos)                      /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P10_Pos                      (10)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P10_Msk                      (0x1U << PORT_PER_P10_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P11_Pos                      (11)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P11_Msk                      (0x1U << PORT_PER_P11_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P12_Pos                      (12)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P12_Msk                      (0x1U << PORT_PER_P12_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P13_Pos                      (13)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P13_Msk                      (0x1U << PORT_PER_P13_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P14_Pos                      (14)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P14_Msk                      (0x1U << PORT_PER_P14_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P15_Pos                      (15)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P15_Msk                      (0x1U << PORT_PER_P15_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P16_Pos                      (16)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P16_Msk                      (0x1U << PORT_PER_P16_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P17_Pos                      (17)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P17_Msk                      (0x1U << PORT_PER_P17_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P18_Pos                      (18)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P18_Msk                      (0x1U << PORT_PER_P18_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P19_Pos                      (19)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P19_Msk                      (0x1U << PORT_PER_P19_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P20_Pos                      (20)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P20_Msk                      (0x1U << PORT_PER_P20_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P21_Pos                      (21)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P21_Msk                      (0x1U << PORT_PER_P21_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P22_Pos                      (22)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P22_Msk                      (0x1U << PORT_PER_P22_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P23_Pos                      (23)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P23_Msk                      (0x1U << PORT_PER_P23_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P24_Pos                      (24)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P24_Msk                      (0x1U << PORT_PER_P24_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P25_Pos                      (25)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P25_Msk                      (0x1U << PORT_PER_P25_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P26_Pos                      (26)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P26_Msk                      (0x1U << PORT_PER_P26_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P27_Pos                      (27)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P27_Msk                      (0x1U << PORT_PER_P27_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P28_Pos                      (28)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P28_Msk                      (0x1U << PORT_PER_P28_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P29_Pos                      (29)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P29_Msk                      (0x1U << PORT_PER_P29_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P30_Pos                      (30)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P30_Msk                      (0x1U << PORT_PER_P30_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_P31_Pos                      (31)                                           /**< (PORT_PER) PORT Enable Position */
#define PORT_PER_P31_Msk                      (0x1U << PORT_PER_P31_Pos)                     /**< (PORT_PER) PORT Enable Mask */
#define PORT_PER_Msk                          (0xFFFFFFFFUL)                                 /**< (PORT_PER) Register Mask  */
#define PORT_PER_P_Pos                        (0)                                            /**< (PORT_PER Position) PORT Enable */
#define PORT_PER_P_Msk                        (0xFFFFFFFFU << PORT_PER_P_Pos)                /**< (PORT_PER Mask) P */
#define PORT_PER_P(value)                     (PORT_PER_P_Msk & ((value) << PORT_PER_P_Pos))

/* -------- PORT_PDR : (PORT Offset: 0x04) (/W 32) PORT Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  PORT Disable                                  */
    uint32_t P1:1;                      /**< bit:      1  PORT Disable                                  */
    uint32_t P2:1;                      /**< bit:      2  PORT Disable                                  */
    uint32_t P3:1;                      /**< bit:      3  PORT Disable                                  */
    uint32_t P4:1;                      /**< bit:      4  PORT Disable                                  */
    uint32_t P5:1;                      /**< bit:      5  PORT Disable                                  */
    uint32_t P6:1;                      /**< bit:      6  PORT Disable                                  */
    uint32_t P7:1;                      /**< bit:      7  PORT Disable                                  */
    uint32_t P8:1;                      /**< bit:      8  PORT Disable                                  */
    uint32_t P9:1;                      /**< bit:      9  PORT Disable                                  */
    uint32_t P10:1;                     /**< bit:     10  PORT Disable                                  */
    uint32_t P11:1;                     /**< bit:     11  PORT Disable                                  */
    uint32_t P12:1;                     /**< bit:     12  PORT Disable                                  */
    uint32_t P13:1;                     /**< bit:     13  PORT Disable                                  */
    uint32_t P14:1;                     /**< bit:     14  PORT Disable                                  */
    uint32_t P15:1;                     /**< bit:     15  PORT Disable                                  */
    uint32_t P16:1;                     /**< bit:     16  PORT Disable                                  */
    uint32_t P17:1;                     /**< bit:     17  PORT Disable                                  */
    uint32_t P18:1;                     /**< bit:     18  PORT Disable                                  */
    uint32_t P19:1;                     /**< bit:     19  PORT Disable                                  */
    uint32_t P20:1;                     /**< bit:     20  PORT Disable                                  */
    uint32_t P21:1;                     /**< bit:     21  PORT Disable                                  */
    uint32_t P22:1;                     /**< bit:     22  PORT Disable                                  */
    uint32_t P23:1;                     /**< bit:     23  PORT Disable                                  */
    uint32_t P24:1;                     /**< bit:     24  PORT Disable                                  */
    uint32_t P25:1;                     /**< bit:     25  PORT Disable                                  */
    uint32_t P26:1;                     /**< bit:     26  PORT Disable                                  */
    uint32_t P27:1;                     /**< bit:     27  PORT Disable                                  */
    uint32_t P28:1;                     /**< bit:     28  PORT Disable                                  */
    uint32_t P29:1;                     /**< bit:     29  PORT Disable                                  */
    uint32_t P30:1;                     /**< bit:     30  PORT Disable                                  */
    uint32_t P31:1;                     /**< bit:     31  PORT Disable                                  */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  PORT Disable                                  */
  };
  uint32_t w;
} __PORT_PDR_bits_t;

