zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_PDR_P0_Pos                       (0)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P0_Msk                       (0x1U << PORT_PDR_P0_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P1_Pos                       (1)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P1_Msk                       (0x1U << PORT_PDR_P1_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P2_Pos                       (2)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P2_Msk                       (0x1U << PORT_PDR_P2_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P3_Pos                       (3)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P3_Msk                       (0x1U << PORT_PDR_P3_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P4_Pos                       (4)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P4_Msk                       (0x1U << PORT_PDR_P4_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P5_Pos                       (5)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P5_Msk                       (0x1U << PORT_PDR_P5_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P6_Pos                       (6)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P6_Msk                       (0x1U << PORT_PDR_P6_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P7_Pos                       (7)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P7_Msk                       (0x1U << PORT_PDR_P7_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P8_Pos                       (8)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P8_Msk                       (0x1U << PORT_PDR_P8_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P9_Pos                       (9)                                            /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P9_Msk                       (0x1U << PORT_PDR_P9_Pos)                      /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P10_Pos                      (10)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P10_Msk                      (0x1U << PORT_PDR_P10_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P11_Pos                      (11)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P11_Msk                      (0x1U << PORT_PDR_P11_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P12_Pos                      (12)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P12_Msk                      (0x1U << PORT_PDR_P12_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P13_Pos                      (13)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P13_Msk                      (0x1U << PORT_PDR_P13_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P14_Pos                      (14)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P14_Msk                      (0x1U << PORT_PDR_P14_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P15_Pos                      (15)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P15_Msk                      (0x1U << PORT_PDR_P15_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P16_Pos                      (16)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P16_Msk                      (0x1U << PORT_PDR_P16_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P17_Pos                      (17)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P17_Msk                      (0x1U << PORT_PDR_P17_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P18_Pos                      (18)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P18_Msk                      (0x1U << PORT_PDR_P18_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P19_Pos                      (19)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P19_Msk                      (0x1U << PORT_PDR_P19_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P20_Pos                      (20)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P20_Msk                      (0x1U << PORT_PDR_P20_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P21_Pos                      (21)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P21_Msk                      (0x1U << PORT_PDR_P21_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P22_Pos                      (22)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P22_Msk                      (0x1U << PORT_PDR_P22_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P23_Pos                      (23)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P23_Msk                      (0x1U << PORT_PDR_P23_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P24_Pos                      (24)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P24_Msk                      (0x1U << PORT_PDR_P24_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P25_Pos                      (25)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P25_Msk                      (0x1U << PORT_PDR_P25_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P26_Pos                      (26)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P26_Msk                      (0x1U << PORT_PDR_P26_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P27_Pos                      (27)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P27_Msk                      (0x1U << PORT_PDR_P27_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P28_Pos                      (28)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P28_Msk                      (0x1U << PORT_PDR_P28_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P29_Pos                      (29)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P29_Msk                      (0x1U << PORT_PDR_P29_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P30_Pos                      (30)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P30_Msk                      (0x1U << PORT_PDR_P30_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_P31_Pos                      (31)                                           /**< (PORT_PDR) PORT Disable Position */
#define PORT_PDR_P31_Msk                      (0x1U << PORT_PDR_P31_Pos)                     /**< (PORT_PDR) PORT Disable Mask */
#define PORT_PDR_Msk                          (0xFFFFFFFFUL)                                 /**< (PORT_PDR) Register Mask  */
#define PORT_PDR_P_Pos                        (0)                                            /**< (PORT_PDR Position) PORT Disable */
#define PORT_PDR_P_Msk                        (0xFFFFFFFFU << PORT_PDR_P_Pos)                /**< (PORT_PDR Mask) P */
#define PORT_PDR_P(value)                     (PORT_PDR_P_Msk & ((value) << PORT_PDR_P_Pos))

/* -------- PORT_PSR : (PORT Offset: 0x08) (R/ 32) PORT Status Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  PORT Status                                   */
    uint32_t P1:1;                      /**< bit:      1  PORT Status                                   */
    uint32_t P2:1;                      /**< bit:      2  PORT Status                                   */
    uint32_t P3:1;                      /**< bit:      3  PORT Status                                   */
    uint32_t P4:1;                      /**< bit:      4  PORT Status                                   */
    uint32_t P5:1;                      /**< bit:      5  PORT Status                                   */
    uint32_t P6:1;                      /**< bit:      6  PORT Status                                   */
    uint32_t P7:1;                      /**< bit:      7  PORT Status                                   */
    uint32_t P8:1;                      /**< bit:      8  PORT Status                                   */
    uint32_t P9:1;                      /**< bit:      9  PORT Status                                   */
    uint32_t P10:1;                     /**< bit:     10  PORT Status                                   */
    uint32_t P11:1;                     /**< bit:     11  PORT Status                                   */
    uint32_t P12:1;                     /**< bit:     12  PORT Status                                   */
    uint32_t P13:1;                     /**< bit:     13  PORT Status                                   */
    uint32_t P14:1;                     /**< bit:     14  PORT Status                                   */
    uint32_t P15:1;                     /**< bit:     15  PORT Status                                   */
    uint32_t P16:1;                     /**< bit:     16  PORT Status                                   */
    uint32_t P17:1;                     /**< bit:     17  PORT Status                                   */
    uint32_t P18:1;                     /**< bit:     18  PORT Status                                   */
    uint32_t P19:1;                     /**< bit:     19  PORT Status                                   */
    uint32_t P20:1;                     /**< bit:     20  PORT Status                                   */
    uint32_t P21:1;                     /**< bit:     21  PORT Status                                   */
    uint32_t P22:1;                     /**< bit:     22  PORT Status                                   */
    uint32_t P23:1;                     /**< bit:     23  PORT Status                                   */
    uint32_t P24:1;                     /**< bit:     24  PORT Status                                   */
    uint32_t P25:1;                     /**< bit:     25  PORT Status                                   */
    uint32_t P26:1;                     /**< bit:     26  PORT Status                                   */
    uint32_t P27:1;                     /**< bit:     27  PORT Status                                   */
    uint32_t P28:1;                     /**< bit:     28  PORT Status                                   */
    uint32_t P29:1;                     /**< bit:     29  PORT Status                                   */
    uint32_t P30:1;                     /**< bit:     30  PORT Status                                   */
    uint32_t P31:1;                     /**< bit:     31  PORT Status                                   */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  PORT Status                                   */
  };
  uint32_t w;
} __PORT_PSR_bits_t;

