zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_PSR_P0_Pos                       (0)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P0_Msk                       (0x1U << PORT_PSR_P0_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P1_Pos                       (1)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P1_Msk                       (0x1U << PORT_PSR_P1_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P2_Pos                       (2)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P2_Msk                       (0x1U << PORT_PSR_P2_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P3_Pos                       (3)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P3_Msk                       (0x1U << PORT_PSR_P3_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P4_Pos                       (4)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P4_Msk                       (0x1U << PORT_PSR_P4_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P5_Pos                       (5)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P5_Msk                       (0x1U << PORT_PSR_P5_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P6_Pos                       (6)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P6_Msk                       (0x1U << PORT_PSR_P6_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P7_Pos                       (7)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P7_Msk                       (0x1U << PORT_PSR_P7_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P8_Pos                       (8)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P8_Msk                       (0x1U << PORT_PSR_P8_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P9_Pos                       (9)                                            /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P9_Msk                       (0x1U << PORT_PSR_P9_Pos)                      /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P10_Pos                      (10)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P10_Msk                      (0x1U << PORT_PSR_P10_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P11_Pos                      (11)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P11_Msk                      (0x1U << PORT_PSR_P11_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P12_Pos                      (12)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P12_Msk                      (0x1U << PORT_PSR_P12_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P13_Pos                      (13)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P13_Msk                      (0x1U << PORT_PSR_P13_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P14_Pos                      (14)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P14_Msk                      (0x1U << PORT_PSR_P14_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P15_Pos                      (15)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P15_Msk                      (0x1U << PORT_PSR_P15_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P16_Pos                      (16)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P16_Msk                      (0x1U << PORT_PSR_P16_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P17_Pos                      (17)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P17_Msk                      (0x1U << PORT_PSR_P17_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P18_Pos                      (18)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P18_Msk                      (0x1U << PORT_PSR_P18_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P19_Pos                      (19)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P19_Msk                      (0x1U << PORT_PSR_P19_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P20_Pos                      (20)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P20_Msk                      (0x1U << PORT_PSR_P20_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P21_Pos                      (21)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P21_Msk                      (0x1U << PORT_PSR_P21_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P22_Pos                      (22)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P22_Msk                      (0x1U << PORT_PSR_P22_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P23_Pos                      (23)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P23_Msk                      (0x1U << PORT_PSR_P23_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P24_Pos                      (24)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P24_Msk                      (0x1U << PORT_PSR_P24_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P25_Pos                      (25)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P25_Msk                      (0x1U << PORT_PSR_P25_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P26_Pos                      (26)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P26_Msk                      (0x1U << PORT_PSR_P26_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P27_Pos                      (27)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P27_Msk                      (0x1U << PORT_PSR_P27_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P28_Pos                      (28)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P28_Msk                      (0x1U << PORT_PSR_P28_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P29_Pos                      (29)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P29_Msk                      (0x1U << PORT_PSR_P29_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P30_Pos                      (30)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P30_Msk                      (0x1U << PORT_PSR_P30_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_P31_Pos                      (31)                                           /**< (PORT_PSR) PORT Status Position */
#define PORT_PSR_P31_Msk                      (0x1U << PORT_PSR_P31_Pos)                     /**< (PORT_PSR) PORT Status Mask */
#define PORT_PSR_Msk                          (0xFFFFFFFFUL)                                 /**< (PORT_PSR) Register Mask  */
#define PORT_PSR_P_Pos                        (0)                                            /**< (PORT_PSR Position) PORT Status */
#define PORT_PSR_P_Msk                        (0xFFFFFFFFU << PORT_PSR_P_Pos)                /**< (PORT_PSR Mask) P */
#define PORT_PSR_P(value)                     (PORT_PSR_P_Msk & ((value) << PORT_PSR_P_Pos))

/* -------- PORT_OER : (PORT Offset: 0x10) (/W 32) Output Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Output Enable                                 */
    uint32_t P1:1;                      /**< bit:      1  Output Enable                                 */
    uint32_t P2:1;                      /**< bit:      2  Output Enable                                 */
    uint32_t P3:1;                      /**< bit:      3  Output Enable                                 */
    uint32_t P4:1;                      /**< bit:      4  Output Enable                                 */
    uint32_t P5:1;                      /**< bit:      5  Output Enable                                 */
    uint32_t P6:1;                      /**< bit:      6  Output Enable                                 */
    uint32_t P7:1;                      /**< bit:      7  Output Enable                                 */
    uint32_t P8:1;                      /**< bit:      8  Output Enable                                 */
    uint32_t P9:1;                      /**< bit:      9  Output Enable                                 */
    uint32_t P10:1;                     /**< bit:     10  Output Enable                                 */
    uint32_t P11:1;                     /**< bit:     11  Output Enable                                 */
    uint32_t P12:1;                     /**< bit:     12  Output Enable                                 */
    uint32_t P13:1;                     /**< bit:     13  Output Enable                                 */
    uint32_t P14:1;                     /**< bit:     14  Output Enable                                 */
    uint32_t P15:1;                     /**< bit:     15  Output Enable                                 */
    uint32_t P16:1;                     /**< bit:     16  Output Enable                                 */
    uint32_t P17:1;                     /**< bit:     17  Output Enable                                 */
    uint32_t P18:1;                     /**< bit:     18  Output Enable                                 */
    uint32_t P19:1;                     /**< bit:     19  Output Enable                                 */
    uint32_t P20:1;                     /**< bit:     20  Output Enable                                 */
    uint32_t P21:1;                     /**< bit:     21  Output Enable                                 */
    uint32_t P22:1;                     /**< bit:     22  Output Enable                                 */
    uint32_t P23:1;                     /**< bit:     23  Output Enable                                 */
    uint32_t P24:1;                     /**< bit:     24  Output Enable                                 */
    uint32_t P25:1;                     /**< bit:     25  Output Enable                                 */
    uint32_t P26:1;                     /**< bit:     26  Output Enable                                 */
    uint32_t P27:1;                     /**< bit:     27  Output Enable                                 */
    uint32_t P28:1;                     /**< bit:     28  Output Enable                                 */
    uint32_t P29:1;                     /**< bit:     29  Output Enable                                 */
    uint32_t P30:1;                     /**< bit:     30  Output Enable                                 */
    uint32_t P31:1;                     /**< bit:     31  Output Enable                                 */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Output Enable                                 */
  };
  uint32_t w;
} __PORT_OER_bits_t;

