zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_IFDR_P0_Pos                      (0)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P0_Msk                      (0x1U << PORT_IFDR_P0_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P1_Pos                      (1)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P1_Msk                      (0x1U << PORT_IFDR_P1_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P2_Pos                      (2)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P2_Msk                      (0x1U << PORT_IFDR_P2_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P3_Pos                      (3)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P3_Msk                      (0x1U << PORT_IFDR_P3_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P4_Pos                      (4)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P4_Msk                      (0x1U << PORT_IFDR_P4_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P5_Pos                      (5)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P5_Msk                      (0x1U << PORT_IFDR_P5_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P6_Pos                      (6)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P6_Msk                      (0x1U << PORT_IFDR_P6_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P7_Pos                      (7)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P7_Msk                      (0x1U << PORT_IFDR_P7_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P8_Pos                      (8)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P8_Msk                      (0x1U << PORT_IFDR_P8_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P9_Pos                      (9)                                            /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P9_Msk                      (0x1U << PORT_IFDR_P9_Pos)                     /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P10_Pos                     (10)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P10_Msk                     (0x1U << PORT_IFDR_P10_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P11_Pos                     (11)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P11_Msk                     (0x1U << PORT_IFDR_P11_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P12_Pos                     (12)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P12_Msk                     (0x1U << PORT_IFDR_P12_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P13_Pos                     (13)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P13_Msk                     (0x1U << PORT_IFDR_P13_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P14_Pos                     (14)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P14_Msk                     (0x1U << PORT_IFDR_P14_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P15_Pos                     (15)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P15_Msk                     (0x1U << PORT_IFDR_P15_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P16_Pos                     (16)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P16_Msk                     (0x1U << PORT_IFDR_P16_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P17_Pos                     (17)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P17_Msk                     (0x1U << PORT_IFDR_P17_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P18_Pos                     (18)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P18_Msk                     (0x1U << PORT_IFDR_P18_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P19_Pos                     (19)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P19_Msk                     (0x1U << PORT_IFDR_P19_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P20_Pos                     (20)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P20_Msk                     (0x1U << PORT_IFDR_P20_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P21_Pos                     (21)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P21_Msk                     (0x1U << PORT_IFDR_P21_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P22_Pos                     (22)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P22_Msk                     (0x1U << PORT_IFDR_P22_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P23_Pos                     (23)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P23_Msk                     (0x1U << PORT_IFDR_P23_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P24_Pos                     (24)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P24_Msk                     (0x1U << PORT_IFDR_P24_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P25_Pos                     (25)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P25_Msk                     (0x1U << PORT_IFDR_P25_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P26_Pos                     (26)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P26_Msk                     (0x1U << PORT_IFDR_P26_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P27_Pos                     (27)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P27_Msk                     (0x1U << PORT_IFDR_P27_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P28_Pos                     (28)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P28_Msk                     (0x1U << PORT_IFDR_P28_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P29_Pos                     (29)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P29_Msk                     (0x1U << PORT_IFDR_P29_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P30_Pos                     (30)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P30_Msk                     (0x1U << PORT_IFDR_P30_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_P31_Pos                     (31)                                           /**< (PORT_IFDR) Input Filter Disable Position */
#define PORT_IFDR_P31_Msk                     (0x1U << PORT_IFDR_P31_Pos)                    /**< (PORT_IFDR) Input Filter Disable Mask */
#define PORT_IFDR_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_IFDR) Register Mask  */
#define PORT_IFDR_P_Pos                       (0)                                            /**< (PORT_IFDR Position) Input Filter Disable */
#define PORT_IFDR_P_Msk                       (0xFFFFFFFFU << PORT_IFDR_P_Pos)               /**< (PORT_IFDR Mask) P */
#define PORT_IFDR_P(value)                    (PORT_IFDR_P_Msk & ((value) << PORT_IFDR_P_Pos))

/* -------- PORT_IFSR : (PORT Offset: 0x28) (R/ 32) Glitch Input Filter Status Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Input Filter Status                           */
    uint32_t P1:1;                      /**< bit:      1  Input Filter Status                           */
    uint32_t P2:1;                      /**< bit:      2  Input Filter Status                           */
    uint32_t P3:1;                      /**< bit:      3  Input Filter Status                           */
    uint32_t P4:1;                      /**< bit:      4  Input Filter Status                           */
    uint32_t P5:1;                      /**< bit:      5  Input Filter Status                           */
    uint32_t P6:1;                      /**< bit:      6  Input Filter Status                           */
    uint32_t P7:1;                      /**< bit:      7  Input Filter Status                           */
    uint32_t P8:1;                      /**< bit:      8  Input Filter Status                           */
    uint32_t P9:1;                      /**< bit:      9  Input Filter Status                           */
    uint32_t P10:1;                     /**< bit:     10  Input Filter Status                           */
    uint32_t P11:1;                     /**< bit:     11  Input Filter Status                           */
    uint32_t P12:1;                     /**< bit:     12  Input Filter Status                           */
    uint32_t P13:1;                     /**< bit:     13  Input Filter Status                           */
    uint32_t P14:1;                     /**< bit:     14  Input Filter Status                           */
    uint32_t P15:1;                     /**< bit:     15  Input Filter Status                           */
    uint32_t P16:1;                     /**< bit:     16  Input Filter Status                           */
    uint32_t P17:1;                     /**< bit:     17  Input Filter Status                           */
    uint32_t P18:1;                     /**< bit:     18  Input Filter Status                           */
    uint32_t P19:1;                     /**< bit:     19  Input Filter Status                           */
    uint32_t P20:1;                     /**< bit:     20  Input Filter Status                           */
    uint32_t P21:1;                     /**< bit:     21  Input Filter Status                           */
    uint32_t P22:1;                     /**< bit:     22  Input Filter Status                           */
    uint32_t P23:1;                     /**< bit:     23  Input Filter Status                           */
    uint32_t P24:1;                     /**< bit:     24  Input Filter Status                           */
    uint32_t P25:1;                     /**< bit:     25  Input Filter Status                           */
    uint32_t P26:1;                     /**< bit:     26  Input Filter Status                           */
    uint32_t P27:1;                     /**< bit:     27  Input Filter Status                           */
    uint32_t P28:1;                     /**< bit:     28  Input Filter Status                           */
    uint32_t P29:1;                     /**< bit:     29  Input Filter Status                           */
    uint32_t P30:1;                     /**< bit:     30  Input Filter Status                           */
    uint32_t P31:1;                     /**< bit:     31  Input Filter Status                           */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Input Filter Status                           */
  };
  uint32_t w;
} __PORT_IFSR_bits_t;

#define PORT_IFSR_P0_Pos                      (0)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P0_Msk                      (0x1U << PORT_IFSR_P0_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P1_Pos                      (1)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P1_Msk                      (0x1U << PORT_IFSR_P1_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P2_Pos                      (2)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P2_Msk                      (0x1U << PORT_IFSR_P2_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P3_Pos                      (3)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P3_Msk                      (0x1U << PORT_IFSR_P3_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P4_Pos                      (4)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P4_Msk                      (0x1U << PORT_IFSR_P4_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P5_Pos                      (5)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P5_Msk                      (0x1U << PORT_IFSR_P5_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P6_Pos                      (6)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P6_Msk                      (0x1U << PORT_IFSR_P6_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P7_Pos                      (7)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P7_Msk                      (0x1U << PORT_IFSR_P7_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P8_Pos                      (8)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P8_Msk                      (0x1U << PORT_IFSR_P8_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P9_Pos                      (9)                                            /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P9_Msk                      (0x1U << PORT_IFSR_P9_Pos)                     /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P10_Pos                     (10)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P10_Msk                     (0x1U << PORT_IFSR_P10_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P11_Pos                     (11)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P11_Msk                     (0x1U << PORT_IFSR_P11_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P12_Pos                     (12)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P12_Msk                     (0x1U << PORT_IFSR_P12_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P13_Pos                     (13)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P13_Msk                     (0x1U << PORT_IFSR_P13_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P14_Pos                     (14)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P14_Msk                     (0x1U << PORT_IFSR_P14_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P15_Pos                     (15)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P15_Msk                     (0x1U << PORT_IFSR_P15_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P16_Pos                     (16)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P16_Msk                     (0x1U << PORT_IFSR_P16_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P17_Pos                     (17)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P17_Msk                     (0x1U << PORT_IFSR_P17_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P18_Pos                     (18)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P18_Msk                     (0x1U << PORT_IFSR_P18_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P19_Pos                     (19)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P19_Msk                     (0x1U << PORT_IFSR_P19_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P20_Pos                     (20)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P20_Msk                     (0x1U << PORT_IFSR_P20_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P21_Pos                     (21)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P21_Msk                     (0x1U << PORT_IFSR_P21_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P22_Pos                     (22)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P22_Msk                     (0x1U << PORT_IFSR_P22_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P23_Pos                     (23)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P23_Msk                     (0x1U << PORT_IFSR_P23_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P24_Pos                     (24)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P24_Msk                     (0x1U << PORT_IFSR_P24_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P25_Pos                     (25)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P25_Msk                     (0x1U << PORT_IFSR_P25_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P26_Pos                     (26)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P26_Msk                     (0x1U << PORT_IFSR_P26_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P27_Pos                     (27)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P27_Msk                     (0x1U << PORT_IFSR_P27_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P28_Pos                     (28)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P28_Msk                     (0x1U << PORT_IFSR_P28_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P29_Pos                     (29)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P29_Msk                     (0x1U << PORT_IFSR_P29_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P30_Pos                     (30)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P30_Msk                     (0x1U << PORT_IFSR_P30_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_P31_Pos                     (31)                                           /**< (PORT_IFSR) Input Filter Status Position */
#define PORT_IFSR_P31_Msk                     (0x1U << PORT_IFSR_P31_Pos)                    /**< (PORT_IFSR) Input Filter Status Mask */
#define PORT_IFSR_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_IFSR) Register Mask  */
#define PORT_IFSR_P_Pos                       (0)                                            /**< (PORT_IFSR Position) Input Filter Status */
#define PORT_IFSR_P_Msk                       (0xFFFFFFFFU << PORT_IFSR_P_Pos)               /**< (PORT_IFSR Mask) P */
#define PORT_IFSR_P(value)                    (PORT_IFSR_P_Msk & ((value) << PORT_IFSR_P_Pos))

