zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/* -------- PORT_SODR : (PORT Offset: 0x30) (/W 32) Set Output Data Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Set Output Data                               */
    uint32_t P1:1;                      /**< bit:      1  Set Output Data                               */
    uint32_t P2:1;                      /**< bit:      2  Set Output Data                               */
    uint32_t P3:1;                      /**< bit:      3  Set Output Data                               */
    uint32_t P4:1;                      /**< bit:      4  Set Output Data                               */
    uint32_t P5:1;                      /**< bit:      5  Set Output Data                               */
    uint32_t P6:1;                      /**< bit:      6  Set Output Data                               */
    uint32_t P7:1;                      /**< bit:      7  Set Output Data                               */
    uint32_t P8:1;                      /**< bit:      8  Set Output Data                               */
    uint32_t P9:1;                      /**< bit:      9  Set Output Data                               */
    uint32_t P10:1;                     /**< bit:     10  Set Output Data                               */
    uint32_t P11:1;                     /**< bit:     11  Set Output Data                               */
    uint32_t P12:1;                     /**< bit:     12  Set Output Data                               */
    uint32_t P13:1;                     /**< bit:     13  Set Output Data                               */
    uint32_t P14:1;                     /**< bit:     14  Set Output Data                               */
    uint32_t P15:1;                     /**< bit:     15  Set Output Data                               */
    uint32_t P16:1;                     /**< bit:     16  Set Output Data                               */
    uint32_t P17:1;                     /**< bit:     17  Set Output Data                               */
    uint32_t P18:1;                     /**< bit:     18  Set Output Data                               */
    uint32_t P19:1;                     /**< bit:     19  Set Output Data                               */
    uint32_t P20:1;                     /**< bit:     20  Set Output Data                               */
    uint32_t P21:1;                     /**< bit:     21  Set Output Data                               */
    uint32_t P22:1;                     /**< bit:     22  Set Output Data                               */
    uint32_t P23:1;                     /**< bit:     23  Set Output Data                               */
    uint32_t P24:1;                     /**< bit:     24  Set Output Data                               */
    uint32_t P25:1;                     /**< bit:     25  Set Output Data                               */
    uint32_t P26:1;                     /**< bit:     26  Set Output Data                               */
    uint32_t P27:1;                     /**< bit:     27  Set Output Data                               */
    uint32_t P28:1;                     /**< bit:     28  Set Output Data                               */
    uint32_t P29:1;                     /**< bit:     29  Set Output Data                               */
    uint32_t P30:1;                     /**< bit:     30  Set Output Data                               */
    uint32_t P31:1;                     /**< bit:     31  Set Output Data                               */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Set Output Data                               */
  };
  uint32_t w;
} __PORT_SODR_bits_t;

#define PORT_SODR_P0_Pos                      (0)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P0_Msk                      (0x1U << PORT_SODR_P0_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P1_Pos                      (1)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P1_Msk                      (0x1U << PORT_SODR_P1_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P2_Pos                      (2)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P2_Msk                      (0x1U << PORT_SODR_P2_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P3_Pos                      (3)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P3_Msk                      (0x1U << PORT_SODR_P3_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P4_Pos                      (4)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P4_Msk                      (0x1U << PORT_SODR_P4_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P5_Pos                      (5)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P5_Msk                      (0x1U << PORT_SODR_P5_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P6_Pos                      (6)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P6_Msk                      (0x1U << PORT_SODR_P6_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P7_Pos                      (7)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P7_Msk                      (0x1U << PORT_SODR_P7_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P8_Pos                      (8)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P8_Msk                      (0x1U << PORT_SODR_P8_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P9_Pos                      (9)                                            /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P9_Msk                      (0x1U << PORT_SODR_P9_Pos)                     /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P10_Pos                     (10)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P10_Msk                     (0x1U << PORT_SODR_P10_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P11_Pos                     (11)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P11_Msk                     (0x1U << PORT_SODR_P11_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P12_Pos                     (12)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P12_Msk                     (0x1U << PORT_SODR_P12_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P13_Pos                     (13)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P13_Msk                     (0x1U << PORT_SODR_P13_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P14_Pos                     (14)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P14_Msk                     (0x1U << PORT_SODR_P14_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P15_Pos                     (15)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P15_Msk                     (0x1U << PORT_SODR_P15_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P16_Pos                     (16)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P16_Msk                     (0x1U << PORT_SODR_P16_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P17_Pos                     (17)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P17_Msk                     (0x1U << PORT_SODR_P17_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P18_Pos                     (18)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P18_Msk                     (0x1U << PORT_SODR_P18_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P19_Pos                     (19)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P19_Msk                     (0x1U << PORT_SODR_P19_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P20_Pos                     (20)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P20_Msk                     (0x1U << PORT_SODR_P20_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P21_Pos                     (21)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P21_Msk                     (0x1U << PORT_SODR_P21_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P22_Pos                     (22)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P22_Msk                     (0x1U << PORT_SODR_P22_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P23_Pos                     (23)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P23_Msk                     (0x1U << PORT_SODR_P23_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P24_Pos                     (24)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P24_Msk                     (0x1U << PORT_SODR_P24_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P25_Pos                     (25)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P25_Msk                     (0x1U << PORT_SODR_P25_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P26_Pos                     (26)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P26_Msk                     (0x1U << PORT_SODR_P26_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P27_Pos                     (27)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P27_Msk                     (0x1U << PORT_SODR_P27_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P28_Pos                     (28)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P28_Msk                     (0x1U << PORT_SODR_P28_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P29_Pos                     (29)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P29_Msk                     (0x1U << PORT_SODR_P29_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P30_Pos                     (30)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P30_Msk                     (0x1U << PORT_SODR_P30_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_P31_Pos                     (31)                                           /**< (PORT_SODR) Set Output Data Position */
#define PORT_SODR_P31_Msk                     (0x1U << PORT_SODR_P31_Pos)                    /**< (PORT_SODR) Set Output Data Mask */
#define PORT_SODR_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_SODR) Register Mask  */
#define PORT_SODR_P_Pos                       (0)                                            /**< (PORT_SODR Position) Set Output Data */
#define PORT_SODR_P_Msk                       (0xFFFFFFFFU << PORT_SODR_P_Pos)               /**< (PORT_SODR Mask) P */
#define PORT_SODR_P(value)                    (PORT_SODR_P_Msk & ((value) << PORT_SODR_P_Pos))

/* -------- PORT_CODR : (PORT Offset: 0x34) (/W 32) Clear Output Data Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Clear Output Data                             */
    uint32_t P1:1;                      /**< bit:      1  Clear Output Data                             */
    uint32_t P2:1;                      /**< bit:      2  Clear Output Data                             */
    uint32_t P3:1;                      /**< bit:      3  Clear Output Data                             */
    uint32_t P4:1;                      /**< bit:      4  Clear Output Data                             */
    uint32_t P5:1;                      /**< bit:      5  Clear Output Data                             */
    uint32_t P6:1;                      /**< bit:      6  Clear Output Data                             */
    uint32_t P7:1;                      /**< bit:      7  Clear Output Data                             */
    uint32_t P8:1;                      /**< bit:      8  Clear Output Data                             */
    uint32_t P9:1;                      /**< bit:      9  Clear Output Data                             */
    uint32_t P10:1;                     /**< bit:     10  Clear Output Data                             */
    uint32_t P11:1;                     /**< bit:     11  Clear Output Data                             */
    uint32_t P12:1;                     /**< bit:     12  Clear Output Data                             */
    uint32_t P13:1;                     /**< bit:     13  Clear Output Data                             */
    uint32_t P14:1;                     /**< bit:     14  Clear Output Data                             */
    uint32_t P15:1;                     /**< bit:     15  Clear Output Data                             */
    uint32_t P16:1;                     /**< bit:     16  Clear Output Data                             */
    uint32_t P17:1;                     /**< bit:     17  Clear Output Data                             */
    uint32_t P18:1;                     /**< bit:     18  Clear Output Data                             */
    uint32_t P19:1;                     /**< bit:     19  Clear Output Data                             */
    uint32_t P20:1;                     /**< bit:     20  Clear Output Data                             */
    uint32_t P21:1;                     /**< bit:     21  Clear Output Data                             */
    uint32_t P22:1;                     /**< bit:     22  Clear Output Data                             */
    uint32_t P23:1;                     /**< bit:     23  Clear Output Data                             */
    uint32_t P24:1;                     /**< bit:     24  Clear Output Data                             */
    uint32_t P25:1;                     /**< bit:     25  Clear Output Data                             */
    uint32_t P26:1;                     /**< bit:     26  Clear Output Data                             */
    uint32_t P27:1;                     /**< bit:     27  Clear Output Data                             */
    uint32_t P28:1;                     /**< bit:     28  Clear Output Data                             */
    uint32_t P29:1;                     /**< bit:     29  Clear Output Data                             */
    uint32_t P30:1;                     /**< bit:     30  Clear Output Data                             */
    uint32_t P31:1;                     /**< bit:     31  Clear Output Data                             */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Clear Output Data                             */
  };
  uint32_t w;
} __PORT_CODR_bits_t;

