zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_ODSR_P0_Pos                      (0)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P0_Msk                      (0x1U << PORT_ODSR_P0_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P1_Pos                      (1)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P1_Msk                      (0x1U << PORT_ODSR_P1_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P2_Pos                      (2)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P2_Msk                      (0x1U << PORT_ODSR_P2_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P3_Pos                      (3)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P3_Msk                      (0x1U << PORT_ODSR_P3_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P4_Pos                      (4)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P4_Msk                      (0x1U << PORT_ODSR_P4_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P5_Pos                      (5)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P5_Msk                      (0x1U << PORT_ODSR_P5_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P6_Pos                      (6)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P6_Msk                      (0x1U << PORT_ODSR_P6_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P7_Pos                      (7)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P7_Msk                      (0x1U << PORT_ODSR_P7_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P8_Pos                      (8)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P8_Msk                      (0x1U << PORT_ODSR_P8_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P9_Pos                      (9)                                            /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P9_Msk                      (0x1U << PORT_ODSR_P9_Pos)                     /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P10_Pos                     (10)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P10_Msk                     (0x1U << PORT_ODSR_P10_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P11_Pos                     (11)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P11_Msk                     (0x1U << PORT_ODSR_P11_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P12_Pos                     (12)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P12_Msk                     (0x1U << PORT_ODSR_P12_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P13_Pos                     (13)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P13_Msk                     (0x1U << PORT_ODSR_P13_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P14_Pos                     (14)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P14_Msk                     (0x1U << PORT_ODSR_P14_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P15_Pos                     (15)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P15_Msk                     (0x1U << PORT_ODSR_P15_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P16_Pos                     (16)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P16_Msk                     (0x1U << PORT_ODSR_P16_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P17_Pos                     (17)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P17_Msk                     (0x1U << PORT_ODSR_P17_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P18_Pos                     (18)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P18_Msk                     (0x1U << PORT_ODSR_P18_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P19_Pos                     (19)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P19_Msk                     (0x1U << PORT_ODSR_P19_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P20_Pos                     (20)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P20_Msk                     (0x1U << PORT_ODSR_P20_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P21_Pos                     (21)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P21_Msk                     (0x1U << PORT_ODSR_P21_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P22_Pos                     (22)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P22_Msk                     (0x1U << PORT_ODSR_P22_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P23_Pos                     (23)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P23_Msk                     (0x1U << PORT_ODSR_P23_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P24_Pos                     (24)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P24_Msk                     (0x1U << PORT_ODSR_P24_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P25_Pos                     (25)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P25_Msk                     (0x1U << PORT_ODSR_P25_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P26_Pos                     (26)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P26_Msk                     (0x1U << PORT_ODSR_P26_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P27_Pos                     (27)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P27_Msk                     (0x1U << PORT_ODSR_P27_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P28_Pos                     (28)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P28_Msk                     (0x1U << PORT_ODSR_P28_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P29_Pos                     (29)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P29_Msk                     (0x1U << PORT_ODSR_P29_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P30_Pos                     (30)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P30_Msk                     (0x1U << PORT_ODSR_P30_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_P31_Pos                     (31)                                           /**< (PORT_ODSR) Output Data Status Position */
#define PORT_ODSR_P31_Msk                     (0x1U << PORT_ODSR_P31_Pos)                    /**< (PORT_ODSR) Output Data Status Mask */
#define PORT_ODSR_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_ODSR) Register Mask  */
#define PORT_ODSR_P_Pos                       (0)                                            /**< (PORT_ODSR Position) Output Data Status */
#define PORT_ODSR_P_Msk                       (0xFFFFFFFFU << PORT_ODSR_P_Pos)               /**< (PORT_ODSR Mask) P */
#define PORT_ODSR_P(value)                    (PORT_ODSR_P_Msk & ((value) << PORT_ODSR_P_Pos))

