zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_IDR_P0_Pos                       (0)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P0_Msk                       (0x1U << PORT_IDR_P0_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P1_Pos                       (1)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P1_Msk                       (0x1U << PORT_IDR_P1_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P2_Pos                       (2)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P2_Msk                       (0x1U << PORT_IDR_P2_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P3_Pos                       (3)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P3_Msk                       (0x1U << PORT_IDR_P3_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P4_Pos                       (4)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P4_Msk                       (0x1U << PORT_IDR_P4_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P5_Pos                       (5)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P5_Msk                       (0x1U << PORT_IDR_P5_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P6_Pos                       (6)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P6_Msk                       (0x1U << PORT_IDR_P6_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P7_Pos                       (7)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P7_Msk                       (0x1U << PORT_IDR_P7_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P8_Pos                       (8)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P8_Msk                       (0x1U << PORT_IDR_P8_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P9_Pos                       (9)                                            /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P9_Msk                       (0x1U << PORT_IDR_P9_Pos)                      /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P10_Pos                      (10)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P10_Msk                      (0x1U << PORT_IDR_P10_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P11_Pos                      (11)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P11_Msk                      (0x1U << PORT_IDR_P11_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P12_Pos                      (12)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P12_Msk                      (0x1U << PORT_IDR_P12_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P13_Pos                      (13)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P13_Msk                      (0x1U << PORT_IDR_P13_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P14_Pos                      (14)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P14_Msk                      (0x1U << PORT_IDR_P14_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P15_Pos                      (15)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P15_Msk                      (0x1U << PORT_IDR_P15_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P16_Pos                      (16)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P16_Msk                      (0x1U << PORT_IDR_P16_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P17_Pos                      (17)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P17_Msk                      (0x1U << PORT_IDR_P17_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P18_Pos                      (18)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P18_Msk                      (0x1U << PORT_IDR_P18_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P19_Pos                      (19)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P19_Msk                      (0x1U << PORT_IDR_P19_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P20_Pos                      (20)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P20_Msk                      (0x1U << PORT_IDR_P20_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P21_Pos                      (21)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P21_Msk                      (0x1U << PORT_IDR_P21_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P22_Pos                      (22)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P22_Msk                      (0x1U << PORT_IDR_P22_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P23_Pos                      (23)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P23_Msk                      (0x1U << PORT_IDR_P23_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P24_Pos                      (24)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P24_Msk                      (0x1U << PORT_IDR_P24_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P25_Pos                      (25)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P25_Msk                      (0x1U << PORT_IDR_P25_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P26_Pos                      (26)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P26_Msk                      (0x1U << PORT_IDR_P26_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P27_Pos                      (27)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P27_Msk                      (0x1U << PORT_IDR_P27_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P28_Pos                      (28)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P28_Msk                      (0x1U << PORT_IDR_P28_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P29_Pos                      (29)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P29_Msk                      (0x1U << PORT_IDR_P29_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P30_Pos                      (30)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P30_Msk                      (0x1U << PORT_IDR_P30_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_P31_Pos                      (31)                                           /**< (PORT_IDR) Input Change Interrupt Disable Position */
#define PORT_IDR_P31_Msk                      (0x1U << PORT_IDR_P31_Pos)                     /**< (PORT_IDR) Input Change Interrupt Disable Mask */
#define PORT_IDR_Msk                          (0xFFFFFFFFUL)                                 /**< (PORT_IDR) Register Mask  */
#define PORT_IDR_P_Pos                        (0)                                            /**< (PORT_IDR Position) Input Change Interrupt Disable */
#define PORT_IDR_P_Msk                        (0xFFFFFFFFU << PORT_IDR_P_Pos)                /**< (PORT_IDR Mask) P */
#define PORT_IDR_P(value)                     (PORT_IDR_P_Msk & ((value) << PORT_IDR_P_Pos))

