zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/* -------- PORT_ISR : (PORT Offset: 0x4c) (R/ 32) Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Input Change Interrupt Status                 */
    uint32_t P1:1;                      /**< bit:      1  Input Change Interrupt Status                 */
    uint32_t P2:1;                      /**< bit:      2  Input Change Interrupt Status                 */
    uint32_t P3:1;                      /**< bit:      3  Input Change Interrupt Status                 */
    uint32_t P4:1;                      /**< bit:      4  Input Change Interrupt Status                 */
    uint32_t P5:1;                      /**< bit:      5  Input Change Interrupt Status                 */
    uint32_t P6:1;                      /**< bit:      6  Input Change Interrupt Status                 */
    uint32_t P7:1;                      /**< bit:      7  Input Change Interrupt Status                 */
    uint32_t P8:1;                      /**< bit:      8  Input Change Interrupt Status                 */
    uint32_t P9:1;                      /**< bit:      9  Input Change Interrupt Status                 */
    uint32_t P10:1;                     /**< bit:     10  Input Change Interrupt Status                 */
    uint32_t P11:1;                     /**< bit:     11  Input Change Interrupt Status                 */
    uint32_t P12:1;                     /**< bit:     12  Input Change Interrupt Status                 */
    uint32_t P13:1;                     /**< bit:     13  Input Change Interrupt Status                 */
    uint32_t P14:1;                     /**< bit:     14  Input Change Interrupt Status                 */
    uint32_t P15:1;                     /**< bit:     15  Input Change Interrupt Status                 */
    uint32_t P16:1;                     /**< bit:     16  Input Change Interrupt Status                 */
    uint32_t P17:1;                     /**< bit:     17  Input Change Interrupt Status                 */
    uint32_t P18:1;                     /**< bit:     18  Input Change Interrupt Status                 */
    uint32_t P19:1;                     /**< bit:     19  Input Change Interrupt Status                 */
    uint32_t P20:1;                     /**< bit:     20  Input Change Interrupt Status                 */
    uint32_t P21:1;                     /**< bit:     21  Input Change Interrupt Status                 */
    uint32_t P22:1;                     /**< bit:     22  Input Change Interrupt Status                 */
    uint32_t P23:1;                     /**< bit:     23  Input Change Interrupt Status                 */
    uint32_t P24:1;                     /**< bit:     24  Input Change Interrupt Status                 */
    uint32_t P25:1;                     /**< bit:     25  Input Change Interrupt Status                 */
    uint32_t P26:1;                     /**< bit:     26  Input Change Interrupt Status                 */
    uint32_t P27:1;                     /**< bit:     27  Input Change Interrupt Status                 */
    uint32_t P28:1;                     /**< bit:     28  Input Change Interrupt Status                 */
    uint32_t P29:1;                     /**< bit:     29  Input Change Interrupt Status                 */
    uint32_t P30:1;                     /**< bit:     30  Input Change Interrupt Status                 */
    uint32_t P31:1;                     /**< bit:     31  Input Change Interrupt Status                 */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Input Change Interrupt Status                 */
  };
  uint32_t w;
} __PORT_ISR_bits_t;

#define PORT_ISR_P0_Pos                       (0)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P0_Msk                       (0x1U << PORT_ISR_P0_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P1_Pos                       (1)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P1_Msk                       (0x1U << PORT_ISR_P1_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P2_Pos                       (2)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P2_Msk                       (0x1U << PORT_ISR_P2_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P3_Pos                       (3)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P3_Msk                       (0x1U << PORT_ISR_P3_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P4_Pos                       (4)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P4_Msk                       (0x1U << PORT_ISR_P4_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P5_Pos                       (5)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P5_Msk                       (0x1U << PORT_ISR_P5_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P6_Pos                       (6)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P6_Msk                       (0x1U << PORT_ISR_P6_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P7_Pos                       (7)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P7_Msk                       (0x1U << PORT_ISR_P7_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P8_Pos                       (8)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P8_Msk                       (0x1U << PORT_ISR_P8_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P9_Pos                       (9)                                            /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P9_Msk                       (0x1U << PORT_ISR_P9_Pos)                      /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P10_Pos                      (10)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P10_Msk                      (0x1U << PORT_ISR_P10_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P11_Pos                      (11)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P11_Msk                      (0x1U << PORT_ISR_P11_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P12_Pos                      (12)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P12_Msk                      (0x1U << PORT_ISR_P12_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P13_Pos                      (13)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P13_Msk                      (0x1U << PORT_ISR_P13_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P14_Pos                      (14)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P14_Msk                      (0x1U << PORT_ISR_P14_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P15_Pos                      (15)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P15_Msk                      (0x1U << PORT_ISR_P15_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P16_Pos                      (16)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P16_Msk                      (0x1U << PORT_ISR_P16_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P17_Pos                      (17)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P17_Msk                      (0x1U << PORT_ISR_P17_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P18_Pos                      (18)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P18_Msk                      (0x1U << PORT_ISR_P18_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P19_Pos                      (19)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P19_Msk                      (0x1U << PORT_ISR_P19_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P20_Pos                      (20)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P20_Msk                      (0x1U << PORT_ISR_P20_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P21_Pos                      (21)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P21_Msk                      (0x1U << PORT_ISR_P21_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P22_Pos                      (22)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P22_Msk                      (0x1U << PORT_ISR_P22_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P23_Pos                      (23)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P23_Msk                      (0x1U << PORT_ISR_P23_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P24_Pos                      (24)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P24_Msk                      (0x1U << PORT_ISR_P24_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P25_Pos                      (25)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P25_Msk                      (0x1U << PORT_ISR_P25_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P26_Pos                      (26)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P26_Msk                      (0x1U << PORT_ISR_P26_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P27_Pos                      (27)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P27_Msk                      (0x1U << PORT_ISR_P27_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P28_Pos                      (28)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P28_Msk                      (0x1U << PORT_ISR_P28_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P29_Pos                      (29)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P29_Msk                      (0x1U << PORT_ISR_P29_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P30_Pos                      (30)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P30_Msk                      (0x1U << PORT_ISR_P30_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_P31_Pos                      (31)                                           /**< (PORT_ISR) Input Change Interrupt Status Position */
#define PORT_ISR_P31_Msk                      (0x1U << PORT_ISR_P31_Pos)                     /**< (PORT_ISR) Input Change Interrupt Status Mask */
#define PORT_ISR_Msk                          (0xFFFFFFFFUL)                                 /**< (PORT_ISR) Register Mask  */
#define PORT_ISR_P_Pos                        (0)                                            /**< (PORT_ISR Position) Input Change Interrupt Status */
#define PORT_ISR_P_Msk                        (0xFFFFFFFFU << PORT_ISR_P_Pos)                /**< (PORT_ISR Mask) P */
#define PORT_ISR_P(value)                     (PORT_ISR_P_Msk & ((value) << PORT_ISR_P_Pos))

/* -------- PORT_MDER : (PORT Offset: 0x50) (/W 32) Multi-driver Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Multi-drive Enable                            */
    uint32_t P1:1;                      /**< bit:      1  Multi-drive Enable                            */
    uint32_t P2:1;                      /**< bit:      2  Multi-drive Enable                            */
    uint32_t P3:1;                      /**< bit:      3  Multi-drive Enable                            */
    uint32_t P4:1;                      /**< bit:      4  Multi-drive Enable                            */
    uint32_t P5:1;                      /**< bit:      5  Multi-drive Enable                            */
    uint32_t P6:1;                      /**< bit:      6  Multi-drive Enable                            */
    uint32_t P7:1;                      /**< bit:      7  Multi-drive Enable                            */
    uint32_t P8:1;                      /**< bit:      8  Multi-drive Enable                            */
    uint32_t P9:1;                      /**< bit:      9  Multi-drive Enable                            */
    uint32_t P10:1;                     /**< bit:     10  Multi-drive Enable                            */
    uint32_t P11:1;                     /**< bit:     11  Multi-drive Enable                            */
    uint32_t P12:1;                     /**< bit:     12  Multi-drive Enable                            */
    uint32_t P13:1;                     /**< bit:     13  Multi-drive Enable                            */
    uint32_t P14:1;                     /**< bit:     14  Multi-drive Enable                            */
    uint32_t P15:1;                     /**< bit:     15  Multi-drive Enable                            */
    uint32_t P16:1;                     /**< bit:     16  Multi-drive Enable                            */
    uint32_t P17:1;                     /**< bit:     17  Multi-drive Enable                            */
    uint32_t P18:1;                     /**< bit:     18  Multi-drive Enable                            */
    uint32_t P19:1;                     /**< bit:     19  Multi-drive Enable                            */
    uint32_t P20:1;                     /**< bit:     20  Multi-drive Enable                            */
    uint32_t P21:1;                     /**< bit:     21  Multi-drive Enable                            */
    uint32_t P22:1;                     /**< bit:     22  Multi-drive Enable                            */
    uint32_t P23:1;                     /**< bit:     23  Multi-drive Enable                            */
    uint32_t P24:1;                     /**< bit:     24  Multi-drive Enable                            */
    uint32_t P25:1;                     /**< bit:     25  Multi-drive Enable                            */
    uint32_t P26:1;                     /**< bit:     26  Multi-drive Enable                            */
    uint32_t P27:1;                     /**< bit:     27  Multi-drive Enable                            */
    uint32_t P28:1;                     /**< bit:     28  Multi-drive Enable                            */
    uint32_t P29:1;                     /**< bit:     29  Multi-drive Enable                            */
    uint32_t P30:1;                     /**< bit:     30  Multi-drive Enable                            */
    uint32_t P31:1;                     /**< bit:     31  Multi-drive Enable                            */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Multi-drive Enable                            */
  };
  uint32_t w;
} __PORT_MDER_bits_t;

