zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_MDER_P0_Pos                      (0)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P0_Msk                      (0x1U << PORT_MDER_P0_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P1_Pos                      (1)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P1_Msk                      (0x1U << PORT_MDER_P1_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P2_Pos                      (2)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P2_Msk                      (0x1U << PORT_MDER_P2_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P3_Pos                      (3)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P3_Msk                      (0x1U << PORT_MDER_P3_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P4_Pos                      (4)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P4_Msk                      (0x1U << PORT_MDER_P4_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P5_Pos                      (5)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P5_Msk                      (0x1U << PORT_MDER_P5_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P6_Pos                      (6)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P6_Msk                      (0x1U << PORT_MDER_P6_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P7_Pos                      (7)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P7_Msk                      (0x1U << PORT_MDER_P7_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P8_Pos                      (8)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P8_Msk                      (0x1U << PORT_MDER_P8_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P9_Pos                      (9)                                            /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P9_Msk                      (0x1U << PORT_MDER_P9_Pos)                     /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P10_Pos                     (10)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P10_Msk                     (0x1U << PORT_MDER_P10_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P11_Pos                     (11)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P11_Msk                     (0x1U << PORT_MDER_P11_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P12_Pos                     (12)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P12_Msk                     (0x1U << PORT_MDER_P12_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P13_Pos                     (13)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P13_Msk                     (0x1U << PORT_MDER_P13_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P14_Pos                     (14)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P14_Msk                     (0x1U << PORT_MDER_P14_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P15_Pos                     (15)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P15_Msk                     (0x1U << PORT_MDER_P15_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P16_Pos                     (16)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P16_Msk                     (0x1U << PORT_MDER_P16_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P17_Pos                     (17)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P17_Msk                     (0x1U << PORT_MDER_P17_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P18_Pos                     (18)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P18_Msk                     (0x1U << PORT_MDER_P18_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P19_Pos                     (19)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P19_Msk                     (0x1U << PORT_MDER_P19_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P20_Pos                     (20)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P20_Msk                     (0x1U << PORT_MDER_P20_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P21_Pos                     (21)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P21_Msk                     (0x1U << PORT_MDER_P21_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P22_Pos                     (22)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P22_Msk                     (0x1U << PORT_MDER_P22_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P23_Pos                     (23)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P23_Msk                     (0x1U << PORT_MDER_P23_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P24_Pos                     (24)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P24_Msk                     (0x1U << PORT_MDER_P24_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P25_Pos                     (25)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P25_Msk                     (0x1U << PORT_MDER_P25_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P26_Pos                     (26)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P26_Msk                     (0x1U << PORT_MDER_P26_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P27_Pos                     (27)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P27_Msk                     (0x1U << PORT_MDER_P27_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P28_Pos                     (28)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P28_Msk                     (0x1U << PORT_MDER_P28_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P29_Pos                     (29)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P29_Msk                     (0x1U << PORT_MDER_P29_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P30_Pos                     (30)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P30_Msk                     (0x1U << PORT_MDER_P30_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_P31_Pos                     (31)                                           /**< (PORT_MDER) Multi-drive Enable Position */
#define PORT_MDER_P31_Msk                     (0x1U << PORT_MDER_P31_Pos)                    /**< (PORT_MDER) Multi-drive Enable Mask */
#define PORT_MDER_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_MDER) Register Mask  */
#define PORT_MDER_P_Pos                       (0)                                            /**< (PORT_MDER Position) Multi-drive Enable */
#define PORT_MDER_P_Msk                       (0xFFFFFFFFU << PORT_MDER_P_Pos)               /**< (PORT_MDER Mask) P */
#define PORT_MDER_P(value)                    (PORT_MDER_P_Msk & ((value) << PORT_MDER_P_Pos))

/* -------- PORT_MDDR : (PORT Offset: 0x54) (/W 32) Multi-driver Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Multi-drive Disable                           */
    uint32_t P1:1;                      /**< bit:      1  Multi-drive Disable                           */
    uint32_t P2:1;                      /**< bit:      2  Multi-drive Disable                           */
    uint32_t P3:1;                      /**< bit:      3  Multi-drive Disable                           */
    uint32_t P4:1;                      /**< bit:      4  Multi-drive Disable                           */
    uint32_t P5:1;                      /**< bit:      5  Multi-drive Disable                           */
    uint32_t P6:1;                      /**< bit:      6  Multi-drive Disable                           */
    uint32_t P7:1;                      /**< bit:      7  Multi-drive Disable                           */
    uint32_t P8:1;                      /**< bit:      8  Multi-drive Disable                           */
    uint32_t P9:1;                      /**< bit:      9  Multi-drive Disable                           */
    uint32_t P10:1;                     /**< bit:     10  Multi-drive Disable                           */
    uint32_t P11:1;                     /**< bit:     11  Multi-drive Disable                           */
    uint32_t P12:1;                     /**< bit:     12  Multi-drive Disable                           */
    uint32_t P13:1;                     /**< bit:     13  Multi-drive Disable                           */
    uint32_t P14:1;                     /**< bit:     14  Multi-drive Disable                           */
    uint32_t P15:1;                     /**< bit:     15  Multi-drive Disable                           */
    uint32_t P16:1;                     /**< bit:     16  Multi-drive Disable                           */
    uint32_t P17:1;                     /**< bit:     17  Multi-drive Disable                           */
    uint32_t P18:1;                     /**< bit:     18  Multi-drive Disable                           */
    uint32_t P19:1;                     /**< bit:     19  Multi-drive Disable                           */
    uint32_t P20:1;                     /**< bit:     20  Multi-drive Disable                           */
    uint32_t P21:1;                     /**< bit:     21  Multi-drive Disable                           */
    uint32_t P22:1;                     /**< bit:     22  Multi-drive Disable                           */
    uint32_t P23:1;                     /**< bit:     23  Multi-drive Disable                           */
    uint32_t P24:1;                     /**< bit:     24  Multi-drive Disable                           */
    uint32_t P25:1;                     /**< bit:     25  Multi-drive Disable                           */
    uint32_t P26:1;                     /**< bit:     26  Multi-drive Disable                           */
    uint32_t P27:1;                     /**< bit:     27  Multi-drive Disable                           */
    uint32_t P28:1;                     /**< bit:     28  Multi-drive Disable                           */
    uint32_t P29:1;                     /**< bit:     29  Multi-drive Disable                           */
    uint32_t P30:1;                     /**< bit:     30  Multi-drive Disable                           */
    uint32_t P31:1;                     /**< bit:     31  Multi-drive Disable                           */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Multi-drive Disable                           */
  };
  uint32_t w;
} __PORT_MDDR_bits_t;

#define PORT_MDDR_P0_Pos                      (0)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P0_Msk                      (0x1U << PORT_MDDR_P0_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P1_Pos                      (1)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P1_Msk                      (0x1U << PORT_MDDR_P1_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P2_Pos                      (2)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P2_Msk                      (0x1U << PORT_MDDR_P2_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P3_Pos                      (3)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P3_Msk                      (0x1U << PORT_MDDR_P3_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P4_Pos                      (4)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P4_Msk                      (0x1U << PORT_MDDR_P4_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P5_Pos                      (5)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P5_Msk                      (0x1U << PORT_MDDR_P5_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P6_Pos                      (6)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P6_Msk                      (0x1U << PORT_MDDR_P6_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P7_Pos                      (7)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P7_Msk                      (0x1U << PORT_MDDR_P7_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P8_Pos                      (8)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P8_Msk                      (0x1U << PORT_MDDR_P8_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P9_Pos                      (9)                                            /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P9_Msk                      (0x1U << PORT_MDDR_P9_Pos)                     /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P10_Pos                     (10)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P10_Msk                     (0x1U << PORT_MDDR_P10_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P11_Pos                     (11)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P11_Msk                     (0x1U << PORT_MDDR_P11_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P12_Pos                     (12)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P12_Msk                     (0x1U << PORT_MDDR_P12_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P13_Pos                     (13)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P13_Msk                     (0x1U << PORT_MDDR_P13_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P14_Pos                     (14)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P14_Msk                     (0x1U << PORT_MDDR_P14_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P15_Pos                     (15)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P15_Msk                     (0x1U << PORT_MDDR_P15_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P16_Pos                     (16)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P16_Msk                     (0x1U << PORT_MDDR_P16_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P17_Pos                     (17)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P17_Msk                     (0x1U << PORT_MDDR_P17_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P18_Pos                     (18)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P18_Msk                     (0x1U << PORT_MDDR_P18_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P19_Pos                     (19)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P19_Msk                     (0x1U << PORT_MDDR_P19_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P20_Pos                     (20)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P20_Msk                     (0x1U << PORT_MDDR_P20_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P21_Pos                     (21)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P21_Msk                     (0x1U << PORT_MDDR_P21_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P22_Pos                     (22)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P22_Msk                     (0x1U << PORT_MDDR_P22_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P23_Pos                     (23)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P23_Msk                     (0x1U << PORT_MDDR_P23_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P24_Pos                     (24)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P24_Msk                     (0x1U << PORT_MDDR_P24_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P25_Pos                     (25)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P25_Msk                     (0x1U << PORT_MDDR_P25_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P26_Pos                     (26)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P26_Msk                     (0x1U << PORT_MDDR_P26_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P27_Pos                     (27)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P27_Msk                     (0x1U << PORT_MDDR_P27_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P28_Pos                     (28)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P28_Msk                     (0x1U << PORT_MDDR_P28_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P29_Pos                     (29)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P29_Msk                     (0x1U << PORT_MDDR_P29_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P30_Pos                     (30)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P30_Msk                     (0x1U << PORT_MDDR_P30_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_P31_Pos                     (31)                                           /**< (PORT_MDDR) Multi-drive Disable Position */
#define PORT_MDDR_P31_Msk                     (0x1U << PORT_MDDR_P31_Pos)                    /**< (PORT_MDDR) Multi-drive Disable Mask */
#define PORT_MDDR_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_MDDR) Register Mask  */
#define PORT_MDDR_P_Pos                       (0)                                            /**< (PORT_MDDR Position) Multi-drive Disable */
#define PORT_MDDR_P_Msk                       (0xFFFFFFFFU << PORT_MDDR_P_Pos)               /**< (PORT_MDDR Mask) P */
#define PORT_MDDR_P(value)                    (PORT_MDDR_P_Msk & ((value) << PORT_MDDR_P_Pos))

/* -------- PORT_MDSR : (PORT Offset: 0x58) (R/ 32) Multi-driver Status Register -------- */

