zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/* -------- PORT_PUDR : (PORT Offset: 0x60) (/W 32) Pull-up Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Pull-Up Disable                               */
    uint32_t P1:1;                      /**< bit:      1  Pull-Up Disable                               */
    uint32_t P2:1;                      /**< bit:      2  Pull-Up Disable                               */
    uint32_t P3:1;                      /**< bit:      3  Pull-Up Disable                               */
    uint32_t P4:1;                      /**< bit:      4  Pull-Up Disable                               */
    uint32_t P5:1;                      /**< bit:      5  Pull-Up Disable                               */
    uint32_t P6:1;                      /**< bit:      6  Pull-Up Disable                               */
    uint32_t P7:1;                      /**< bit:      7  Pull-Up Disable                               */
    uint32_t P8:1;                      /**< bit:      8  Pull-Up Disable                               */
    uint32_t P9:1;                      /**< bit:      9  Pull-Up Disable                               */
    uint32_t P10:1;                     /**< bit:     10  Pull-Up Disable                               */
    uint32_t P11:1;                     /**< bit:     11  Pull-Up Disable                               */
    uint32_t P12:1;                     /**< bit:     12  Pull-Up Disable                               */
    uint32_t P13:1;                     /**< bit:     13  Pull-Up Disable                               */
    uint32_t P14:1;                     /**< bit:     14  Pull-Up Disable                               */
    uint32_t P15:1;                     /**< bit:     15  Pull-Up Disable                               */
    uint32_t P16:1;                     /**< bit:     16  Pull-Up Disable                               */
    uint32_t P17:1;                     /**< bit:     17  Pull-Up Disable                               */
    uint32_t P18:1;                     /**< bit:     18  Pull-Up Disable                               */
    uint32_t P19:1;                     /**< bit:     19  Pull-Up Disable                               */
    uint32_t P20:1;                     /**< bit:     20  Pull-Up Disable                               */
    uint32_t P21:1;                     /**< bit:     21  Pull-Up Disable                               */
    uint32_t P22:1;                     /**< bit:     22  Pull-Up Disable                               */
    uint32_t P23:1;                     /**< bit:     23  Pull-Up Disable                               */
    uint32_t P24:1;                     /**< bit:     24  Pull-Up Disable                               */
    uint32_t P25:1;                     /**< bit:     25  Pull-Up Disable                               */
    uint32_t P26:1;                     /**< bit:     26  Pull-Up Disable                               */
    uint32_t P27:1;                     /**< bit:     27  Pull-Up Disable                               */
    uint32_t P28:1;                     /**< bit:     28  Pull-Up Disable                               */
    uint32_t P29:1;                     /**< bit:     29  Pull-Up Disable                               */
    uint32_t P30:1;                     /**< bit:     30  Pull-Up Disable                               */
    uint32_t P31:1;                     /**< bit:     31  Pull-Up Disable                               */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Pull-Up Disable                               */
  };
  uint32_t w;
} __PORT_PUDR_bits_t;

#define PORT_PUDR_P0_Pos                      (0)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P0_Msk                      (0x1U << PORT_PUDR_P0_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P1_Pos                      (1)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P1_Msk                      (0x1U << PORT_PUDR_P1_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P2_Pos                      (2)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P2_Msk                      (0x1U << PORT_PUDR_P2_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P3_Pos                      (3)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P3_Msk                      (0x1U << PORT_PUDR_P3_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P4_Pos                      (4)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P4_Msk                      (0x1U << PORT_PUDR_P4_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P5_Pos                      (5)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P5_Msk                      (0x1U << PORT_PUDR_P5_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P6_Pos                      (6)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P6_Msk                      (0x1U << PORT_PUDR_P6_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P7_Pos                      (7)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P7_Msk                      (0x1U << PORT_PUDR_P7_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P8_Pos                      (8)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P8_Msk                      (0x1U << PORT_PUDR_P8_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P9_Pos                      (9)                                            /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P9_Msk                      (0x1U << PORT_PUDR_P9_Pos)                     /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P10_Pos                     (10)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P10_Msk                     (0x1U << PORT_PUDR_P10_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P11_Pos                     (11)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P11_Msk                     (0x1U << PORT_PUDR_P11_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P12_Pos                     (12)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P12_Msk                     (0x1U << PORT_PUDR_P12_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P13_Pos                     (13)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P13_Msk                     (0x1U << PORT_PUDR_P13_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P14_Pos                     (14)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P14_Msk                     (0x1U << PORT_PUDR_P14_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P15_Pos                     (15)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P15_Msk                     (0x1U << PORT_PUDR_P15_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P16_Pos                     (16)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P16_Msk                     (0x1U << PORT_PUDR_P16_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P17_Pos                     (17)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P17_Msk                     (0x1U << PORT_PUDR_P17_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P18_Pos                     (18)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P18_Msk                     (0x1U << PORT_PUDR_P18_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P19_Pos                     (19)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P19_Msk                     (0x1U << PORT_PUDR_P19_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P20_Pos                     (20)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P20_Msk                     (0x1U << PORT_PUDR_P20_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P21_Pos                     (21)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P21_Msk                     (0x1U << PORT_PUDR_P21_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P22_Pos                     (22)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P22_Msk                     (0x1U << PORT_PUDR_P22_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P23_Pos                     (23)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P23_Msk                     (0x1U << PORT_PUDR_P23_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P24_Pos                     (24)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P24_Msk                     (0x1U << PORT_PUDR_P24_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P25_Pos                     (25)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P25_Msk                     (0x1U << PORT_PUDR_P25_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P26_Pos                     (26)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P26_Msk                     (0x1U << PORT_PUDR_P26_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P27_Pos                     (27)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P27_Msk                     (0x1U << PORT_PUDR_P27_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P28_Pos                     (28)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P28_Msk                     (0x1U << PORT_PUDR_P28_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P29_Pos                     (29)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P29_Msk                     (0x1U << PORT_PUDR_P29_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P30_Pos                     (30)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P30_Msk                     (0x1U << PORT_PUDR_P30_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_P31_Pos                     (31)                                           /**< (PORT_PUDR) Pull-Up Disable Position */
#define PORT_PUDR_P31_Msk                     (0x1U << PORT_PUDR_P31_Pos)                    /**< (PORT_PUDR) Pull-Up Disable Mask */
#define PORT_PUDR_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_PUDR) Register Mask  */
#define PORT_PUDR_P_Pos                       (0)                                            /**< (PORT_PUDR Position) Pull-Up Disable */
#define PORT_PUDR_P_Msk                       (0xFFFFFFFFU << PORT_PUDR_P_Pos)               /**< (PORT_PUDR Mask) P */
#define PORT_PUDR_P(value)                    (PORT_PUDR_P_Msk & ((value) << PORT_PUDR_P_Pos))

/* -------- PORT_PUER : (PORT Offset: 0x64) (/W 32) Pull-up Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Pull-Up Enable                                */
    uint32_t P1:1;                      /**< bit:      1  Pull-Up Enable                                */
    uint32_t P2:1;                      /**< bit:      2  Pull-Up Enable                                */
    uint32_t P3:1;                      /**< bit:      3  Pull-Up Enable                                */
    uint32_t P4:1;                      /**< bit:      4  Pull-Up Enable                                */
    uint32_t P5:1;                      /**< bit:      5  Pull-Up Enable                                */
    uint32_t P6:1;                      /**< bit:      6  Pull-Up Enable                                */
    uint32_t P7:1;                      /**< bit:      7  Pull-Up Enable                                */
    uint32_t P8:1;                      /**< bit:      8  Pull-Up Enable                                */
    uint32_t P9:1;                      /**< bit:      9  Pull-Up Enable                                */
    uint32_t P10:1;                     /**< bit:     10  Pull-Up Enable                                */
    uint32_t P11:1;                     /**< bit:     11  Pull-Up Enable                                */
    uint32_t P12:1;                     /**< bit:     12  Pull-Up Enable                                */
    uint32_t P13:1;                     /**< bit:     13  Pull-Up Enable                                */
    uint32_t P14:1;                     /**< bit:     14  Pull-Up Enable                                */
    uint32_t P15:1;                     /**< bit:     15  Pull-Up Enable                                */
    uint32_t P16:1;                     /**< bit:     16  Pull-Up Enable                                */
    uint32_t P17:1;                     /**< bit:     17  Pull-Up Enable                                */
    uint32_t P18:1;                     /**< bit:     18  Pull-Up Enable                                */
    uint32_t P19:1;                     /**< bit:     19  Pull-Up Enable                                */
    uint32_t P20:1;                     /**< bit:     20  Pull-Up Enable                                */
    uint32_t P21:1;                     /**< bit:     21  Pull-Up Enable                                */
    uint32_t P22:1;                     /**< bit:     22  Pull-Up Enable                                */
    uint32_t P23:1;                     /**< bit:     23  Pull-Up Enable                                */
    uint32_t P24:1;                     /**< bit:     24  Pull-Up Enable                                */
    uint32_t P25:1;                     /**< bit:     25  Pull-Up Enable                                */
    uint32_t P26:1;                     /**< bit:     26  Pull-Up Enable                                */
    uint32_t P27:1;                     /**< bit:     27  Pull-Up Enable                                */
    uint32_t P28:1;                     /**< bit:     28  Pull-Up Enable                                */
    uint32_t P29:1;                     /**< bit:     29  Pull-Up Enable                                */
    uint32_t P30:1;                     /**< bit:     30  Pull-Up Enable                                */
    uint32_t P31:1;                     /**< bit:     31  Pull-Up Enable                                */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Pull-Up Enable                                */
  };
  uint32_t w;
} __PORT_PUER_bits_t;

