zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_PUER_P0_Pos                      (0)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P0_Msk                      (0x1U << PORT_PUER_P0_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P1_Pos                      (1)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P1_Msk                      (0x1U << PORT_PUER_P1_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P2_Pos                      (2)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P2_Msk                      (0x1U << PORT_PUER_P2_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P3_Pos                      (3)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P3_Msk                      (0x1U << PORT_PUER_P3_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P4_Pos                      (4)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P4_Msk                      (0x1U << PORT_PUER_P4_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P5_Pos                      (5)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P5_Msk                      (0x1U << PORT_PUER_P5_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P6_Pos                      (6)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P6_Msk                      (0x1U << PORT_PUER_P6_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P7_Pos                      (7)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P7_Msk                      (0x1U << PORT_PUER_P7_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P8_Pos                      (8)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P8_Msk                      (0x1U << PORT_PUER_P8_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P9_Pos                      (9)                                            /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P9_Msk                      (0x1U << PORT_PUER_P9_Pos)                     /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P10_Pos                     (10)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P10_Msk                     (0x1U << PORT_PUER_P10_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P11_Pos                     (11)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P11_Msk                     (0x1U << PORT_PUER_P11_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P12_Pos                     (12)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P12_Msk                     (0x1U << PORT_PUER_P12_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P13_Pos                     (13)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P13_Msk                     (0x1U << PORT_PUER_P13_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P14_Pos                     (14)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P14_Msk                     (0x1U << PORT_PUER_P14_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P15_Pos                     (15)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P15_Msk                     (0x1U << PORT_PUER_P15_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P16_Pos                     (16)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P16_Msk                     (0x1U << PORT_PUER_P16_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P17_Pos                     (17)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P17_Msk                     (0x1U << PORT_PUER_P17_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P18_Pos                     (18)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P18_Msk                     (0x1U << PORT_PUER_P18_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P19_Pos                     (19)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P19_Msk                     (0x1U << PORT_PUER_P19_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P20_Pos                     (20)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P20_Msk                     (0x1U << PORT_PUER_P20_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P21_Pos                     (21)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P21_Msk                     (0x1U << PORT_PUER_P21_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P22_Pos                     (22)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P22_Msk                     (0x1U << PORT_PUER_P22_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P23_Pos                     (23)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P23_Msk                     (0x1U << PORT_PUER_P23_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P24_Pos                     (24)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P24_Msk                     (0x1U << PORT_PUER_P24_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P25_Pos                     (25)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P25_Msk                     (0x1U << PORT_PUER_P25_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P26_Pos                     (26)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P26_Msk                     (0x1U << PORT_PUER_P26_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P27_Pos                     (27)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P27_Msk                     (0x1U << PORT_PUER_P27_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P28_Pos                     (28)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P28_Msk                     (0x1U << PORT_PUER_P28_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P29_Pos                     (29)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P29_Msk                     (0x1U << PORT_PUER_P29_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P30_Pos                     (30)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P30_Msk                     (0x1U << PORT_PUER_P30_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_P31_Pos                     (31)                                           /**< (PORT_PUER) Pull-Up Enable Position */
#define PORT_PUER_P31_Msk                     (0x1U << PORT_PUER_P31_Pos)                    /**< (PORT_PUER) Pull-Up Enable Mask */
#define PORT_PUER_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_PUER) Register Mask  */
#define PORT_PUER_P_Pos                       (0)                                            /**< (PORT_PUER Position) Pull-Up Enable */
#define PORT_PUER_P_Msk                       (0xFFFFFFFFU << PORT_PUER_P_Pos)               /**< (PORT_PUER Mask) P */
#define PORT_PUER_P(value)                    (PORT_PUER_P_Msk & ((value) << PORT_PUER_P_Pos))

/* -------- PORT_PUSR : (PORT Offset: 0x68) (R/ 32) Pad Pull-up Status Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Pull-Up Status                                */
    uint32_t P1:1;                      /**< bit:      1  Pull-Up Status                                */
    uint32_t P2:1;                      /**< bit:      2  Pull-Up Status                                */
    uint32_t P3:1;                      /**< bit:      3  Pull-Up Status                                */
    uint32_t P4:1;                      /**< bit:      4  Pull-Up Status                                */
    uint32_t P5:1;                      /**< bit:      5  Pull-Up Status                                */
    uint32_t P6:1;                      /**< bit:      6  Pull-Up Status                                */
    uint32_t P7:1;                      /**< bit:      7  Pull-Up Status                                */
    uint32_t P8:1;                      /**< bit:      8  Pull-Up Status                                */
    uint32_t P9:1;                      /**< bit:      9  Pull-Up Status                                */
    uint32_t P10:1;                     /**< bit:     10  Pull-Up Status                                */
    uint32_t P11:1;                     /**< bit:     11  Pull-Up Status                                */
    uint32_t P12:1;                     /**< bit:     12  Pull-Up Status                                */
    uint32_t P13:1;                     /**< bit:     13  Pull-Up Status                                */
    uint32_t P14:1;                     /**< bit:     14  Pull-Up Status                                */
    uint32_t P15:1;                     /**< bit:     15  Pull-Up Status                                */
    uint32_t P16:1;                     /**< bit:     16  Pull-Up Status                                */
    uint32_t P17:1;                     /**< bit:     17  Pull-Up Status                                */
    uint32_t P18:1;                     /**< bit:     18  Pull-Up Status                                */
    uint32_t P19:1;                     /**< bit:     19  Pull-Up Status                                */
    uint32_t P20:1;                     /**< bit:     20  Pull-Up Status                                */
    uint32_t P21:1;                     /**< bit:     21  Pull-Up Status                                */
    uint32_t P22:1;                     /**< bit:     22  Pull-Up Status                                */
    uint32_t P23:1;                     /**< bit:     23  Pull-Up Status                                */
    uint32_t P24:1;                     /**< bit:     24  Pull-Up Status                                */
    uint32_t P25:1;                     /**< bit:     25  Pull-Up Status                                */
    uint32_t P26:1;                     /**< bit:     26  Pull-Up Status                                */
    uint32_t P27:1;                     /**< bit:     27  Pull-Up Status                                */
    uint32_t P28:1;                     /**< bit:     28  Pull-Up Status                                */
    uint32_t P29:1;                     /**< bit:     29  Pull-Up Status                                */
    uint32_t P30:1;                     /**< bit:     30  Pull-Up Status                                */
    uint32_t P31:1;                     /**< bit:     31  Pull-Up Status                                */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Pull-Up Status                                */
  };
  uint32_t w;
} __PORT_PUSR_bits_t;

#define PORT_PUSR_P0_Pos                      (0)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P0_Msk                      (0x1U << PORT_PUSR_P0_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P1_Pos                      (1)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P1_Msk                      (0x1U << PORT_PUSR_P1_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P2_Pos                      (2)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P2_Msk                      (0x1U << PORT_PUSR_P2_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P3_Pos                      (3)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P3_Msk                      (0x1U << PORT_PUSR_P3_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P4_Pos                      (4)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P4_Msk                      (0x1U << PORT_PUSR_P4_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P5_Pos                      (5)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P5_Msk                      (0x1U << PORT_PUSR_P5_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P6_Pos                      (6)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P6_Msk                      (0x1U << PORT_PUSR_P6_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P7_Pos                      (7)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P7_Msk                      (0x1U << PORT_PUSR_P7_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P8_Pos                      (8)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P8_Msk                      (0x1U << PORT_PUSR_P8_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P9_Pos                      (9)                                            /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P9_Msk                      (0x1U << PORT_PUSR_P9_Pos)                     /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P10_Pos                     (10)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P10_Msk                     (0x1U << PORT_PUSR_P10_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P11_Pos                     (11)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P11_Msk                     (0x1U << PORT_PUSR_P11_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P12_Pos                     (12)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P12_Msk                     (0x1U << PORT_PUSR_P12_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P13_Pos                     (13)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P13_Msk                     (0x1U << PORT_PUSR_P13_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P14_Pos                     (14)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P14_Msk                     (0x1U << PORT_PUSR_P14_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P15_Pos                     (15)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P15_Msk                     (0x1U << PORT_PUSR_P15_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P16_Pos                     (16)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P16_Msk                     (0x1U << PORT_PUSR_P16_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P17_Pos                     (17)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P17_Msk                     (0x1U << PORT_PUSR_P17_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P18_Pos                     (18)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P18_Msk                     (0x1U << PORT_PUSR_P18_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P19_Pos                     (19)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P19_Msk                     (0x1U << PORT_PUSR_P19_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P20_Pos                     (20)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P20_Msk                     (0x1U << PORT_PUSR_P20_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P21_Pos                     (21)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P21_Msk                     (0x1U << PORT_PUSR_P21_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P22_Pos                     (22)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P22_Msk                     (0x1U << PORT_PUSR_P22_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P23_Pos                     (23)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P23_Msk                     (0x1U << PORT_PUSR_P23_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P24_Pos                     (24)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P24_Msk                     (0x1U << PORT_PUSR_P24_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P25_Pos                     (25)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P25_Msk                     (0x1U << PORT_PUSR_P25_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P26_Pos                     (26)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P26_Msk                     (0x1U << PORT_PUSR_P26_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P27_Pos                     (27)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P27_Msk                     (0x1U << PORT_PUSR_P27_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P28_Pos                     (28)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P28_Msk                     (0x1U << PORT_PUSR_P28_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P29_Pos                     (29)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P29_Msk                     (0x1U << PORT_PUSR_P29_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P30_Pos                     (30)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P30_Msk                     (0x1U << PORT_PUSR_P30_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_P31_Pos                     (31)                                           /**< (PORT_PUSR) Pull-Up Status Position */
#define PORT_PUSR_P31_Msk                     (0x1U << PORT_PUSR_P31_Pos)                    /**< (PORT_PUSR) Pull-Up Status Mask */
#define PORT_PUSR_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_PUSR) Register Mask  */
#define PORT_PUSR_P_Pos                       (0)                                            /**< (PORT_PUSR Position) Pull-Up Status */
#define PORT_PUSR_P_Msk                       (0xFFFFFFFFU << PORT_PUSR_P_Pos)               /**< (PORT_PUSR Mask) P */
#define PORT_PUSR_P(value)                    (PORT_PUSR_P_Msk & ((value) << PORT_PUSR_P_Pos))

