zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/* -------- PORT_ABCDSR : (PORT Offset: 0x70) (R/W 32) Peripheral ABCD Select Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Peripheral Select                             */
    uint32_t P1:1;                      /**< bit:      1  Peripheral Select                             */
    uint32_t P2:1;                      /**< bit:      2  Peripheral Select                             */
    uint32_t P3:1;                      /**< bit:      3  Peripheral Select                             */
    uint32_t P4:1;                      /**< bit:      4  Peripheral Select                             */
    uint32_t P5:1;                      /**< bit:      5  Peripheral Select                             */
    uint32_t P6:1;                      /**< bit:      6  Peripheral Select                             */
    uint32_t P7:1;                      /**< bit:      7  Peripheral Select                             */
    uint32_t P8:1;                      /**< bit:      8  Peripheral Select                             */
    uint32_t P9:1;                      /**< bit:      9  Peripheral Select                             */
    uint32_t P10:1;                     /**< bit:     10  Peripheral Select                             */
    uint32_t P11:1;                     /**< bit:     11  Peripheral Select                             */
    uint32_t P12:1;                     /**< bit:     12  Peripheral Select                             */
    uint32_t P13:1;                     /**< bit:     13  Peripheral Select                             */
    uint32_t P14:1;                     /**< bit:     14  Peripheral Select                             */
    uint32_t P15:1;                     /**< bit:     15  Peripheral Select                             */
    uint32_t P16:1;                     /**< bit:     16  Peripheral Select                             */
    uint32_t P17:1;                     /**< bit:     17  Peripheral Select                             */
    uint32_t P18:1;                     /**< bit:     18  Peripheral Select                             */
    uint32_t P19:1;                     /**< bit:     19  Peripheral Select                             */
    uint32_t P20:1;                     /**< bit:     20  Peripheral Select                             */
    uint32_t P21:1;                     /**< bit:     21  Peripheral Select                             */
    uint32_t P22:1;                     /**< bit:     22  Peripheral Select                             */
    uint32_t P23:1;                     /**< bit:     23  Peripheral Select                             */
    uint32_t P24:1;                     /**< bit:     24  Peripheral Select                             */
    uint32_t P25:1;                     /**< bit:     25  Peripheral Select                             */
    uint32_t P26:1;                     /**< bit:     26  Peripheral Select                             */
    uint32_t P27:1;                     /**< bit:     27  Peripheral Select                             */
    uint32_t P28:1;                     /**< bit:     28  Peripheral Select                             */
    uint32_t P29:1;                     /**< bit:     29  Peripheral Select                             */
    uint32_t P30:1;                     /**< bit:     30  Peripheral Select                             */
    uint32_t P31:1;                     /**< bit:     31  Peripheral Select                             */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Peripheral Select                             */
  };
  uint32_t w;
} __PORT_ABCDSR_bits_t;

#define PORT_ABCDSR_P0_Pos                    (0)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P0_Msk                    (0x1U << PORT_ABCDSR_P0_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P1_Pos                    (1)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P1_Msk                    (0x1U << PORT_ABCDSR_P1_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P2_Pos                    (2)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P2_Msk                    (0x1U << PORT_ABCDSR_P2_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P3_Pos                    (3)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P3_Msk                    (0x1U << PORT_ABCDSR_P3_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P4_Pos                    (4)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P4_Msk                    (0x1U << PORT_ABCDSR_P4_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P5_Pos                    (5)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P5_Msk                    (0x1U << PORT_ABCDSR_P5_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P6_Pos                    (6)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P6_Msk                    (0x1U << PORT_ABCDSR_P6_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P7_Pos                    (7)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P7_Msk                    (0x1U << PORT_ABCDSR_P7_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P8_Pos                    (8)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P8_Msk                    (0x1U << PORT_ABCDSR_P8_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P9_Pos                    (9)                                            /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P9_Msk                    (0x1U << PORT_ABCDSR_P9_Pos)                   /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P10_Pos                   (10)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P10_Msk                   (0x1U << PORT_ABCDSR_P10_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P11_Pos                   (11)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P11_Msk                   (0x1U << PORT_ABCDSR_P11_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P12_Pos                   (12)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P12_Msk                   (0x1U << PORT_ABCDSR_P12_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P13_Pos                   (13)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P13_Msk                   (0x1U << PORT_ABCDSR_P13_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P14_Pos                   (14)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P14_Msk                   (0x1U << PORT_ABCDSR_P14_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P15_Pos                   (15)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P15_Msk                   (0x1U << PORT_ABCDSR_P15_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P16_Pos                   (16)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P16_Msk                   (0x1U << PORT_ABCDSR_P16_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P17_Pos                   (17)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P17_Msk                   (0x1U << PORT_ABCDSR_P17_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P18_Pos                   (18)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P18_Msk                   (0x1U << PORT_ABCDSR_P18_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P19_Pos                   (19)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P19_Msk                   (0x1U << PORT_ABCDSR_P19_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P20_Pos                   (20)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P20_Msk                   (0x1U << PORT_ABCDSR_P20_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P21_Pos                   (21)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P21_Msk                   (0x1U << PORT_ABCDSR_P21_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P22_Pos                   (22)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P22_Msk                   (0x1U << PORT_ABCDSR_P22_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P23_Pos                   (23)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P23_Msk                   (0x1U << PORT_ABCDSR_P23_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P24_Pos                   (24)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P24_Msk                   (0x1U << PORT_ABCDSR_P24_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P25_Pos                   (25)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P25_Msk                   (0x1U << PORT_ABCDSR_P25_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P26_Pos                   (26)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P26_Msk                   (0x1U << PORT_ABCDSR_P26_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P27_Pos                   (27)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P27_Msk                   (0x1U << PORT_ABCDSR_P27_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P28_Pos                   (28)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P28_Msk                   (0x1U << PORT_ABCDSR_P28_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P29_Pos                   (29)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P29_Msk                   (0x1U << PORT_ABCDSR_P29_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P30_Pos                   (30)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P30_Msk                   (0x1U << PORT_ABCDSR_P30_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_P31_Pos                   (31)                                           /**< (PORT_ABCDSR) Peripheral Select Position */
#define PORT_ABCDSR_P31_Msk                   (0x1U << PORT_ABCDSR_P31_Pos)                  /**< (PORT_ABCDSR) Peripheral Select Mask */
#define PORT_ABCDSR_Msk                       (0xFFFFFFFFUL)                                 /**< (PORT_ABCDSR) Register Mask  */
#define PORT_ABCDSR_P_Pos                     (0)                                            /**< (PORT_ABCDSR Position) Peripheral Select */
#define PORT_ABCDSR_P_Msk                     (0xFFFFFFFFU << PORT_ABCDSR_P_Pos)             /**< (PORT_ABCDSR Mask) P */
#define PORT_ABCDSR_P(value)                  (PORT_ABCDSR_P_Msk & ((value) << PORT_ABCDSR_P_Pos))

