zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/* -------- PORT_IFSCSR : (PORT Offset: 0x88) (R/ 32) Input Filter Slow Clock Status Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Glitch or Debouncing Filter Selection Status  */
    uint32_t P1:1;                      /**< bit:      1  Glitch or Debouncing Filter Selection Status  */
    uint32_t P2:1;                      /**< bit:      2  Glitch or Debouncing Filter Selection Status  */
    uint32_t P3:1;                      /**< bit:      3  Glitch or Debouncing Filter Selection Status  */
    uint32_t P4:1;                      /**< bit:      4  Glitch or Debouncing Filter Selection Status  */
    uint32_t P5:1;                      /**< bit:      5  Glitch or Debouncing Filter Selection Status  */
    uint32_t P6:1;                      /**< bit:      6  Glitch or Debouncing Filter Selection Status  */
    uint32_t P7:1;                      /**< bit:      7  Glitch or Debouncing Filter Selection Status  */
    uint32_t P8:1;                      /**< bit:      8  Glitch or Debouncing Filter Selection Status  */
    uint32_t P9:1;                      /**< bit:      9  Glitch or Debouncing Filter Selection Status  */
    uint32_t P10:1;                     /**< bit:     10  Glitch or Debouncing Filter Selection Status  */
    uint32_t P11:1;                     /**< bit:     11  Glitch or Debouncing Filter Selection Status  */
    uint32_t P12:1;                     /**< bit:     12  Glitch or Debouncing Filter Selection Status  */
    uint32_t P13:1;                     /**< bit:     13  Glitch or Debouncing Filter Selection Status  */
    uint32_t P14:1;                     /**< bit:     14  Glitch or Debouncing Filter Selection Status  */
    uint32_t P15:1;                     /**< bit:     15  Glitch or Debouncing Filter Selection Status  */
    uint32_t P16:1;                     /**< bit:     16  Glitch or Debouncing Filter Selection Status  */
    uint32_t P17:1;                     /**< bit:     17  Glitch or Debouncing Filter Selection Status  */
    uint32_t P18:1;                     /**< bit:     18  Glitch or Debouncing Filter Selection Status  */
    uint32_t P19:1;                     /**< bit:     19  Glitch or Debouncing Filter Selection Status  */
    uint32_t P20:1;                     /**< bit:     20  Glitch or Debouncing Filter Selection Status  */
    uint32_t P21:1;                     /**< bit:     21  Glitch or Debouncing Filter Selection Status  */
    uint32_t P22:1;                     /**< bit:     22  Glitch or Debouncing Filter Selection Status  */
    uint32_t P23:1;                     /**< bit:     23  Glitch or Debouncing Filter Selection Status  */
    uint32_t P24:1;                     /**< bit:     24  Glitch or Debouncing Filter Selection Status  */
    uint32_t P25:1;                     /**< bit:     25  Glitch or Debouncing Filter Selection Status  */
    uint32_t P26:1;                     /**< bit:     26  Glitch or Debouncing Filter Selection Status  */
    uint32_t P27:1;                     /**< bit:     27  Glitch or Debouncing Filter Selection Status  */
    uint32_t P28:1;                     /**< bit:     28  Glitch or Debouncing Filter Selection Status  */
    uint32_t P29:1;                     /**< bit:     29  Glitch or Debouncing Filter Selection Status  */
    uint32_t P30:1;                     /**< bit:     30  Glitch or Debouncing Filter Selection Status  */
    uint32_t P31:1;                     /**< bit:     31  Glitch or Debouncing Filter Selection Status  */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Glitch or Debouncing Filter Selection Status  */
  };
  uint32_t w;
} __PORT_IFSCSR_bits_t;

#define PORT_IFSCSR_P0_Pos                    (0)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P0_Msk                    (0x1U << PORT_IFSCSR_P0_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P1_Pos                    (1)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P1_Msk                    (0x1U << PORT_IFSCSR_P1_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P2_Pos                    (2)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P2_Msk                    (0x1U << PORT_IFSCSR_P2_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P3_Pos                    (3)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P3_Msk                    (0x1U << PORT_IFSCSR_P3_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P4_Pos                    (4)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P4_Msk                    (0x1U << PORT_IFSCSR_P4_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P5_Pos                    (5)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P5_Msk                    (0x1U << PORT_IFSCSR_P5_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P6_Pos                    (6)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P6_Msk                    (0x1U << PORT_IFSCSR_P6_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P7_Pos                    (7)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P7_Msk                    (0x1U << PORT_IFSCSR_P7_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P8_Pos                    (8)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P8_Msk                    (0x1U << PORT_IFSCSR_P8_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P9_Pos                    (9)                                            /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P9_Msk                    (0x1U << PORT_IFSCSR_P9_Pos)                   /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P10_Pos                   (10)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P10_Msk                   (0x1U << PORT_IFSCSR_P10_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P11_Pos                   (11)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P11_Msk                   (0x1U << PORT_IFSCSR_P11_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P12_Pos                   (12)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P12_Msk                   (0x1U << PORT_IFSCSR_P12_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P13_Pos                   (13)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P13_Msk                   (0x1U << PORT_IFSCSR_P13_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P14_Pos                   (14)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P14_Msk                   (0x1U << PORT_IFSCSR_P14_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P15_Pos                   (15)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P15_Msk                   (0x1U << PORT_IFSCSR_P15_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P16_Pos                   (16)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P16_Msk                   (0x1U << PORT_IFSCSR_P16_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P17_Pos                   (17)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P17_Msk                   (0x1U << PORT_IFSCSR_P17_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P18_Pos                   (18)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P18_Msk                   (0x1U << PORT_IFSCSR_P18_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P19_Pos                   (19)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P19_Msk                   (0x1U << PORT_IFSCSR_P19_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P20_Pos                   (20)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P20_Msk                   (0x1U << PORT_IFSCSR_P20_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P21_Pos                   (21)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P21_Msk                   (0x1U << PORT_IFSCSR_P21_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P22_Pos                   (22)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P22_Msk                   (0x1U << PORT_IFSCSR_P22_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P23_Pos                   (23)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P23_Msk                   (0x1U << PORT_IFSCSR_P23_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P24_Pos                   (24)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P24_Msk                   (0x1U << PORT_IFSCSR_P24_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P25_Pos                   (25)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P25_Msk                   (0x1U << PORT_IFSCSR_P25_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P26_Pos                   (26)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P26_Msk                   (0x1U << PORT_IFSCSR_P26_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P27_Pos                   (27)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P27_Msk                   (0x1U << PORT_IFSCSR_P27_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P28_Pos                   (28)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P28_Msk                   (0x1U << PORT_IFSCSR_P28_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P29_Pos                   (29)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P29_Msk                   (0x1U << PORT_IFSCSR_P29_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P30_Pos                   (30)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P30_Msk                   (0x1U << PORT_IFSCSR_P30_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_P31_Pos                   (31)                                           /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Position */
#define PORT_IFSCSR_P31_Msk                   (0x1U << PORT_IFSCSR_P31_Pos)                  /**< (PORT_IFSCSR) Glitch or Debouncing Filter Selection Status Mask */
#define PORT_IFSCSR_Msk                       (0xFFFFFFFFUL)                                 /**< (PORT_IFSCSR) Register Mask  */
#define PORT_IFSCSR_P_Pos                     (0)                                            /**< (PORT_IFSCSR Position) Glitch or Debouncing Filter Selection Status */
#define PORT_IFSCSR_P_Msk                     (0xFFFFFFFFU << PORT_IFSCSR_P_Pos)             /**< (PORT_IFSCSR Mask) P */
#define PORT_IFSCSR_P(value)                  (PORT_IFSCSR_P_Msk & ((value) << PORT_IFSCSR_P_Pos))

/* -------- PORT_SCDR : (PORT Offset: 0x8c) (R/W 32) Slow Clock Divider Debouncing Register -------- */

typedef union
{
  struct
  {
    uint32_t DIV:14;                    /**< bit:  0..13  Slow Clock Divider Selection for Debouncing   */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __PORT_SCDR_bits_t;

#define PORT_SCDR_DIV_Pos                     (0)                                            /**< (PORT_SCDR) Slow Clock Divider Selection for Debouncing Position */
#define PORT_SCDR_DIV_Msk                     (0x3FFFU << PORT_SCDR_DIV_Pos)                 /**< (PORT_SCDR) Slow Clock Divider Selection for Debouncing Mask */
#define PORT_SCDR_DIV(value)                  (PORT_SCDR_DIV_Msk & ((value) << PORT_SCDR_DIV_Pos))
#define PORT_SCDR_Msk                         (0x00003FFFUL)                                 /**< (PORT_SCDR) Register Mask  */

/* -------- PORT_PPDDR : (PORT Offset: 0x90) (/W 32) Pad Pull-down Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Pull-Down Disable                             */
    uint32_t P1:1;                      /**< bit:      1  Pull-Down Disable                             */
    uint32_t P2:1;                      /**< bit:      2  Pull-Down Disable                             */
    uint32_t P3:1;                      /**< bit:      3  Pull-Down Disable                             */
    uint32_t P4:1;                      /**< bit:      4  Pull-Down Disable                             */
    uint32_t P5:1;                      /**< bit:      5  Pull-Down Disable                             */
    uint32_t P6:1;                      /**< bit:      6  Pull-Down Disable                             */
    uint32_t P7:1;                      /**< bit:      7  Pull-Down Disable                             */
    uint32_t P8:1;                      /**< bit:      8  Pull-Down Disable                             */
    uint32_t P9:1;                      /**< bit:      9  Pull-Down Disable                             */
    uint32_t P10:1;                     /**< bit:     10  Pull-Down Disable                             */
    uint32_t P11:1;                     /**< bit:     11  Pull-Down Disable                             */
    uint32_t P12:1;                     /**< bit:     12  Pull-Down Disable                             */
    uint32_t P13:1;                     /**< bit:     13  Pull-Down Disable                             */
    uint32_t P14:1;                     /**< bit:     14  Pull-Down Disable                             */
    uint32_t P15:1;                     /**< bit:     15  Pull-Down Disable                             */
    uint32_t P16:1;                     /**< bit:     16  Pull-Down Disable                             */
    uint32_t P17:1;                     /**< bit:     17  Pull-Down Disable                             */
    uint32_t P18:1;                     /**< bit:     18  Pull-Down Disable                             */
    uint32_t P19:1;                     /**< bit:     19  Pull-Down Disable                             */
    uint32_t P20:1;                     /**< bit:     20  Pull-Down Disable                             */
    uint32_t P21:1;                     /**< bit:     21  Pull-Down Disable                             */
    uint32_t P22:1;                     /**< bit:     22  Pull-Down Disable                             */
    uint32_t P23:1;                     /**< bit:     23  Pull-Down Disable                             */
    uint32_t P24:1;                     /**< bit:     24  Pull-Down Disable                             */
    uint32_t P25:1;                     /**< bit:     25  Pull-Down Disable                             */
    uint32_t P26:1;                     /**< bit:     26  Pull-Down Disable                             */
    uint32_t P27:1;                     /**< bit:     27  Pull-Down Disable                             */
    uint32_t P28:1;                     /**< bit:     28  Pull-Down Disable                             */
    uint32_t P29:1;                     /**< bit:     29  Pull-Down Disable                             */
    uint32_t P30:1;                     /**< bit:     30  Pull-Down Disable                             */
    uint32_t P31:1;                     /**< bit:     31  Pull-Down Disable                             */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Pull-Down Disable                             */
  };
  uint32_t w;
} __PORT_PPDDR_bits_t;

