zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_PPDDR_P0_Pos                     (0)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P0_Msk                     (0x1U << PORT_PPDDR_P0_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P1_Pos                     (1)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P1_Msk                     (0x1U << PORT_PPDDR_P1_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P2_Pos                     (2)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P2_Msk                     (0x1U << PORT_PPDDR_P2_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P3_Pos                     (3)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P3_Msk                     (0x1U << PORT_PPDDR_P3_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P4_Pos                     (4)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P4_Msk                     (0x1U << PORT_PPDDR_P4_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P5_Pos                     (5)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P5_Msk                     (0x1U << PORT_PPDDR_P5_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P6_Pos                     (6)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P6_Msk                     (0x1U << PORT_PPDDR_P6_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P7_Pos                     (7)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P7_Msk                     (0x1U << PORT_PPDDR_P7_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P8_Pos                     (8)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P8_Msk                     (0x1U << PORT_PPDDR_P8_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P9_Pos                     (9)                                            /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P9_Msk                     (0x1U << PORT_PPDDR_P9_Pos)                    /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P10_Pos                    (10)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P10_Msk                    (0x1U << PORT_PPDDR_P10_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P11_Pos                    (11)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P11_Msk                    (0x1U << PORT_PPDDR_P11_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P12_Pos                    (12)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P12_Msk                    (0x1U << PORT_PPDDR_P12_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P13_Pos                    (13)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P13_Msk                    (0x1U << PORT_PPDDR_P13_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P14_Pos                    (14)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P14_Msk                    (0x1U << PORT_PPDDR_P14_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P15_Pos                    (15)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P15_Msk                    (0x1U << PORT_PPDDR_P15_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P16_Pos                    (16)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P16_Msk                    (0x1U << PORT_PPDDR_P16_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P17_Pos                    (17)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P17_Msk                    (0x1U << PORT_PPDDR_P17_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P18_Pos                    (18)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P18_Msk                    (0x1U << PORT_PPDDR_P18_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P19_Pos                    (19)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P19_Msk                    (0x1U << PORT_PPDDR_P19_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P20_Pos                    (20)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P20_Msk                    (0x1U << PORT_PPDDR_P20_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P21_Pos                    (21)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P21_Msk                    (0x1U << PORT_PPDDR_P21_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P22_Pos                    (22)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P22_Msk                    (0x1U << PORT_PPDDR_P22_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P23_Pos                    (23)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P23_Msk                    (0x1U << PORT_PPDDR_P23_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P24_Pos                    (24)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P24_Msk                    (0x1U << PORT_PPDDR_P24_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P25_Pos                    (25)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P25_Msk                    (0x1U << PORT_PPDDR_P25_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P26_Pos                    (26)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P26_Msk                    (0x1U << PORT_PPDDR_P26_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P27_Pos                    (27)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P27_Msk                    (0x1U << PORT_PPDDR_P27_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P28_Pos                    (28)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P28_Msk                    (0x1U << PORT_PPDDR_P28_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P29_Pos                    (29)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P29_Msk                    (0x1U << PORT_PPDDR_P29_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P30_Pos                    (30)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P30_Msk                    (0x1U << PORT_PPDDR_P30_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_P31_Pos                    (31)                                           /**< (PORT_PPDDR) Pull-Down Disable Position */
#define PORT_PPDDR_P31_Msk                    (0x1U << PORT_PPDDR_P31_Pos)                   /**< (PORT_PPDDR) Pull-Down Disable Mask */
#define PORT_PPDDR_Msk                        (0xFFFFFFFFUL)                                 /**< (PORT_PPDDR) Register Mask  */
#define PORT_PPDDR_P_Pos                      (0)                                            /**< (PORT_PPDDR Position) Pull-Down Disable */
#define PORT_PPDDR_P_Msk                      (0xFFFFFFFFU << PORT_PPDDR_P_Pos)              /**< (PORT_PPDDR Mask) P */
#define PORT_PPDDR_P(value)                   (PORT_PPDDR_P_Msk & ((value) << PORT_PPDDR_P_Pos))

/* -------- PORT_PPDER : (PORT Offset: 0x94) (/W 32) Pad Pull-down Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Pull-Down Enable                              */
    uint32_t P1:1;                      /**< bit:      1  Pull-Down Enable                              */
    uint32_t P2:1;                      /**< bit:      2  Pull-Down Enable                              */
    uint32_t P3:1;                      /**< bit:      3  Pull-Down Enable                              */
    uint32_t P4:1;                      /**< bit:      4  Pull-Down Enable                              */
    uint32_t P5:1;                      /**< bit:      5  Pull-Down Enable                              */
    uint32_t P6:1;                      /**< bit:      6  Pull-Down Enable                              */
    uint32_t P7:1;                      /**< bit:      7  Pull-Down Enable                              */
    uint32_t P8:1;                      /**< bit:      8  Pull-Down Enable                              */
    uint32_t P9:1;                      /**< bit:      9  Pull-Down Enable                              */
    uint32_t P10:1;                     /**< bit:     10  Pull-Down Enable                              */
    uint32_t P11:1;                     /**< bit:     11  Pull-Down Enable                              */
    uint32_t P12:1;                     /**< bit:     12  Pull-Down Enable                              */
    uint32_t P13:1;                     /**< bit:     13  Pull-Down Enable                              */
    uint32_t P14:1;                     /**< bit:     14  Pull-Down Enable                              */
    uint32_t P15:1;                     /**< bit:     15  Pull-Down Enable                              */
    uint32_t P16:1;                     /**< bit:     16  Pull-Down Enable                              */
    uint32_t P17:1;                     /**< bit:     17  Pull-Down Enable                              */
    uint32_t P18:1;                     /**< bit:     18  Pull-Down Enable                              */
    uint32_t P19:1;                     /**< bit:     19  Pull-Down Enable                              */
    uint32_t P20:1;                     /**< bit:     20  Pull-Down Enable                              */
    uint32_t P21:1;                     /**< bit:     21  Pull-Down Enable                              */
    uint32_t P22:1;                     /**< bit:     22  Pull-Down Enable                              */
    uint32_t P23:1;                     /**< bit:     23  Pull-Down Enable                              */
    uint32_t P24:1;                     /**< bit:     24  Pull-Down Enable                              */
    uint32_t P25:1;                     /**< bit:     25  Pull-Down Enable                              */
    uint32_t P26:1;                     /**< bit:     26  Pull-Down Enable                              */
    uint32_t P27:1;                     /**< bit:     27  Pull-Down Enable                              */
    uint32_t P28:1;                     /**< bit:     28  Pull-Down Enable                              */
    uint32_t P29:1;                     /**< bit:     29  Pull-Down Enable                              */
    uint32_t P30:1;                     /**< bit:     30  Pull-Down Enable                              */
    uint32_t P31:1;                     /**< bit:     31  Pull-Down Enable                              */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Pull-Down Enable                              */
  };
  uint32_t w;
} __PORT_PPDER_bits_t;

#define PORT_PPDER_P0_Pos                     (0)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P0_Msk                     (0x1U << PORT_PPDER_P0_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P1_Pos                     (1)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P1_Msk                     (0x1U << PORT_PPDER_P1_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P2_Pos                     (2)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P2_Msk                     (0x1U << PORT_PPDER_P2_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P3_Pos                     (3)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P3_Msk                     (0x1U << PORT_PPDER_P3_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P4_Pos                     (4)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P4_Msk                     (0x1U << PORT_PPDER_P4_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P5_Pos                     (5)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P5_Msk                     (0x1U << PORT_PPDER_P5_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P6_Pos                     (6)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P6_Msk                     (0x1U << PORT_PPDER_P6_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P7_Pos                     (7)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P7_Msk                     (0x1U << PORT_PPDER_P7_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P8_Pos                     (8)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P8_Msk                     (0x1U << PORT_PPDER_P8_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P9_Pos                     (9)                                            /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P9_Msk                     (0x1U << PORT_PPDER_P9_Pos)                    /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P10_Pos                    (10)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P10_Msk                    (0x1U << PORT_PPDER_P10_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P11_Pos                    (11)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P11_Msk                    (0x1U << PORT_PPDER_P11_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P12_Pos                    (12)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P12_Msk                    (0x1U << PORT_PPDER_P12_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P13_Pos                    (13)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P13_Msk                    (0x1U << PORT_PPDER_P13_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P14_Pos                    (14)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P14_Msk                    (0x1U << PORT_PPDER_P14_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P15_Pos                    (15)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P15_Msk                    (0x1U << PORT_PPDER_P15_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P16_Pos                    (16)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P16_Msk                    (0x1U << PORT_PPDER_P16_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P17_Pos                    (17)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P17_Msk                    (0x1U << PORT_PPDER_P17_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P18_Pos                    (18)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P18_Msk                    (0x1U << PORT_PPDER_P18_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P19_Pos                    (19)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P19_Msk                    (0x1U << PORT_PPDER_P19_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P20_Pos                    (20)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P20_Msk                    (0x1U << PORT_PPDER_P20_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P21_Pos                    (21)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P21_Msk                    (0x1U << PORT_PPDER_P21_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P22_Pos                    (22)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P22_Msk                    (0x1U << PORT_PPDER_P22_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P23_Pos                    (23)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P23_Msk                    (0x1U << PORT_PPDER_P23_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P24_Pos                    (24)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P24_Msk                    (0x1U << PORT_PPDER_P24_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P25_Pos                    (25)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P25_Msk                    (0x1U << PORT_PPDER_P25_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P26_Pos                    (26)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P26_Msk                    (0x1U << PORT_PPDER_P26_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P27_Pos                    (27)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P27_Msk                    (0x1U << PORT_PPDER_P27_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P28_Pos                    (28)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P28_Msk                    (0x1U << PORT_PPDER_P28_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P29_Pos                    (29)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P29_Msk                    (0x1U << PORT_PPDER_P29_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P30_Pos                    (30)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P30_Msk                    (0x1U << PORT_PPDER_P30_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_P31_Pos                    (31)                                           /**< (PORT_PPDER) Pull-Down Enable Position */
#define PORT_PPDER_P31_Msk                    (0x1U << PORT_PPDER_P31_Pos)                   /**< (PORT_PPDER) Pull-Down Enable Mask */
#define PORT_PPDER_Msk                        (0xFFFFFFFFUL)                                 /**< (PORT_PPDER) Register Mask  */
#define PORT_PPDER_P_Pos                      (0)                                            /**< (PORT_PPDER Position) Pull-Down Enable */
#define PORT_PPDER_P_Msk                      (0xFFFFFFFFU << PORT_PPDER_P_Pos)              /**< (PORT_PPDER Mask) P */
#define PORT_PPDER_P(value)                   (PORT_PPDER_P_Msk & ((value) << PORT_PPDER_P_Pos))

