zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_OWDR_P0_Pos                      (0)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P0_Msk                      (0x1U << PORT_OWDR_P0_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P1_Pos                      (1)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P1_Msk                      (0x1U << PORT_OWDR_P1_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P2_Pos                      (2)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P2_Msk                      (0x1U << PORT_OWDR_P2_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P3_Pos                      (3)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P3_Msk                      (0x1U << PORT_OWDR_P3_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P4_Pos                      (4)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P4_Msk                      (0x1U << PORT_OWDR_P4_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P5_Pos                      (5)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P5_Msk                      (0x1U << PORT_OWDR_P5_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P6_Pos                      (6)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P6_Msk                      (0x1U << PORT_OWDR_P6_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P7_Pos                      (7)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P7_Msk                      (0x1U << PORT_OWDR_P7_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P8_Pos                      (8)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P8_Msk                      (0x1U << PORT_OWDR_P8_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P9_Pos                      (9)                                            /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P9_Msk                      (0x1U << PORT_OWDR_P9_Pos)                     /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P10_Pos                     (10)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P10_Msk                     (0x1U << PORT_OWDR_P10_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P11_Pos                     (11)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P11_Msk                     (0x1U << PORT_OWDR_P11_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P12_Pos                     (12)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P12_Msk                     (0x1U << PORT_OWDR_P12_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P13_Pos                     (13)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P13_Msk                     (0x1U << PORT_OWDR_P13_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P14_Pos                     (14)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P14_Msk                     (0x1U << PORT_OWDR_P14_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P15_Pos                     (15)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P15_Msk                     (0x1U << PORT_OWDR_P15_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P16_Pos                     (16)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P16_Msk                     (0x1U << PORT_OWDR_P16_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P17_Pos                     (17)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P17_Msk                     (0x1U << PORT_OWDR_P17_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P18_Pos                     (18)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P18_Msk                     (0x1U << PORT_OWDR_P18_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P19_Pos                     (19)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P19_Msk                     (0x1U << PORT_OWDR_P19_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P20_Pos                     (20)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P20_Msk                     (0x1U << PORT_OWDR_P20_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P21_Pos                     (21)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P21_Msk                     (0x1U << PORT_OWDR_P21_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P22_Pos                     (22)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P22_Msk                     (0x1U << PORT_OWDR_P22_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P23_Pos                     (23)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P23_Msk                     (0x1U << PORT_OWDR_P23_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P24_Pos                     (24)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P24_Msk                     (0x1U << PORT_OWDR_P24_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P25_Pos                     (25)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P25_Msk                     (0x1U << PORT_OWDR_P25_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P26_Pos                     (26)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P26_Msk                     (0x1U << PORT_OWDR_P26_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P27_Pos                     (27)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P27_Msk                     (0x1U << PORT_OWDR_P27_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P28_Pos                     (28)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P28_Msk                     (0x1U << PORT_OWDR_P28_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P29_Pos                     (29)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P29_Msk                     (0x1U << PORT_OWDR_P29_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P30_Pos                     (30)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P30_Msk                     (0x1U << PORT_OWDR_P30_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_P31_Pos                     (31)                                           /**< (PORT_OWDR) Output Write Disable Position */
#define PORT_OWDR_P31_Msk                     (0x1U << PORT_OWDR_P31_Pos)                    /**< (PORT_OWDR) Output Write Disable Mask */
#define PORT_OWDR_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_OWDR) Register Mask  */
#define PORT_OWDR_P_Pos                       (0)                                            /**< (PORT_OWDR Position) Output Write Disable */
#define PORT_OWDR_P_Msk                       (0xFFFFFFFFU << PORT_OWDR_P_Pos)               /**< (PORT_OWDR Mask) P */
#define PORT_OWDR_P(value)                    (PORT_OWDR_P_Msk & ((value) << PORT_OWDR_P_Pos))

/* -------- PORT_OWSR : (PORT Offset: 0xa8) (R/ 32) Output Write Status Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Output Write Status                           */
    uint32_t P1:1;                      /**< bit:      1  Output Write Status                           */
    uint32_t P2:1;                      /**< bit:      2  Output Write Status                           */
    uint32_t P3:1;                      /**< bit:      3  Output Write Status                           */
    uint32_t P4:1;                      /**< bit:      4  Output Write Status                           */
    uint32_t P5:1;                      /**< bit:      5  Output Write Status                           */
    uint32_t P6:1;                      /**< bit:      6  Output Write Status                           */
    uint32_t P7:1;                      /**< bit:      7  Output Write Status                           */
    uint32_t P8:1;                      /**< bit:      8  Output Write Status                           */
    uint32_t P9:1;                      /**< bit:      9  Output Write Status                           */
    uint32_t P10:1;                     /**< bit:     10  Output Write Status                           */
    uint32_t P11:1;                     /**< bit:     11  Output Write Status                           */
    uint32_t P12:1;                     /**< bit:     12  Output Write Status                           */
    uint32_t P13:1;                     /**< bit:     13  Output Write Status                           */
    uint32_t P14:1;                     /**< bit:     14  Output Write Status                           */
    uint32_t P15:1;                     /**< bit:     15  Output Write Status                           */
    uint32_t P16:1;                     /**< bit:     16  Output Write Status                           */
    uint32_t P17:1;                     /**< bit:     17  Output Write Status                           */
    uint32_t P18:1;                     /**< bit:     18  Output Write Status                           */
    uint32_t P19:1;                     /**< bit:     19  Output Write Status                           */
    uint32_t P20:1;                     /**< bit:     20  Output Write Status                           */
    uint32_t P21:1;                     /**< bit:     21  Output Write Status                           */
    uint32_t P22:1;                     /**< bit:     22  Output Write Status                           */
    uint32_t P23:1;                     /**< bit:     23  Output Write Status                           */
    uint32_t P24:1;                     /**< bit:     24  Output Write Status                           */
    uint32_t P25:1;                     /**< bit:     25  Output Write Status                           */
    uint32_t P26:1;                     /**< bit:     26  Output Write Status                           */
    uint32_t P27:1;                     /**< bit:     27  Output Write Status                           */
    uint32_t P28:1;                     /**< bit:     28  Output Write Status                           */
    uint32_t P29:1;                     /**< bit:     29  Output Write Status                           */
    uint32_t P30:1;                     /**< bit:     30  Output Write Status                           */
    uint32_t P31:1;                     /**< bit:     31  Output Write Status                           */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Output Write Status                           */
  };
  uint32_t w;
} __PORT_OWSR_bits_t;

#define PORT_OWSR_P0_Pos                      (0)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P0_Msk                      (0x1U << PORT_OWSR_P0_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P1_Pos                      (1)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P1_Msk                      (0x1U << PORT_OWSR_P1_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P2_Pos                      (2)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P2_Msk                      (0x1U << PORT_OWSR_P2_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P3_Pos                      (3)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P3_Msk                      (0x1U << PORT_OWSR_P3_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P4_Pos                      (4)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P4_Msk                      (0x1U << PORT_OWSR_P4_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P5_Pos                      (5)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P5_Msk                      (0x1U << PORT_OWSR_P5_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P6_Pos                      (6)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P6_Msk                      (0x1U << PORT_OWSR_P6_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P7_Pos                      (7)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P7_Msk                      (0x1U << PORT_OWSR_P7_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P8_Pos                      (8)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P8_Msk                      (0x1U << PORT_OWSR_P8_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P9_Pos                      (9)                                            /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P9_Msk                      (0x1U << PORT_OWSR_P9_Pos)                     /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P10_Pos                     (10)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P10_Msk                     (0x1U << PORT_OWSR_P10_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P11_Pos                     (11)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P11_Msk                     (0x1U << PORT_OWSR_P11_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P12_Pos                     (12)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P12_Msk                     (0x1U << PORT_OWSR_P12_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P13_Pos                     (13)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P13_Msk                     (0x1U << PORT_OWSR_P13_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P14_Pos                     (14)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P14_Msk                     (0x1U << PORT_OWSR_P14_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P15_Pos                     (15)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P15_Msk                     (0x1U << PORT_OWSR_P15_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P16_Pos                     (16)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P16_Msk                     (0x1U << PORT_OWSR_P16_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P17_Pos                     (17)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P17_Msk                     (0x1U << PORT_OWSR_P17_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P18_Pos                     (18)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P18_Msk                     (0x1U << PORT_OWSR_P18_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P19_Pos                     (19)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P19_Msk                     (0x1U << PORT_OWSR_P19_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P20_Pos                     (20)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P20_Msk                     (0x1U << PORT_OWSR_P20_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P21_Pos                     (21)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P21_Msk                     (0x1U << PORT_OWSR_P21_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P22_Pos                     (22)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P22_Msk                     (0x1U << PORT_OWSR_P22_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P23_Pos                     (23)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P23_Msk                     (0x1U << PORT_OWSR_P23_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P24_Pos                     (24)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P24_Msk                     (0x1U << PORT_OWSR_P24_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P25_Pos                     (25)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P25_Msk                     (0x1U << PORT_OWSR_P25_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P26_Pos                     (26)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P26_Msk                     (0x1U << PORT_OWSR_P26_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P27_Pos                     (27)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P27_Msk                     (0x1U << PORT_OWSR_P27_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P28_Pos                     (28)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P28_Msk                     (0x1U << PORT_OWSR_P28_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P29_Pos                     (29)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P29_Msk                     (0x1U << PORT_OWSR_P29_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P30_Pos                     (30)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P30_Msk                     (0x1U << PORT_OWSR_P30_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_P31_Pos                     (31)                                           /**< (PORT_OWSR) Output Write Status Position */
#define PORT_OWSR_P31_Msk                     (0x1U << PORT_OWSR_P31_Pos)                    /**< (PORT_OWSR) Output Write Status Mask */
#define PORT_OWSR_Msk                         (0xFFFFFFFFUL)                                 /**< (PORT_OWSR) Register Mask  */
#define PORT_OWSR_P_Pos                       (0)                                            /**< (PORT_OWSR Position) Output Write Status */
#define PORT_OWSR_P_Msk                       (0xFFFFFFFFU << PORT_OWSR_P_Pos)               /**< (PORT_OWSR Mask) P */
#define PORT_OWSR_P(value)                    (PORT_OWSR_P_Msk & ((value) << PORT_OWSR_P_Pos))

