zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/* -------- PORT_AIMMR : (PORT Offset: 0xb8) (R/ 32) Additional Interrupt Modes Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  IO Line Index                                 */
    uint32_t P1:1;                      /**< bit:      1  IO Line Index                                 */
    uint32_t P2:1;                      /**< bit:      2  IO Line Index                                 */
    uint32_t P3:1;                      /**< bit:      3  IO Line Index                                 */
    uint32_t P4:1;                      /**< bit:      4  IO Line Index                                 */
    uint32_t P5:1;                      /**< bit:      5  IO Line Index                                 */
    uint32_t P6:1;                      /**< bit:      6  IO Line Index                                 */
    uint32_t P7:1;                      /**< bit:      7  IO Line Index                                 */
    uint32_t P8:1;                      /**< bit:      8  IO Line Index                                 */
    uint32_t P9:1;                      /**< bit:      9  IO Line Index                                 */
    uint32_t P10:1;                     /**< bit:     10  IO Line Index                                 */
    uint32_t P11:1;                     /**< bit:     11  IO Line Index                                 */
    uint32_t P12:1;                     /**< bit:     12  IO Line Index                                 */
    uint32_t P13:1;                     /**< bit:     13  IO Line Index                                 */
    uint32_t P14:1;                     /**< bit:     14  IO Line Index                                 */
    uint32_t P15:1;                     /**< bit:     15  IO Line Index                                 */
    uint32_t P16:1;                     /**< bit:     16  IO Line Index                                 */
    uint32_t P17:1;                     /**< bit:     17  IO Line Index                                 */
    uint32_t P18:1;                     /**< bit:     18  IO Line Index                                 */
    uint32_t P19:1;                     /**< bit:     19  IO Line Index                                 */
    uint32_t P20:1;                     /**< bit:     20  IO Line Index                                 */
    uint32_t P21:1;                     /**< bit:     21  IO Line Index                                 */
    uint32_t P22:1;                     /**< bit:     22  IO Line Index                                 */
    uint32_t P23:1;                     /**< bit:     23  IO Line Index                                 */
    uint32_t P24:1;                     /**< bit:     24  IO Line Index                                 */
    uint32_t P25:1;                     /**< bit:     25  IO Line Index                                 */
    uint32_t P26:1;                     /**< bit:     26  IO Line Index                                 */
    uint32_t P27:1;                     /**< bit:     27  IO Line Index                                 */
    uint32_t P28:1;                     /**< bit:     28  IO Line Index                                 */
    uint32_t P29:1;                     /**< bit:     29  IO Line Index                                 */
    uint32_t P30:1;                     /**< bit:     30  IO Line Index                                 */
    uint32_t P31:1;                     /**< bit:     31  IO Line Index                                 */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  IO Line Index                                 */
  };
  uint32_t w;
} __PORT_AIMMR_bits_t;

#define PORT_AIMMR_P0_Pos                     (0)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P0_Msk                     (0x1U << PORT_AIMMR_P0_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P1_Pos                     (1)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P1_Msk                     (0x1U << PORT_AIMMR_P1_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P2_Pos                     (2)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P2_Msk                     (0x1U << PORT_AIMMR_P2_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P3_Pos                     (3)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P3_Msk                     (0x1U << PORT_AIMMR_P3_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P4_Pos                     (4)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P4_Msk                     (0x1U << PORT_AIMMR_P4_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P5_Pos                     (5)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P5_Msk                     (0x1U << PORT_AIMMR_P5_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P6_Pos                     (6)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P6_Msk                     (0x1U << PORT_AIMMR_P6_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P7_Pos                     (7)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P7_Msk                     (0x1U << PORT_AIMMR_P7_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P8_Pos                     (8)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P8_Msk                     (0x1U << PORT_AIMMR_P8_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P9_Pos                     (9)                                            /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P9_Msk                     (0x1U << PORT_AIMMR_P9_Pos)                    /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P10_Pos                    (10)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P10_Msk                    (0x1U << PORT_AIMMR_P10_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P11_Pos                    (11)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P11_Msk                    (0x1U << PORT_AIMMR_P11_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P12_Pos                    (12)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P12_Msk                    (0x1U << PORT_AIMMR_P12_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P13_Pos                    (13)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P13_Msk                    (0x1U << PORT_AIMMR_P13_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P14_Pos                    (14)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P14_Msk                    (0x1U << PORT_AIMMR_P14_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P15_Pos                    (15)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P15_Msk                    (0x1U << PORT_AIMMR_P15_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P16_Pos                    (16)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P16_Msk                    (0x1U << PORT_AIMMR_P16_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P17_Pos                    (17)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P17_Msk                    (0x1U << PORT_AIMMR_P17_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P18_Pos                    (18)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P18_Msk                    (0x1U << PORT_AIMMR_P18_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P19_Pos                    (19)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P19_Msk                    (0x1U << PORT_AIMMR_P19_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P20_Pos                    (20)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P20_Msk                    (0x1U << PORT_AIMMR_P20_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P21_Pos                    (21)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P21_Msk                    (0x1U << PORT_AIMMR_P21_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P22_Pos                    (22)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P22_Msk                    (0x1U << PORT_AIMMR_P22_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P23_Pos                    (23)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P23_Msk                    (0x1U << PORT_AIMMR_P23_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P24_Pos                    (24)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P24_Msk                    (0x1U << PORT_AIMMR_P24_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P25_Pos                    (25)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P25_Msk                    (0x1U << PORT_AIMMR_P25_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P26_Pos                    (26)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P26_Msk                    (0x1U << PORT_AIMMR_P26_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P27_Pos                    (27)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P27_Msk                    (0x1U << PORT_AIMMR_P27_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P28_Pos                    (28)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P28_Msk                    (0x1U << PORT_AIMMR_P28_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P29_Pos                    (29)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P29_Msk                    (0x1U << PORT_AIMMR_P29_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P30_Pos                    (30)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P30_Msk                    (0x1U << PORT_AIMMR_P30_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_P31_Pos                    (31)                                           /**< (PORT_AIMMR) IO Line Index Position */
#define PORT_AIMMR_P31_Msk                    (0x1U << PORT_AIMMR_P31_Pos)                   /**< (PORT_AIMMR) IO Line Index Mask */
#define PORT_AIMMR_Msk                        (0xFFFFFFFFUL)                                 /**< (PORT_AIMMR) Register Mask  */
#define PORT_AIMMR_P_Pos                      (0)                                            /**< (PORT_AIMMR Position) IO Line Index */
#define PORT_AIMMR_P_Msk                      (0xFFFFFFFFU << PORT_AIMMR_P_Pos)              /**< (PORT_AIMMR Mask) P */
#define PORT_AIMMR_P(value)                   (PORT_AIMMR_P_Msk & ((value) << PORT_AIMMR_P_Pos))

/* -------- PORT_ESR : (PORT Offset: 0xc0) (/W 32) Edge Select Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Edge Interrupt Selection                      */
    uint32_t P1:1;                      /**< bit:      1  Edge Interrupt Selection                      */
    uint32_t P2:1;                      /**< bit:      2  Edge Interrupt Selection                      */
    uint32_t P3:1;                      /**< bit:      3  Edge Interrupt Selection                      */
    uint32_t P4:1;                      /**< bit:      4  Edge Interrupt Selection                      */
    uint32_t P5:1;                      /**< bit:      5  Edge Interrupt Selection                      */
    uint32_t P6:1;                      /**< bit:      6  Edge Interrupt Selection                      */
    uint32_t P7:1;                      /**< bit:      7  Edge Interrupt Selection                      */
    uint32_t P8:1;                      /**< bit:      8  Edge Interrupt Selection                      */
    uint32_t P9:1;                      /**< bit:      9  Edge Interrupt Selection                      */
    uint32_t P10:1;                     /**< bit:     10  Edge Interrupt Selection                      */
    uint32_t P11:1;                     /**< bit:     11  Edge Interrupt Selection                      */
    uint32_t P12:1;                     /**< bit:     12  Edge Interrupt Selection                      */
    uint32_t P13:1;                     /**< bit:     13  Edge Interrupt Selection                      */
    uint32_t P14:1;                     /**< bit:     14  Edge Interrupt Selection                      */
    uint32_t P15:1;                     /**< bit:     15  Edge Interrupt Selection                      */
    uint32_t P16:1;                     /**< bit:     16  Edge Interrupt Selection                      */
    uint32_t P17:1;                     /**< bit:     17  Edge Interrupt Selection                      */
    uint32_t P18:1;                     /**< bit:     18  Edge Interrupt Selection                      */
    uint32_t P19:1;                     /**< bit:     19  Edge Interrupt Selection                      */
    uint32_t P20:1;                     /**< bit:     20  Edge Interrupt Selection                      */
    uint32_t P21:1;                     /**< bit:     21  Edge Interrupt Selection                      */
    uint32_t P22:1;                     /**< bit:     22  Edge Interrupt Selection                      */
    uint32_t P23:1;                     /**< bit:     23  Edge Interrupt Selection                      */
    uint32_t P24:1;                     /**< bit:     24  Edge Interrupt Selection                      */
    uint32_t P25:1;                     /**< bit:     25  Edge Interrupt Selection                      */
    uint32_t P26:1;                     /**< bit:     26  Edge Interrupt Selection                      */
    uint32_t P27:1;                     /**< bit:     27  Edge Interrupt Selection                      */
    uint32_t P28:1;                     /**< bit:     28  Edge Interrupt Selection                      */
    uint32_t P29:1;                     /**< bit:     29  Edge Interrupt Selection                      */
    uint32_t P30:1;                     /**< bit:     30  Edge Interrupt Selection                      */
    uint32_t P31:1;                     /**< bit:     31  Edge Interrupt Selection                      */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Edge Interrupt Selection                      */
  };
  uint32_t w;
} __PORT_ESR_bits_t;

