zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_ESR_P0_Pos                       (0)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P0_Msk                       (0x1U << PORT_ESR_P0_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P1_Pos                       (1)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P1_Msk                       (0x1U << PORT_ESR_P1_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P2_Pos                       (2)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P2_Msk                       (0x1U << PORT_ESR_P2_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P3_Pos                       (3)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P3_Msk                       (0x1U << PORT_ESR_P3_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P4_Pos                       (4)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P4_Msk                       (0x1U << PORT_ESR_P4_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P5_Pos                       (5)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P5_Msk                       (0x1U << PORT_ESR_P5_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P6_Pos                       (6)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P6_Msk                       (0x1U << PORT_ESR_P6_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P7_Pos                       (7)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P7_Msk                       (0x1U << PORT_ESR_P7_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P8_Pos                       (8)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P8_Msk                       (0x1U << PORT_ESR_P8_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P9_Pos                       (9)                                            /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P9_Msk                       (0x1U << PORT_ESR_P9_Pos)                      /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P10_Pos                      (10)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P10_Msk                      (0x1U << PORT_ESR_P10_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P11_Pos                      (11)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P11_Msk                      (0x1U << PORT_ESR_P11_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P12_Pos                      (12)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P12_Msk                      (0x1U << PORT_ESR_P12_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P13_Pos                      (13)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P13_Msk                      (0x1U << PORT_ESR_P13_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P14_Pos                      (14)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P14_Msk                      (0x1U << PORT_ESR_P14_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P15_Pos                      (15)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P15_Msk                      (0x1U << PORT_ESR_P15_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P16_Pos                      (16)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P16_Msk                      (0x1U << PORT_ESR_P16_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P17_Pos                      (17)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P17_Msk                      (0x1U << PORT_ESR_P17_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P18_Pos                      (18)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P18_Msk                      (0x1U << PORT_ESR_P18_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P19_Pos                      (19)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P19_Msk                      (0x1U << PORT_ESR_P19_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P20_Pos                      (20)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P20_Msk                      (0x1U << PORT_ESR_P20_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P21_Pos                      (21)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P21_Msk                      (0x1U << PORT_ESR_P21_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P22_Pos                      (22)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P22_Msk                      (0x1U << PORT_ESR_P22_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P23_Pos                      (23)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P23_Msk                      (0x1U << PORT_ESR_P23_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P24_Pos                      (24)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P24_Msk                      (0x1U << PORT_ESR_P24_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P25_Pos                      (25)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P25_Msk                      (0x1U << PORT_ESR_P25_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P26_Pos                      (26)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P26_Msk                      (0x1U << PORT_ESR_P26_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P27_Pos                      (27)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P27_Msk                      (0x1U << PORT_ESR_P27_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P28_Pos                      (28)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P28_Msk                      (0x1U << PORT_ESR_P28_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P29_Pos                      (29)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P29_Msk                      (0x1U << PORT_ESR_P29_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P30_Pos                      (30)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P30_Msk                      (0x1U << PORT_ESR_P30_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_P31_Pos                      (31)                                           /**< (PORT_ESR) Edge Interrupt Selection Position */
#define PORT_ESR_P31_Msk                      (0x1U << PORT_ESR_P31_Pos)                     /**< (PORT_ESR) Edge Interrupt Selection Mask */
#define PORT_ESR_Msk                          (0xFFFFFFFFUL)                                 /**< (PORT_ESR) Register Mask  */
#define PORT_ESR_P_Pos                        (0)                                            /**< (PORT_ESR Position) Edge Interrupt Selection */
#define PORT_ESR_P_Msk                        (0xFFFFFFFFU << PORT_ESR_P_Pos)                /**< (PORT_ESR Mask) P */
#define PORT_ESR_P(value)                     (PORT_ESR_P_Msk & ((value) << PORT_ESR_P_Pos))

/* -------- PORT_LSR : (PORT Offset: 0xc4) (/W 32) Level Select Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Level Interrupt Selection                     */
    uint32_t P1:1;                      /**< bit:      1  Level Interrupt Selection                     */
    uint32_t P2:1;                      /**< bit:      2  Level Interrupt Selection                     */
    uint32_t P3:1;                      /**< bit:      3  Level Interrupt Selection                     */
    uint32_t P4:1;                      /**< bit:      4  Level Interrupt Selection                     */
    uint32_t P5:1;                      /**< bit:      5  Level Interrupt Selection                     */
    uint32_t P6:1;                      /**< bit:      6  Level Interrupt Selection                     */
    uint32_t P7:1;                      /**< bit:      7  Level Interrupt Selection                     */
    uint32_t P8:1;                      /**< bit:      8  Level Interrupt Selection                     */
    uint32_t P9:1;                      /**< bit:      9  Level Interrupt Selection                     */
    uint32_t P10:1;                     /**< bit:     10  Level Interrupt Selection                     */
    uint32_t P11:1;                     /**< bit:     11  Level Interrupt Selection                     */
    uint32_t P12:1;                     /**< bit:     12  Level Interrupt Selection                     */
    uint32_t P13:1;                     /**< bit:     13  Level Interrupt Selection                     */
    uint32_t P14:1;                     /**< bit:     14  Level Interrupt Selection                     */
    uint32_t P15:1;                     /**< bit:     15  Level Interrupt Selection                     */
    uint32_t P16:1;                     /**< bit:     16  Level Interrupt Selection                     */
    uint32_t P17:1;                     /**< bit:     17  Level Interrupt Selection                     */
    uint32_t P18:1;                     /**< bit:     18  Level Interrupt Selection                     */
    uint32_t P19:1;                     /**< bit:     19  Level Interrupt Selection                     */
    uint32_t P20:1;                     /**< bit:     20  Level Interrupt Selection                     */
    uint32_t P21:1;                     /**< bit:     21  Level Interrupt Selection                     */
    uint32_t P22:1;                     /**< bit:     22  Level Interrupt Selection                     */
    uint32_t P23:1;                     /**< bit:     23  Level Interrupt Selection                     */
    uint32_t P24:1;                     /**< bit:     24  Level Interrupt Selection                     */
    uint32_t P25:1;                     /**< bit:     25  Level Interrupt Selection                     */
    uint32_t P26:1;                     /**< bit:     26  Level Interrupt Selection                     */
    uint32_t P27:1;                     /**< bit:     27  Level Interrupt Selection                     */
    uint32_t P28:1;                     /**< bit:     28  Level Interrupt Selection                     */
    uint32_t P29:1;                     /**< bit:     29  Level Interrupt Selection                     */
    uint32_t P30:1;                     /**< bit:     30  Level Interrupt Selection                     */
    uint32_t P31:1;                     /**< bit:     31  Level Interrupt Selection                     */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Level Interrupt Selection                     */
  };
  uint32_t w;
} __PORT_LSR_bits_t;

#define PORT_LSR_P0_Pos                       (0)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P0_Msk                       (0x1U << PORT_LSR_P0_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P1_Pos                       (1)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P1_Msk                       (0x1U << PORT_LSR_P1_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P2_Pos                       (2)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P2_Msk                       (0x1U << PORT_LSR_P2_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P3_Pos                       (3)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P3_Msk                       (0x1U << PORT_LSR_P3_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P4_Pos                       (4)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P4_Msk                       (0x1U << PORT_LSR_P4_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P5_Pos                       (5)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P5_Msk                       (0x1U << PORT_LSR_P5_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P6_Pos                       (6)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P6_Msk                       (0x1U << PORT_LSR_P6_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P7_Pos                       (7)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P7_Msk                       (0x1U << PORT_LSR_P7_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P8_Pos                       (8)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P8_Msk                       (0x1U << PORT_LSR_P8_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P9_Pos                       (9)                                            /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P9_Msk                       (0x1U << PORT_LSR_P9_Pos)                      /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P10_Pos                      (10)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P10_Msk                      (0x1U << PORT_LSR_P10_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P11_Pos                      (11)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P11_Msk                      (0x1U << PORT_LSR_P11_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P12_Pos                      (12)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P12_Msk                      (0x1U << PORT_LSR_P12_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P13_Pos                      (13)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P13_Msk                      (0x1U << PORT_LSR_P13_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P14_Pos                      (14)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P14_Msk                      (0x1U << PORT_LSR_P14_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P15_Pos                      (15)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P15_Msk                      (0x1U << PORT_LSR_P15_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P16_Pos                      (16)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P16_Msk                      (0x1U << PORT_LSR_P16_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P17_Pos                      (17)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P17_Msk                      (0x1U << PORT_LSR_P17_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P18_Pos                      (18)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P18_Msk                      (0x1U << PORT_LSR_P18_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P19_Pos                      (19)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P19_Msk                      (0x1U << PORT_LSR_P19_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P20_Pos                      (20)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P20_Msk                      (0x1U << PORT_LSR_P20_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P21_Pos                      (21)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P21_Msk                      (0x1U << PORT_LSR_P21_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P22_Pos                      (22)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P22_Msk                      (0x1U << PORT_LSR_P22_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P23_Pos                      (23)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P23_Msk                      (0x1U << PORT_LSR_P23_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P24_Pos                      (24)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P24_Msk                      (0x1U << PORT_LSR_P24_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P25_Pos                      (25)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P25_Msk                      (0x1U << PORT_LSR_P25_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P26_Pos                      (26)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P26_Msk                      (0x1U << PORT_LSR_P26_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P27_Pos                      (27)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P27_Msk                      (0x1U << PORT_LSR_P27_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P28_Pos                      (28)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P28_Msk                      (0x1U << PORT_LSR_P28_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P29_Pos                      (29)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P29_Msk                      (0x1U << PORT_LSR_P29_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P30_Pos                      (30)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P30_Msk                      (0x1U << PORT_LSR_P30_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_P31_Pos                      (31)                                           /**< (PORT_LSR) Level Interrupt Selection Position */
#define PORT_LSR_P31_Msk                      (0x1U << PORT_LSR_P31_Pos)                     /**< (PORT_LSR) Level Interrupt Selection Mask */
#define PORT_LSR_Msk                          (0xFFFFFFFFUL)                                 /**< (PORT_LSR) Register Mask  */
#define PORT_LSR_P_Pos                        (0)                                            /**< (PORT_LSR Position) Level Interrupt Selection */
#define PORT_LSR_P_Msk                        (0xFFFFFFFFU << PORT_LSR_P_Pos)                /**< (PORT_LSR Mask) P */
#define PORT_LSR_P(value)                     (PORT_LSR_P_Msk & ((value) << PORT_LSR_P_Pos))

/* -------- PORT_ELSR : (PORT Offset: 0xc8) (R/ 32) Edge/Level Status Register -------- */

