zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_FELLSR_P0_Pos                    (0)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P0_Msk                    (0x1U << PORT_FELLSR_P0_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P1_Pos                    (1)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P1_Msk                    (0x1U << PORT_FELLSR_P1_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P2_Pos                    (2)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P2_Msk                    (0x1U << PORT_FELLSR_P2_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P3_Pos                    (3)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P3_Msk                    (0x1U << PORT_FELLSR_P3_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P4_Pos                    (4)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P4_Msk                    (0x1U << PORT_FELLSR_P4_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P5_Pos                    (5)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P5_Msk                    (0x1U << PORT_FELLSR_P5_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P6_Pos                    (6)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P6_Msk                    (0x1U << PORT_FELLSR_P6_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P7_Pos                    (7)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P7_Msk                    (0x1U << PORT_FELLSR_P7_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P8_Pos                    (8)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P8_Msk                    (0x1U << PORT_FELLSR_P8_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P9_Pos                    (9)                                            /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P9_Msk                    (0x1U << PORT_FELLSR_P9_Pos)                   /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P10_Pos                   (10)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P10_Msk                   (0x1U << PORT_FELLSR_P10_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P11_Pos                   (11)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P11_Msk                   (0x1U << PORT_FELLSR_P11_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P12_Pos                   (12)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P12_Msk                   (0x1U << PORT_FELLSR_P12_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P13_Pos                   (13)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P13_Msk                   (0x1U << PORT_FELLSR_P13_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P14_Pos                   (14)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P14_Msk                   (0x1U << PORT_FELLSR_P14_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P15_Pos                   (15)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P15_Msk                   (0x1U << PORT_FELLSR_P15_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P16_Pos                   (16)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P16_Msk                   (0x1U << PORT_FELLSR_P16_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P17_Pos                   (17)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P17_Msk                   (0x1U << PORT_FELLSR_P17_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P18_Pos                   (18)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P18_Msk                   (0x1U << PORT_FELLSR_P18_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P19_Pos                   (19)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P19_Msk                   (0x1U << PORT_FELLSR_P19_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P20_Pos                   (20)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P20_Msk                   (0x1U << PORT_FELLSR_P20_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P21_Pos                   (21)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P21_Msk                   (0x1U << PORT_FELLSR_P21_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P22_Pos                   (22)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P22_Msk                   (0x1U << PORT_FELLSR_P22_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P23_Pos                   (23)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P23_Msk                   (0x1U << PORT_FELLSR_P23_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P24_Pos                   (24)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P24_Msk                   (0x1U << PORT_FELLSR_P24_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P25_Pos                   (25)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P25_Msk                   (0x1U << PORT_FELLSR_P25_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P26_Pos                   (26)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P26_Msk                   (0x1U << PORT_FELLSR_P26_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P27_Pos                   (27)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P27_Msk                   (0x1U << PORT_FELLSR_P27_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P28_Pos                   (28)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P28_Msk                   (0x1U << PORT_FELLSR_P28_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P29_Pos                   (29)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P29_Msk                   (0x1U << PORT_FELLSR_P29_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P30_Pos                   (30)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P30_Msk                   (0x1U << PORT_FELLSR_P30_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_P31_Pos                   (31)                                           /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Position */
#define PORT_FELLSR_P31_Msk                   (0x1U << PORT_FELLSR_P31_Pos)                  /**< (PORT_FELLSR) Falling Edge/Low-Level Interrupt Selection Mask */
#define PORT_FELLSR_Msk                       (0xFFFFFFFFUL)                                 /**< (PORT_FELLSR) Register Mask  */
#define PORT_FELLSR_P_Pos                     (0)                                            /**< (PORT_FELLSR Position) Falling Edge/Low-Level Interrupt Selection */
#define PORT_FELLSR_P_Msk                     (0xFFFFFFFFU << PORT_FELLSR_P_Pos)             /**< (PORT_FELLSR Mask) P */
#define PORT_FELLSR_P(value)                  (PORT_FELLSR_P_Msk & ((value) << PORT_FELLSR_P_Pos))

