zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/* -------- PORT_REHLSR : (PORT Offset: 0xd4) (/W 32) Rising Edge/High-Level Select Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P1:1;                      /**< bit:      1  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P2:1;                      /**< bit:      2  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P3:1;                      /**< bit:      3  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P4:1;                      /**< bit:      4  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P5:1;                      /**< bit:      5  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P6:1;                      /**< bit:      6  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P7:1;                      /**< bit:      7  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P8:1;                      /**< bit:      8  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P9:1;                      /**< bit:      9  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P10:1;                     /**< bit:     10  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P11:1;                     /**< bit:     11  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P12:1;                     /**< bit:     12  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P13:1;                     /**< bit:     13  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P14:1;                     /**< bit:     14  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P15:1;                     /**< bit:     15  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P16:1;                     /**< bit:     16  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P17:1;                     /**< bit:     17  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P18:1;                     /**< bit:     18  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P19:1;                     /**< bit:     19  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P20:1;                     /**< bit:     20  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P21:1;                     /**< bit:     21  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P22:1;                     /**< bit:     22  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P23:1;                     /**< bit:     23  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P24:1;                     /**< bit:     24  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P25:1;                     /**< bit:     25  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P26:1;                     /**< bit:     26  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P27:1;                     /**< bit:     27  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P28:1;                     /**< bit:     28  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P29:1;                     /**< bit:     29  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P30:1;                     /**< bit:     30  Rising Edge/High-Level Interrupt Selection    */
    uint32_t P31:1;                     /**< bit:     31  Rising Edge/High-Level Interrupt Selection    */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Rising Edge/High-Level Interrupt Selection    */
  };
  uint32_t w;
} __PORT_REHLSR_bits_t;

#define PORT_REHLSR_P0_Pos                    (0)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P0_Msk                    (0x1U << PORT_REHLSR_P0_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P1_Pos                    (1)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P1_Msk                    (0x1U << PORT_REHLSR_P1_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P2_Pos                    (2)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P2_Msk                    (0x1U << PORT_REHLSR_P2_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P3_Pos                    (3)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P3_Msk                    (0x1U << PORT_REHLSR_P3_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P4_Pos                    (4)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P4_Msk                    (0x1U << PORT_REHLSR_P4_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P5_Pos                    (5)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P5_Msk                    (0x1U << PORT_REHLSR_P5_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P6_Pos                    (6)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P6_Msk                    (0x1U << PORT_REHLSR_P6_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P7_Pos                    (7)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P7_Msk                    (0x1U << PORT_REHLSR_P7_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P8_Pos                    (8)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P8_Msk                    (0x1U << PORT_REHLSR_P8_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P9_Pos                    (9)                                            /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P9_Msk                    (0x1U << PORT_REHLSR_P9_Pos)                   /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P10_Pos                   (10)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P10_Msk                   (0x1U << PORT_REHLSR_P10_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P11_Pos                   (11)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P11_Msk                   (0x1U << PORT_REHLSR_P11_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P12_Pos                   (12)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P12_Msk                   (0x1U << PORT_REHLSR_P12_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P13_Pos                   (13)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P13_Msk                   (0x1U << PORT_REHLSR_P13_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P14_Pos                   (14)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P14_Msk                   (0x1U << PORT_REHLSR_P14_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P15_Pos                   (15)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P15_Msk                   (0x1U << PORT_REHLSR_P15_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P16_Pos                   (16)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P16_Msk                   (0x1U << PORT_REHLSR_P16_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P17_Pos                   (17)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P17_Msk                   (0x1U << PORT_REHLSR_P17_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P18_Pos                   (18)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P18_Msk                   (0x1U << PORT_REHLSR_P18_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P19_Pos                   (19)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P19_Msk                   (0x1U << PORT_REHLSR_P19_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P20_Pos                   (20)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P20_Msk                   (0x1U << PORT_REHLSR_P20_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P21_Pos                   (21)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P21_Msk                   (0x1U << PORT_REHLSR_P21_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P22_Pos                   (22)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P22_Msk                   (0x1U << PORT_REHLSR_P22_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P23_Pos                   (23)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P23_Msk                   (0x1U << PORT_REHLSR_P23_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P24_Pos                   (24)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P24_Msk                   (0x1U << PORT_REHLSR_P24_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P25_Pos                   (25)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P25_Msk                   (0x1U << PORT_REHLSR_P25_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P26_Pos                   (26)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P26_Msk                   (0x1U << PORT_REHLSR_P26_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P27_Pos                   (27)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P27_Msk                   (0x1U << PORT_REHLSR_P27_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P28_Pos                   (28)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P28_Msk                   (0x1U << PORT_REHLSR_P28_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P29_Pos                   (29)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P29_Msk                   (0x1U << PORT_REHLSR_P29_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P30_Pos                   (30)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P30_Msk                   (0x1U << PORT_REHLSR_P30_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_P31_Pos                   (31)                                           /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Position */
#define PORT_REHLSR_P31_Msk                   (0x1U << PORT_REHLSR_P31_Pos)                  /**< (PORT_REHLSR) Rising Edge/High-Level Interrupt Selection Mask */
#define PORT_REHLSR_Msk                       (0xFFFFFFFFUL)                                 /**< (PORT_REHLSR) Register Mask  */
#define PORT_REHLSR_P_Pos                     (0)                                            /**< (PORT_REHLSR Position) Rising Edge/High-Level Interrupt Selection */
#define PORT_REHLSR_P_Msk                     (0xFFFFFFFFU << PORT_REHLSR_P_Pos)             /**< (PORT_REHLSR Mask) P */
#define PORT_REHLSR_P(value)                  (PORT_REHLSR_P_Msk & ((value) << PORT_REHLSR_P_Pos))

