zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/* -------- PORT_FRLHSR : (PORT Offset: 0xd8) (R/ 32) Fall/Rise - Low/High Status Register -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Edge/Level Interrupt Source Selection         */
    uint32_t P1:1;                      /**< bit:      1  Edge/Level Interrupt Source Selection         */
    uint32_t P2:1;                      /**< bit:      2  Edge/Level Interrupt Source Selection         */
    uint32_t P3:1;                      /**< bit:      3  Edge/Level Interrupt Source Selection         */
    uint32_t P4:1;                      /**< bit:      4  Edge/Level Interrupt Source Selection         */
    uint32_t P5:1;                      /**< bit:      5  Edge/Level Interrupt Source Selection         */
    uint32_t P6:1;                      /**< bit:      6  Edge/Level Interrupt Source Selection         */
    uint32_t P7:1;                      /**< bit:      7  Edge/Level Interrupt Source Selection         */
    uint32_t P8:1;                      /**< bit:      8  Edge/Level Interrupt Source Selection         */
    uint32_t P9:1;                      /**< bit:      9  Edge/Level Interrupt Source Selection         */
    uint32_t P10:1;                     /**< bit:     10  Edge/Level Interrupt Source Selection         */
    uint32_t P11:1;                     /**< bit:     11  Edge/Level Interrupt Source Selection         */
    uint32_t P12:1;                     /**< bit:     12  Edge/Level Interrupt Source Selection         */
    uint32_t P13:1;                     /**< bit:     13  Edge/Level Interrupt Source Selection         */
    uint32_t P14:1;                     /**< bit:     14  Edge/Level Interrupt Source Selection         */
    uint32_t P15:1;                     /**< bit:     15  Edge/Level Interrupt Source Selection         */
    uint32_t P16:1;                     /**< bit:     16  Edge/Level Interrupt Source Selection         */
    uint32_t P17:1;                     /**< bit:     17  Edge/Level Interrupt Source Selection         */
    uint32_t P18:1;                     /**< bit:     18  Edge/Level Interrupt Source Selection         */
    uint32_t P19:1;                     /**< bit:     19  Edge/Level Interrupt Source Selection         */
    uint32_t P20:1;                     /**< bit:     20  Edge/Level Interrupt Source Selection         */
    uint32_t P21:1;                     /**< bit:     21  Edge/Level Interrupt Source Selection         */
    uint32_t P22:1;                     /**< bit:     22  Edge/Level Interrupt Source Selection         */
    uint32_t P23:1;                     /**< bit:     23  Edge/Level Interrupt Source Selection         */
    uint32_t P24:1;                     /**< bit:     24  Edge/Level Interrupt Source Selection         */
    uint32_t P25:1;                     /**< bit:     25  Edge/Level Interrupt Source Selection         */
    uint32_t P26:1;                     /**< bit:     26  Edge/Level Interrupt Source Selection         */
    uint32_t P27:1;                     /**< bit:     27  Edge/Level Interrupt Source Selection         */
    uint32_t P28:1;                     /**< bit:     28  Edge/Level Interrupt Source Selection         */
    uint32_t P29:1;                     /**< bit:     29  Edge/Level Interrupt Source Selection         */
    uint32_t P30:1;                     /**< bit:     30  Edge/Level Interrupt Source Selection         */
    uint32_t P31:1;                     /**< bit:     31  Edge/Level Interrupt Source Selection         */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Edge/Level Interrupt Source Selection         */
  };
  uint32_t w;
} __PORT_FRLHSR_bits_t;

#define PORT_FRLHSR_P0_Pos                    (0)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P0_Msk                    (0x1U << PORT_FRLHSR_P0_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P1_Pos                    (1)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P1_Msk                    (0x1U << PORT_FRLHSR_P1_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P2_Pos                    (2)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P2_Msk                    (0x1U << PORT_FRLHSR_P2_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P3_Pos                    (3)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P3_Msk                    (0x1U << PORT_FRLHSR_P3_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P4_Pos                    (4)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P4_Msk                    (0x1U << PORT_FRLHSR_P4_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P5_Pos                    (5)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P5_Msk                    (0x1U << PORT_FRLHSR_P5_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P6_Pos                    (6)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P6_Msk                    (0x1U << PORT_FRLHSR_P6_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P7_Pos                    (7)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P7_Msk                    (0x1U << PORT_FRLHSR_P7_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P8_Pos                    (8)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P8_Msk                    (0x1U << PORT_FRLHSR_P8_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P9_Pos                    (9)                                            /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P9_Msk                    (0x1U << PORT_FRLHSR_P9_Pos)                   /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P10_Pos                   (10)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P10_Msk                   (0x1U << PORT_FRLHSR_P10_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P11_Pos                   (11)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P11_Msk                   (0x1U << PORT_FRLHSR_P11_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P12_Pos                   (12)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P12_Msk                   (0x1U << PORT_FRLHSR_P12_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P13_Pos                   (13)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P13_Msk                   (0x1U << PORT_FRLHSR_P13_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P14_Pos                   (14)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P14_Msk                   (0x1U << PORT_FRLHSR_P14_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P15_Pos                   (15)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P15_Msk                   (0x1U << PORT_FRLHSR_P15_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P16_Pos                   (16)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P16_Msk                   (0x1U << PORT_FRLHSR_P16_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P17_Pos                   (17)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P17_Msk                   (0x1U << PORT_FRLHSR_P17_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P18_Pos                   (18)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P18_Msk                   (0x1U << PORT_FRLHSR_P18_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P19_Pos                   (19)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P19_Msk                   (0x1U << PORT_FRLHSR_P19_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P20_Pos                   (20)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P20_Msk                   (0x1U << PORT_FRLHSR_P20_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P21_Pos                   (21)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P21_Msk                   (0x1U << PORT_FRLHSR_P21_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P22_Pos                   (22)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P22_Msk                   (0x1U << PORT_FRLHSR_P22_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P23_Pos                   (23)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P23_Msk                   (0x1U << PORT_FRLHSR_P23_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P24_Pos                   (24)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P24_Msk                   (0x1U << PORT_FRLHSR_P24_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P25_Pos                   (25)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P25_Msk                   (0x1U << PORT_FRLHSR_P25_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P26_Pos                   (26)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P26_Msk                   (0x1U << PORT_FRLHSR_P26_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P27_Pos                   (27)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P27_Msk                   (0x1U << PORT_FRLHSR_P27_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P28_Pos                   (28)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P28_Msk                   (0x1U << PORT_FRLHSR_P28_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P29_Pos                   (29)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P29_Msk                   (0x1U << PORT_FRLHSR_P29_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P30_Pos                   (30)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P30_Msk                   (0x1U << PORT_FRLHSR_P30_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_P31_Pos                   (31)                                           /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Position */
#define PORT_FRLHSR_P31_Msk                   (0x1U << PORT_FRLHSR_P31_Pos)                  /**< (PORT_FRLHSR) Edge/Level Interrupt Source Selection Mask */
#define PORT_FRLHSR_Msk                       (0xFFFFFFFFUL)                                 /**< (PORT_FRLHSR) Register Mask  */
#define PORT_FRLHSR_P_Pos                     (0)                                            /**< (PORT_FRLHSR Position) Edge/Level Interrupt Source Selection */
#define PORT_FRLHSR_P_Msk                     (0xFFFFFFFFU << PORT_FRLHSR_P_Pos)             /**< (PORT_FRLHSR Mask) P */
#define PORT_FRLHSR_P(value)                  (PORT_FRLHSR_P_Msk & ((value) << PORT_FRLHSR_P_Pos))

/* -------- PORT_LOCKSR : (PORT Offset: 0xe0) (R/ 32) Lock Status -------- */

typedef union
{
  struct
  {
    uint32_t P0:1;                      /**< bit:      0  Lock Status                                   */
    uint32_t P1:1;                      /**< bit:      1  Lock Status                                   */
    uint32_t P2:1;                      /**< bit:      2  Lock Status                                   */
    uint32_t P3:1;                      /**< bit:      3  Lock Status                                   */
    uint32_t P4:1;                      /**< bit:      4  Lock Status                                   */
    uint32_t P5:1;                      /**< bit:      5  Lock Status                                   */
    uint32_t P6:1;                      /**< bit:      6  Lock Status                                   */
    uint32_t P7:1;                      /**< bit:      7  Lock Status                                   */
    uint32_t P8:1;                      /**< bit:      8  Lock Status                                   */
    uint32_t P9:1;                      /**< bit:      9  Lock Status                                   */
    uint32_t P10:1;                     /**< bit:     10  Lock Status                                   */
    uint32_t P11:1;                     /**< bit:     11  Lock Status                                   */
    uint32_t P12:1;                     /**< bit:     12  Lock Status                                   */
    uint32_t P13:1;                     /**< bit:     13  Lock Status                                   */
    uint32_t P14:1;                     /**< bit:     14  Lock Status                                   */
    uint32_t P15:1;                     /**< bit:     15  Lock Status                                   */
    uint32_t P16:1;                     /**< bit:     16  Lock Status                                   */
    uint32_t P17:1;                     /**< bit:     17  Lock Status                                   */
    uint32_t P18:1;                     /**< bit:     18  Lock Status                                   */
    uint32_t P19:1;                     /**< bit:     19  Lock Status                                   */
    uint32_t P20:1;                     /**< bit:     20  Lock Status                                   */
    uint32_t P21:1;                     /**< bit:     21  Lock Status                                   */
    uint32_t P22:1;                     /**< bit:     22  Lock Status                                   */
    uint32_t P23:1;                     /**< bit:     23  Lock Status                                   */
    uint32_t P24:1;                     /**< bit:     24  Lock Status                                   */
    uint32_t P25:1;                     /**< bit:     25  Lock Status                                   */
    uint32_t P26:1;                     /**< bit:     26  Lock Status                                   */
    uint32_t P27:1;                     /**< bit:     27  Lock Status                                   */
    uint32_t P28:1;                     /**< bit:     28  Lock Status                                   */
    uint32_t P29:1;                     /**< bit:     29  Lock Status                                   */
    uint32_t P30:1;                     /**< bit:     30  Lock Status                                   */
    uint32_t P31:1;                     /**< bit:     31  Lock Status                                   */
  };
  struct
  {
    uint32_t P:32;                      /**< bit:  0..31  Lock Status                                   */
  };
  uint32_t w;
} __PORT_LOCKSR_bits_t;

