zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/* -------- PORT_WPMR : (PORT Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __PORT_WPMR_bits_t;

#define PORT_WPMR_WPEN_Pos                    (0)                                            /**< (PORT_WPMR) Write Protection Enable Position */
#define PORT_WPMR_WPEN_Msk                    (0x1U << PORT_WPMR_WPEN_Pos)                   /**< (PORT_WPMR) Write Protection Enable Mask */
#define PORT_WPMR_WPKEY_Pos                   (8)                                            /**< (PORT_WPMR) Write Protection Key Position */
#define PORT_WPMR_WPKEY_Msk                   (0xFFFFFFU << PORT_WPMR_WPKEY_Pos)             /**< (PORT_WPMR) Write Protection Key Mask */
#define PORT_WPMR_WPKEY(value)                (PORT_WPMR_WPKEY_Msk & ((value) << PORT_WPMR_WPKEY_Pos))
#define   PORT_WPMR_WPKEY_PASSWD_Val          (0x50494FU)                                    /**< (PORT_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define PORT_WPMR_WPKEY_PASSWD                (PORT_WPMR_WPKEY_PASSWD_Val << PORT_WPMR_WPKEY_Pos)  /**< (PORT_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define PORT_WPMR_Msk                         (0xFFFFFF01UL)                                 /**< (PORT_WPMR) Register Mask  */

/* -------- PORT_WPSR : (PORT Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PORT_WPSR_bits_t;

#define PORT_WPSR_WPVS_Pos                    (0)                                            /**< (PORT_WPSR) Write Protection Violation Status Position */
#define PORT_WPSR_WPVS_Msk                    (0x1U << PORT_WPSR_WPVS_Pos)                   /**< (PORT_WPSR) Write Protection Violation Status Mask */
#define PORT_WPSR_WPVSRC_Pos                  (8)                                            /**< (PORT_WPSR) Write Protection Violation Source Position */
#define PORT_WPSR_WPVSRC_Msk                  (0xFFFFU << PORT_WPSR_WPVSRC_Pos)              /**< (PORT_WPSR) Write Protection Violation Source Mask */
#define PORT_WPSR_WPVSRC(value)               (PORT_WPSR_WPVSRC_Msk & ((value) << PORT_WPSR_WPVSRC_Pos))
#define PORT_WPSR_Msk                         (0x00FFFF01UL)                                 /**< (PORT_WPSR) Register Mask  */

/* -------- PORT_SCHMITT : (PORT Offset: 0x100) (R/W 32) Schmitt Trigger Register -------- */

typedef union
{
  struct
  {
    uint32_t SCHMITT0:1;                /**< bit:      0  Schmitt Trigger Control                       */
    uint32_t SCHMITT1:1;                /**< bit:      1  Schmitt Trigger Control                       */
    uint32_t SCHMITT2:1;                /**< bit:      2  Schmitt Trigger Control                       */
    uint32_t SCHMITT3:1;                /**< bit:      3  Schmitt Trigger Control                       */
    uint32_t SCHMITT4:1;                /**< bit:      4  Schmitt Trigger Control                       */
    uint32_t SCHMITT5:1;                /**< bit:      5  Schmitt Trigger Control                       */
    uint32_t SCHMITT6:1;                /**< bit:      6  Schmitt Trigger Control                       */
    uint32_t SCHMITT7:1;                /**< bit:      7  Schmitt Trigger Control                       */
    uint32_t SCHMITT8:1;                /**< bit:      8  Schmitt Trigger Control                       */
    uint32_t SCHMITT9:1;                /**< bit:      9  Schmitt Trigger Control                       */
    uint32_t SCHMITT10:1;               /**< bit:     10  Schmitt Trigger Control                       */
    uint32_t SCHMITT11:1;               /**< bit:     11  Schmitt Trigger Control                       */
    uint32_t SCHMITT12:1;               /**< bit:     12  Schmitt Trigger Control                       */
    uint32_t SCHMITT13:1;               /**< bit:     13  Schmitt Trigger Control                       */
    uint32_t SCHMITT14:1;               /**< bit:     14  Schmitt Trigger Control                       */
    uint32_t SCHMITT15:1;               /**< bit:     15  Schmitt Trigger Control                       */
    uint32_t SCHMITT16:1;               /**< bit:     16  Schmitt Trigger Control                       */
    uint32_t SCHMITT17:1;               /**< bit:     17  Schmitt Trigger Control                       */
    uint32_t SCHMITT18:1;               /**< bit:     18  Schmitt Trigger Control                       */
    uint32_t SCHMITT19:1;               /**< bit:     19  Schmitt Trigger Control                       */
    uint32_t SCHMITT20:1;               /**< bit:     20  Schmitt Trigger Control                       */
    uint32_t SCHMITT21:1;               /**< bit:     21  Schmitt Trigger Control                       */
    uint32_t SCHMITT22:1;               /**< bit:     22  Schmitt Trigger Control                       */
    uint32_t SCHMITT23:1;               /**< bit:     23  Schmitt Trigger Control                       */
    uint32_t SCHMITT24:1;               /**< bit:     24  Schmitt Trigger Control                       */
    uint32_t SCHMITT25:1;               /**< bit:     25  Schmitt Trigger Control                       */
    uint32_t SCHMITT26:1;               /**< bit:     26  Schmitt Trigger Control                       */
    uint32_t SCHMITT27:1;               /**< bit:     27  Schmitt Trigger Control                       */
    uint32_t SCHMITT28:1;               /**< bit:     28  Schmitt Trigger Control                       */
    uint32_t SCHMITT29:1;               /**< bit:     29  Schmitt Trigger Control                       */
    uint32_t SCHMITT30:1;               /**< bit:     30  Schmitt Trigger Control                       */
    uint32_t SCHMITT31:1;               /**< bit:     31  Schmitt Trigger Control                       */
  };
  struct
  {
    uint32_t SCHMITT:32;                /**< bit:  0..31  Schmitt Trigger Control                       */
  };
  uint32_t w;
} __PORT_SCHMITT_bits_t;

