zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_SCHMITT_SCHMITT0_Pos             (0)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT0_Msk             (0x1U << PORT_SCHMITT_SCHMITT0_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT1_Pos             (1)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT1_Msk             (0x1U << PORT_SCHMITT_SCHMITT1_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT2_Pos             (2)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT2_Msk             (0x1U << PORT_SCHMITT_SCHMITT2_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT3_Pos             (3)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT3_Msk             (0x1U << PORT_SCHMITT_SCHMITT3_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT4_Pos             (4)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT4_Msk             (0x1U << PORT_SCHMITT_SCHMITT4_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT5_Pos             (5)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT5_Msk             (0x1U << PORT_SCHMITT_SCHMITT5_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT6_Pos             (6)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT6_Msk             (0x1U << PORT_SCHMITT_SCHMITT6_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT7_Pos             (7)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT7_Msk             (0x1U << PORT_SCHMITT_SCHMITT7_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT8_Pos             (8)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT8_Msk             (0x1U << PORT_SCHMITT_SCHMITT8_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT9_Pos             (9)                                            /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT9_Msk             (0x1U << PORT_SCHMITT_SCHMITT9_Pos)            /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT10_Pos            (10)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT10_Msk            (0x1U << PORT_SCHMITT_SCHMITT10_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT11_Pos            (11)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT11_Msk            (0x1U << PORT_SCHMITT_SCHMITT11_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT12_Pos            (12)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT12_Msk            (0x1U << PORT_SCHMITT_SCHMITT12_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT13_Pos            (13)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT13_Msk            (0x1U << PORT_SCHMITT_SCHMITT13_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT14_Pos            (14)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT14_Msk            (0x1U << PORT_SCHMITT_SCHMITT14_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT15_Pos            (15)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT15_Msk            (0x1U << PORT_SCHMITT_SCHMITT15_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT16_Pos            (16)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT16_Msk            (0x1U << PORT_SCHMITT_SCHMITT16_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT17_Pos            (17)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT17_Msk            (0x1U << PORT_SCHMITT_SCHMITT17_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT18_Pos            (18)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT18_Msk            (0x1U << PORT_SCHMITT_SCHMITT18_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT19_Pos            (19)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT19_Msk            (0x1U << PORT_SCHMITT_SCHMITT19_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT20_Pos            (20)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT20_Msk            (0x1U << PORT_SCHMITT_SCHMITT20_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT21_Pos            (21)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT21_Msk            (0x1U << PORT_SCHMITT_SCHMITT21_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT22_Pos            (22)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT22_Msk            (0x1U << PORT_SCHMITT_SCHMITT22_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT23_Pos            (23)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT23_Msk            (0x1U << PORT_SCHMITT_SCHMITT23_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT24_Pos            (24)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT24_Msk            (0x1U << PORT_SCHMITT_SCHMITT24_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT25_Pos            (25)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT25_Msk            (0x1U << PORT_SCHMITT_SCHMITT25_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT26_Pos            (26)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT26_Msk            (0x1U << PORT_SCHMITT_SCHMITT26_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT27_Pos            (27)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT27_Msk            (0x1U << PORT_SCHMITT_SCHMITT27_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT28_Pos            (28)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT28_Msk            (0x1U << PORT_SCHMITT_SCHMITT28_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT29_Pos            (29)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT29_Msk            (0x1U << PORT_SCHMITT_SCHMITT29_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT30_Pos            (30)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT30_Msk            (0x1U << PORT_SCHMITT_SCHMITT30_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_SCHMITT31_Pos            (31)                                           /**< (PORT_SCHMITT) Schmitt Trigger Control Position */
#define PORT_SCHMITT_SCHMITT31_Msk            (0x1U << PORT_SCHMITT_SCHMITT31_Pos)           /**< (PORT_SCHMITT) Schmitt Trigger Control Mask */
#define PORT_SCHMITT_Msk                      (0xFFFFFFFFUL)                                 /**< (PORT_SCHMITT) Register Mask  */
#define PORT_SCHMITT_SCHMITT_Pos              (0)                                            /**< (PORT_SCHMITT Position) Schmitt Trigger Control */
#define PORT_SCHMITT_SCHMITT_Msk              (0xFFFFFFFFU << PORT_SCHMITT_SCHMITT_Pos)      /**< (PORT_SCHMITT Mask) SCHMITT */
#define PORT_SCHMITT_SCHMITT(value)           (PORT_SCHMITT_SCHMITT_Msk & ((value) << PORT_SCHMITT_SCHMITT_Pos))

/* -------- PORT_DRIVER : (PORT Offset: 0x118) (R/W 32) I/O Drive Register -------- */

typedef union
{
  struct
  {
    uint32_t LINE0:1;                   /**< bit:      0  Drive of PORT Line 0                          */
    uint32_t LINE1:1;                   /**< bit:      1  Drive of PORT Line 1                          */
    uint32_t LINE2:1;                   /**< bit:      2  Drive of PORT Line 2                          */
    uint32_t LINE3:1;                   /**< bit:      3  Drive of PORT Line 3                          */
    uint32_t LINE4:1;                   /**< bit:      4  Drive of PORT Line 4                          */
    uint32_t LINE5:1;                   /**< bit:      5  Drive of PORT Line 5                          */
    uint32_t LINE6:1;                   /**< bit:      6  Drive of PORT Line 6                          */
    uint32_t LINE7:1;                   /**< bit:      7  Drive of PORT Line 7                          */
    uint32_t LINE8:1;                   /**< bit:      8  Drive of PORT Line 8                          */
    uint32_t LINE9:1;                   /**< bit:      9  Drive of PORT Line 9                          */
    uint32_t LINE10:1;                  /**< bit:     10  Drive of PORT Line 10                         */
    uint32_t LINE11:1;                  /**< bit:     11  Drive of PORT Line 11                         */
    uint32_t LINE12:1;                  /**< bit:     12  Drive of PORT Line 12                         */
    uint32_t LINE13:1;                  /**< bit:     13  Drive of PORT Line 13                         */
    uint32_t LINE14:1;                  /**< bit:     14  Drive of PORT Line 14                         */
    uint32_t LINE15:1;                  /**< bit:     15  Drive of PORT Line 15                         */
    uint32_t LINE16:1;                  /**< bit:     16  Drive of PORT Line 16                         */
    uint32_t LINE17:1;                  /**< bit:     17  Drive of PORT Line 17                         */
    uint32_t LINE18:1;                  /**< bit:     18  Drive of PORT Line 18                         */
    uint32_t LINE19:1;                  /**< bit:     19  Drive of PORT Line 19                         */
    uint32_t LINE20:1;                  /**< bit:     20  Drive of PORT Line 20                         */
    uint32_t LINE21:1;                  /**< bit:     21  Drive of PORT Line 21                         */
    uint32_t LINE22:1;                  /**< bit:     22  Drive of PORT Line 22                         */
    uint32_t LINE23:1;                  /**< bit:     23  Drive of PORT Line 23                         */
    uint32_t LINE24:1;                  /**< bit:     24  Drive of PORT Line 24                         */
    uint32_t LINE25:1;                  /**< bit:     25  Drive of PORT Line 25                         */
    uint32_t LINE26:1;                  /**< bit:     26  Drive of PORT Line 26                         */
    uint32_t LINE27:1;                  /**< bit:     27  Drive of PORT Line 27                         */
    uint32_t LINE28:1;                  /**< bit:     28  Drive of PORT Line 28                         */
    uint32_t LINE29:1;                  /**< bit:     29  Drive of PORT Line 29                         */
    uint32_t LINE30:1;                  /**< bit:     30  Drive of PORT Line 30                         */
    uint32_t LINE31:1;                  /**< bit:     31  Drive of PORT Line 31                         */
  };
  struct
  {
    uint32_t LINE:32;                   /**< bit:  0..31  Drive of PORT Line 3x                         */
  };
  uint32_t w;
} __PORT_DRIVER_bits_t;

