zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_DRIVER_LINE0_Pos                 (0)                                            /**< (PORT_DRIVER) Drive of PORT Line 0 Position */
#define PORT_DRIVER_LINE0_Msk                 (0x1U << PORT_DRIVER_LINE0_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 0 Mask */
#define   PORT_DRIVER_LINE0_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE0_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE0_LOW_DRIVE           (PORT_DRIVER_LINE0_LOW_DRIVE_Val << PORT_DRIVER_LINE0_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE0_HIGH_DRIVE          (PORT_DRIVER_LINE0_HIGH_DRIVE_Val << PORT_DRIVER_LINE0_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE1_Pos                 (1)                                            /**< (PORT_DRIVER) Drive of PORT Line 1 Position */
#define PORT_DRIVER_LINE1_Msk                 (0x1U << PORT_DRIVER_LINE1_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 1 Mask */
#define   PORT_DRIVER_LINE1_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE1_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE1_LOW_DRIVE           (PORT_DRIVER_LINE1_LOW_DRIVE_Val << PORT_DRIVER_LINE1_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE1_HIGH_DRIVE          (PORT_DRIVER_LINE1_HIGH_DRIVE_Val << PORT_DRIVER_LINE1_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE2_Pos                 (2)                                            /**< (PORT_DRIVER) Drive of PORT Line 2 Position */
#define PORT_DRIVER_LINE2_Msk                 (0x1U << PORT_DRIVER_LINE2_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 2 Mask */
#define   PORT_DRIVER_LINE2_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE2_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE2_LOW_DRIVE           (PORT_DRIVER_LINE2_LOW_DRIVE_Val << PORT_DRIVER_LINE2_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE2_HIGH_DRIVE          (PORT_DRIVER_LINE2_HIGH_DRIVE_Val << PORT_DRIVER_LINE2_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE3_Pos                 (3)                                            /**< (PORT_DRIVER) Drive of PORT Line 3 Position */
#define PORT_DRIVER_LINE3_Msk                 (0x1U << PORT_DRIVER_LINE3_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 3 Mask */
#define   PORT_DRIVER_LINE3_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE3_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE3_LOW_DRIVE           (PORT_DRIVER_LINE3_LOW_DRIVE_Val << PORT_DRIVER_LINE3_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE3_HIGH_DRIVE          (PORT_DRIVER_LINE3_HIGH_DRIVE_Val << PORT_DRIVER_LINE3_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE4_Pos                 (4)                                            /**< (PORT_DRIVER) Drive of PORT Line 4 Position */
#define PORT_DRIVER_LINE4_Msk                 (0x1U << PORT_DRIVER_LINE4_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 4 Mask */
#define   PORT_DRIVER_LINE4_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE4_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE4_LOW_DRIVE           (PORT_DRIVER_LINE4_LOW_DRIVE_Val << PORT_DRIVER_LINE4_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE4_HIGH_DRIVE          (PORT_DRIVER_LINE4_HIGH_DRIVE_Val << PORT_DRIVER_LINE4_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE5_Pos                 (5)                                            /**< (PORT_DRIVER) Drive of PORT Line 5 Position */
#define PORT_DRIVER_LINE5_Msk                 (0x1U << PORT_DRIVER_LINE5_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 5 Mask */
#define   PORT_DRIVER_LINE5_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE5_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE5_LOW_DRIVE           (PORT_DRIVER_LINE5_LOW_DRIVE_Val << PORT_DRIVER_LINE5_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE5_HIGH_DRIVE          (PORT_DRIVER_LINE5_HIGH_DRIVE_Val << PORT_DRIVER_LINE5_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE6_Pos                 (6)                                            /**< (PORT_DRIVER) Drive of PORT Line 6 Position */
#define PORT_DRIVER_LINE6_Msk                 (0x1U << PORT_DRIVER_LINE6_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 6 Mask */
#define   PORT_DRIVER_LINE6_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE6_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE6_LOW_DRIVE           (PORT_DRIVER_LINE6_LOW_DRIVE_Val << PORT_DRIVER_LINE6_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE6_HIGH_DRIVE          (PORT_DRIVER_LINE6_HIGH_DRIVE_Val << PORT_DRIVER_LINE6_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE7_Pos                 (7)                                            /**< (PORT_DRIVER) Drive of PORT Line 7 Position */
#define PORT_DRIVER_LINE7_Msk                 (0x1U << PORT_DRIVER_LINE7_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 7 Mask */
#define   PORT_DRIVER_LINE7_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE7_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE7_LOW_DRIVE           (PORT_DRIVER_LINE7_LOW_DRIVE_Val << PORT_DRIVER_LINE7_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE7_HIGH_DRIVE          (PORT_DRIVER_LINE7_HIGH_DRIVE_Val << PORT_DRIVER_LINE7_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE8_Pos                 (8)                                            /**< (PORT_DRIVER) Drive of PORT Line 8 Position */
#define PORT_DRIVER_LINE8_Msk                 (0x1U << PORT_DRIVER_LINE8_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 8 Mask */
#define   PORT_DRIVER_LINE8_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE8_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE8_LOW_DRIVE           (PORT_DRIVER_LINE8_LOW_DRIVE_Val << PORT_DRIVER_LINE8_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE8_HIGH_DRIVE          (PORT_DRIVER_LINE8_HIGH_DRIVE_Val << PORT_DRIVER_LINE8_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE9_Pos                 (9)                                            /**< (PORT_DRIVER) Drive of PORT Line 9 Position */
#define PORT_DRIVER_LINE9_Msk                 (0x1U << PORT_DRIVER_LINE9_Pos)                /**< (PORT_DRIVER) Drive of PORT Line 9 Mask */
#define   PORT_DRIVER_LINE9_LOW_DRIVE_Val     (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE9_HIGH_DRIVE_Val    (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE9_LOW_DRIVE           (PORT_DRIVER_LINE9_LOW_DRIVE_Val << PORT_DRIVER_LINE9_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE9_HIGH_DRIVE          (PORT_DRIVER_LINE9_HIGH_DRIVE_Val << PORT_DRIVER_LINE9_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE10_Pos                (10)                                           /**< (PORT_DRIVER) Drive of PORT Line 10 Position */
#define PORT_DRIVER_LINE10_Msk                (0x1U << PORT_DRIVER_LINE10_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 10 Mask */
#define   PORT_DRIVER_LINE10_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE10_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE10_LOW_DRIVE          (PORT_DRIVER_LINE10_LOW_DRIVE_Val << PORT_DRIVER_LINE10_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE10_HIGH_DRIVE         (PORT_DRIVER_LINE10_HIGH_DRIVE_Val << PORT_DRIVER_LINE10_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE11_Pos                (11)                                           /**< (PORT_DRIVER) Drive of PORT Line 11 Position */
#define PORT_DRIVER_LINE11_Msk                (0x1U << PORT_DRIVER_LINE11_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 11 Mask */
#define   PORT_DRIVER_LINE11_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE11_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE11_LOW_DRIVE          (PORT_DRIVER_LINE11_LOW_DRIVE_Val << PORT_DRIVER_LINE11_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE11_HIGH_DRIVE         (PORT_DRIVER_LINE11_HIGH_DRIVE_Val << PORT_DRIVER_LINE11_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE12_Pos                (12)                                           /**< (PORT_DRIVER) Drive of PORT Line 12 Position */
#define PORT_DRIVER_LINE12_Msk                (0x1U << PORT_DRIVER_LINE12_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 12 Mask */
#define   PORT_DRIVER_LINE12_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE12_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE12_LOW_DRIVE          (PORT_DRIVER_LINE12_LOW_DRIVE_Val << PORT_DRIVER_LINE12_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE12_HIGH_DRIVE         (PORT_DRIVER_LINE12_HIGH_DRIVE_Val << PORT_DRIVER_LINE12_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE13_Pos                (13)                                           /**< (PORT_DRIVER) Drive of PORT Line 13 Position */
#define PORT_DRIVER_LINE13_Msk                (0x1U << PORT_DRIVER_LINE13_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 13 Mask */
#define   PORT_DRIVER_LINE13_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE13_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE13_LOW_DRIVE          (PORT_DRIVER_LINE13_LOW_DRIVE_Val << PORT_DRIVER_LINE13_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE13_HIGH_DRIVE         (PORT_DRIVER_LINE13_HIGH_DRIVE_Val << PORT_DRIVER_LINE13_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE14_Pos                (14)                                           /**< (PORT_DRIVER) Drive of PORT Line 14 Position */
#define PORT_DRIVER_LINE14_Msk                (0x1U << PORT_DRIVER_LINE14_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 14 Mask */
#define   PORT_DRIVER_LINE14_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE14_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE14_LOW_DRIVE          (PORT_DRIVER_LINE14_LOW_DRIVE_Val << PORT_DRIVER_LINE14_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE14_HIGH_DRIVE         (PORT_DRIVER_LINE14_HIGH_DRIVE_Val << PORT_DRIVER_LINE14_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE15_Pos                (15)                                           /**< (PORT_DRIVER) Drive of PORT Line 15 Position */
#define PORT_DRIVER_LINE15_Msk                (0x1U << PORT_DRIVER_LINE15_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 15 Mask */
#define   PORT_DRIVER_LINE15_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE15_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE15_LOW_DRIVE          (PORT_DRIVER_LINE15_LOW_DRIVE_Val << PORT_DRIVER_LINE15_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE15_HIGH_DRIVE         (PORT_DRIVER_LINE15_HIGH_DRIVE_Val << PORT_DRIVER_LINE15_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE16_Pos                (16)                                           /**< (PORT_DRIVER) Drive of PORT Line 16 Position */
#define PORT_DRIVER_LINE16_Msk                (0x1U << PORT_DRIVER_LINE16_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 16 Mask */
#define   PORT_DRIVER_LINE16_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE16_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE16_LOW_DRIVE          (PORT_DRIVER_LINE16_LOW_DRIVE_Val << PORT_DRIVER_LINE16_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE16_HIGH_DRIVE         (PORT_DRIVER_LINE16_HIGH_DRIVE_Val << PORT_DRIVER_LINE16_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE17_Pos                (17)                                           /**< (PORT_DRIVER) Drive of PORT Line 17 Position */
#define PORT_DRIVER_LINE17_Msk                (0x1U << PORT_DRIVER_LINE17_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 17 Mask */
#define   PORT_DRIVER_LINE17_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE17_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE17_LOW_DRIVE          (PORT_DRIVER_LINE17_LOW_DRIVE_Val << PORT_DRIVER_LINE17_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE17_HIGH_DRIVE         (PORT_DRIVER_LINE17_HIGH_DRIVE_Val << PORT_DRIVER_LINE17_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE18_Pos                (18)                                           /**< (PORT_DRIVER) Drive of PORT Line 18 Position */
#define PORT_DRIVER_LINE18_Msk                (0x1U << PORT_DRIVER_LINE18_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 18 Mask */
#define   PORT_DRIVER_LINE18_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE18_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE18_LOW_DRIVE          (PORT_DRIVER_LINE18_LOW_DRIVE_Val << PORT_DRIVER_LINE18_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE18_HIGH_DRIVE         (PORT_DRIVER_LINE18_HIGH_DRIVE_Val << PORT_DRIVER_LINE18_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE19_Pos                (19)                                           /**< (PORT_DRIVER) Drive of PORT Line 19 Position */
#define PORT_DRIVER_LINE19_Msk                (0x1U << PORT_DRIVER_LINE19_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 19 Mask */
#define   PORT_DRIVER_LINE19_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE19_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE19_LOW_DRIVE          (PORT_DRIVER_LINE19_LOW_DRIVE_Val << PORT_DRIVER_LINE19_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE19_HIGH_DRIVE         (PORT_DRIVER_LINE19_HIGH_DRIVE_Val << PORT_DRIVER_LINE19_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE20_Pos                (20)                                           /**< (PORT_DRIVER) Drive of PORT Line 20 Position */
#define PORT_DRIVER_LINE20_Msk                (0x1U << PORT_DRIVER_LINE20_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 20 Mask */
#define   PORT_DRIVER_LINE20_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE20_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE20_LOW_DRIVE          (PORT_DRIVER_LINE20_LOW_DRIVE_Val << PORT_DRIVER_LINE20_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE20_HIGH_DRIVE         (PORT_DRIVER_LINE20_HIGH_DRIVE_Val << PORT_DRIVER_LINE20_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE21_Pos                (21)                                           /**< (PORT_DRIVER) Drive of PORT Line 21 Position */
#define PORT_DRIVER_LINE21_Msk                (0x1U << PORT_DRIVER_LINE21_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 21 Mask */
#define   PORT_DRIVER_LINE21_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE21_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE21_LOW_DRIVE          (PORT_DRIVER_LINE21_LOW_DRIVE_Val << PORT_DRIVER_LINE21_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE21_HIGH_DRIVE         (PORT_DRIVER_LINE21_HIGH_DRIVE_Val << PORT_DRIVER_LINE21_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE22_Pos                (22)                                           /**< (PORT_DRIVER) Drive of PORT Line 22 Position */
#define PORT_DRIVER_LINE22_Msk                (0x1U << PORT_DRIVER_LINE22_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 22 Mask */
#define   PORT_DRIVER_LINE22_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE22_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE22_LOW_DRIVE          (PORT_DRIVER_LINE22_LOW_DRIVE_Val << PORT_DRIVER_LINE22_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE22_HIGH_DRIVE         (PORT_DRIVER_LINE22_HIGH_DRIVE_Val << PORT_DRIVER_LINE22_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE23_Pos                (23)                                           /**< (PORT_DRIVER) Drive of PORT Line 23 Position */
#define PORT_DRIVER_LINE23_Msk                (0x1U << PORT_DRIVER_LINE23_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 23 Mask */
#define   PORT_DRIVER_LINE23_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE23_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE23_LOW_DRIVE          (PORT_DRIVER_LINE23_LOW_DRIVE_Val << PORT_DRIVER_LINE23_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE23_HIGH_DRIVE         (PORT_DRIVER_LINE23_HIGH_DRIVE_Val << PORT_DRIVER_LINE23_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE24_Pos                (24)                                           /**< (PORT_DRIVER) Drive of PORT Line 24 Position */
#define PORT_DRIVER_LINE24_Msk                (0x1U << PORT_DRIVER_LINE24_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 24 Mask */
#define   PORT_DRIVER_LINE24_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE24_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE24_LOW_DRIVE          (PORT_DRIVER_LINE24_LOW_DRIVE_Val << PORT_DRIVER_LINE24_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE24_HIGH_DRIVE         (PORT_DRIVER_LINE24_HIGH_DRIVE_Val << PORT_DRIVER_LINE24_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE25_Pos                (25)                                           /**< (PORT_DRIVER) Drive of PORT Line 25 Position */
#define PORT_DRIVER_LINE25_Msk                (0x1U << PORT_DRIVER_LINE25_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 25 Mask */
#define   PORT_DRIVER_LINE25_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE25_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE25_LOW_DRIVE          (PORT_DRIVER_LINE25_LOW_DRIVE_Val << PORT_DRIVER_LINE25_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE25_HIGH_DRIVE         (PORT_DRIVER_LINE25_HIGH_DRIVE_Val << PORT_DRIVER_LINE25_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE26_Pos                (26)                                           /**< (PORT_DRIVER) Drive of PORT Line 26 Position */
#define PORT_DRIVER_LINE26_Msk                (0x1U << PORT_DRIVER_LINE26_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 26 Mask */
#define   PORT_DRIVER_LINE26_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE26_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE26_LOW_DRIVE          (PORT_DRIVER_LINE26_LOW_DRIVE_Val << PORT_DRIVER_LINE26_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE26_HIGH_DRIVE         (PORT_DRIVER_LINE26_HIGH_DRIVE_Val << PORT_DRIVER_LINE26_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE27_Pos                (27)                                           /**< (PORT_DRIVER) Drive of PORT Line 27 Position */
#define PORT_DRIVER_LINE27_Msk                (0x1U << PORT_DRIVER_LINE27_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 27 Mask */
#define   PORT_DRIVER_LINE27_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE27_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE27_LOW_DRIVE          (PORT_DRIVER_LINE27_LOW_DRIVE_Val << PORT_DRIVER_LINE27_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
