zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_DRIVER_LINE27_HIGH_DRIVE         (PORT_DRIVER_LINE27_HIGH_DRIVE_Val << PORT_DRIVER_LINE27_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE28_Pos                (28)                                           /**< (PORT_DRIVER) Drive of PORT Line 28 Position */
#define PORT_DRIVER_LINE28_Msk                (0x1U << PORT_DRIVER_LINE28_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 28 Mask */
#define   PORT_DRIVER_LINE28_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE28_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE28_LOW_DRIVE          (PORT_DRIVER_LINE28_LOW_DRIVE_Val << PORT_DRIVER_LINE28_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE28_HIGH_DRIVE         (PORT_DRIVER_LINE28_HIGH_DRIVE_Val << PORT_DRIVER_LINE28_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE29_Pos                (29)                                           /**< (PORT_DRIVER) Drive of PORT Line 29 Position */
#define PORT_DRIVER_LINE29_Msk                (0x1U << PORT_DRIVER_LINE29_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 29 Mask */
#define   PORT_DRIVER_LINE29_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE29_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE29_LOW_DRIVE          (PORT_DRIVER_LINE29_LOW_DRIVE_Val << PORT_DRIVER_LINE29_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE29_HIGH_DRIVE         (PORT_DRIVER_LINE29_HIGH_DRIVE_Val << PORT_DRIVER_LINE29_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE30_Pos                (30)                                           /**< (PORT_DRIVER) Drive of PORT Line 30 Position */
#define PORT_DRIVER_LINE30_Msk                (0x1U << PORT_DRIVER_LINE30_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 30 Mask */
#define   PORT_DRIVER_LINE30_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE30_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE30_LOW_DRIVE          (PORT_DRIVER_LINE30_LOW_DRIVE_Val << PORT_DRIVER_LINE30_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE30_HIGH_DRIVE         (PORT_DRIVER_LINE30_HIGH_DRIVE_Val << PORT_DRIVER_LINE30_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_LINE31_Pos                (31)                                           /**< (PORT_DRIVER) Drive of PORT Line 31 Position */
#define PORT_DRIVER_LINE31_Msk                (0x1U << PORT_DRIVER_LINE31_Pos)               /**< (PORT_DRIVER) Drive of PORT Line 31 Mask */
#define   PORT_DRIVER_LINE31_LOW_DRIVE_Val    (0x0U)                                         /**< (PORT_DRIVER) Lowest drive  */
#define   PORT_DRIVER_LINE31_HIGH_DRIVE_Val   (0x1U)                                         /**< (PORT_DRIVER) Highest drive  */
#define PORT_DRIVER_LINE31_LOW_DRIVE          (PORT_DRIVER_LINE31_LOW_DRIVE_Val << PORT_DRIVER_LINE31_Pos)  /**< (PORT_DRIVER) Lowest drive Position  */
#define PORT_DRIVER_LINE31_HIGH_DRIVE         (PORT_DRIVER_LINE31_HIGH_DRIVE_Val << PORT_DRIVER_LINE31_Pos)  /**< (PORT_DRIVER) Highest drive Position  */
#define PORT_DRIVER_Msk                       (0xFFFFFFFFUL)                                 /**< (PORT_DRIVER) Register Mask  */
#define PORT_DRIVER_LINE_Pos                  (0)                                            /**< (PORT_DRIVER Position) Drive of PORT Line 3x */
#define PORT_DRIVER_LINE_Msk                  (0xFFFFFFFFU << PORT_DRIVER_LINE_Pos)          /**< (PORT_DRIVER Mask) LINE */
#define PORT_DRIVER_LINE(value)               (PORT_DRIVER_LINE_Msk & ((value) << PORT_DRIVER_LINE_Pos))

/* -------- PORT_PCMR : (PORT Offset: 0x150) (R/W 32) Parallel Capture Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t PCEN:1;                    /**< bit:      0  Parallel Capture Mode Enable                  */
    uint32_t :3;                        /**< bit:   1..3  Reserved                                      */
    uint32_t DSIZE:2;                   /**< bit:   4..5  Parallel Capture Mode Data Size               */
    uint32_t :3;                        /**< bit:   6..8  Reserved                                      */
    uint32_t ALWYS:1;                   /**< bit:      9  Parallel Capture Mode Always Sampling         */
    uint32_t HALFS:1;                   /**< bit:     10  Parallel Capture Mode Half Sampling           */
    uint32_t FRSTS:1;                   /**< bit:     11  Parallel Capture Mode First Sample            */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __PORT_PCMR_bits_t;

#define PORT_PCMR_PCEN_Pos                    (0)                                            /**< (PORT_PCMR) Parallel Capture Mode Enable Position */
#define PORT_PCMR_PCEN_Msk                    (0x1U << PORT_PCMR_PCEN_Pos)                   /**< (PORT_PCMR) Parallel Capture Mode Enable Mask */
#define PORT_PCMR_DSIZE_Pos                   (4)                                            /**< (PORT_PCMR) Parallel Capture Mode Data Size Position */
#define PORT_PCMR_DSIZE_Msk                   (0x3U << PORT_PCMR_DSIZE_Pos)                  /**< (PORT_PCMR) Parallel Capture Mode Data Size Mask */
#define PORT_PCMR_DSIZE(value)                (PORT_PCMR_DSIZE_Msk & ((value) << PORT_PCMR_DSIZE_Pos))
#define   PORT_PCMR_DSIZE_BYTE_Val            (0x0U)                                         /**< (PORT_PCMR) The reception data in the PORT_PCRHR is a byte (8-bit)  */
#define   PORT_PCMR_DSIZE_HALFWORD_Val        (0x1U)                                         /**< (PORT_PCMR) The reception data in the PORT_PCRHR is a half-word (16-bit)  */
#define   PORT_PCMR_DSIZE_WORD_Val            (0x2U)                                         /**< (PORT_PCMR) The reception data in the PORT_PCRHR is a word (32-bit)  */
#define PORT_PCMR_DSIZE_BYTE                  (PORT_PCMR_DSIZE_BYTE_Val << PORT_PCMR_DSIZE_Pos)  /**< (PORT_PCMR) The reception data in the PORT_PCRHR is a byte (8-bit) Position  */
#define PORT_PCMR_DSIZE_HALFWORD              (PORT_PCMR_DSIZE_HALFWORD_Val << PORT_PCMR_DSIZE_Pos)  /**< (PORT_PCMR) The reception data in the PORT_PCRHR is a half-word (16-bit) Position  */
#define PORT_PCMR_DSIZE_WORD                  (PORT_PCMR_DSIZE_WORD_Val << PORT_PCMR_DSIZE_Pos)  /**< (PORT_PCMR) The reception data in the PORT_PCRHR is a word (32-bit) Position  */
#define PORT_PCMR_ALWYS_Pos                   (9)                                            /**< (PORT_PCMR) Parallel Capture Mode Always Sampling Position */
#define PORT_PCMR_ALWYS_Msk                   (0x1U << PORT_PCMR_ALWYS_Pos)                  /**< (PORT_PCMR) Parallel Capture Mode Always Sampling Mask */
#define PORT_PCMR_HALFS_Pos                   (10)                                           /**< (PORT_PCMR) Parallel Capture Mode Half Sampling Position */
#define PORT_PCMR_HALFS_Msk                   (0x1U << PORT_PCMR_HALFS_Pos)                  /**< (PORT_PCMR) Parallel Capture Mode Half Sampling Mask */
#define PORT_PCMR_FRSTS_Pos                   (11)                                           /**< (PORT_PCMR) Parallel Capture Mode First Sample Position */
#define PORT_PCMR_FRSTS_Msk                   (0x1U << PORT_PCMR_FRSTS_Pos)                  /**< (PORT_PCMR) Parallel Capture Mode First Sample Mask */
#define PORT_PCMR_Msk                         (0x00000E31UL)                                 /**< (PORT_PCMR) Register Mask  */

/* -------- PORT_PCIER : (PORT Offset: 0x154) (/W 32) Parallel Capture Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t DRDY:1;                    /**< bit:      0  Parallel Capture Mode Data Ready Interrupt Enable */
    uint32_t OVRE:1;                    /**< bit:      1  Parallel Capture Mode Overrun Error Interrupt Enable */
    uint32_t ENDRX:1;                   /**< bit:      2  End of Reception Transfer Interrupt Enable    */
    uint32_t RXBUFF:1;                  /**< bit:      3  Reception Buffer Full Interrupt Enable        */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __PORT_PCIER_bits_t;

