zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
#define PORT_PCIER_DRDY_Pos                   (0)                                            /**< (PORT_PCIER) Parallel Capture Mode Data Ready Interrupt Enable Position */
#define PORT_PCIER_DRDY_Msk                   (0x1U << PORT_PCIER_DRDY_Pos)                  /**< (PORT_PCIER) Parallel Capture Mode Data Ready Interrupt Enable Mask */
#define PORT_PCIER_OVRE_Pos                   (1)                                            /**< (PORT_PCIER) Parallel Capture Mode Overrun Error Interrupt Enable Position */
#define PORT_PCIER_OVRE_Msk                   (0x1U << PORT_PCIER_OVRE_Pos)                  /**< (PORT_PCIER) Parallel Capture Mode Overrun Error Interrupt Enable Mask */
#define PORT_PCIER_ENDRX_Pos                  (2)                                            /**< (PORT_PCIER) End of Reception Transfer Interrupt Enable Position */
#define PORT_PCIER_ENDRX_Msk                  (0x1U << PORT_PCIER_ENDRX_Pos)                 /**< (PORT_PCIER) End of Reception Transfer Interrupt Enable Mask */
#define PORT_PCIER_RXBUFF_Pos                 (3)                                            /**< (PORT_PCIER) Reception Buffer Full Interrupt Enable Position */
#define PORT_PCIER_RXBUFF_Msk                 (0x1U << PORT_PCIER_RXBUFF_Pos)                /**< (PORT_PCIER) Reception Buffer Full Interrupt Enable Mask */
#define PORT_PCIER_Msk                        (0x0000000FUL)                                 /**< (PORT_PCIER) Register Mask  */

/* -------- PORT_PCIDR : (PORT Offset: 0x158) (/W 32) Parallel Capture Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t DRDY:1;                    /**< bit:      0  Parallel Capture Mode Data Ready Interrupt Disable */
    uint32_t OVRE:1;                    /**< bit:      1  Parallel Capture Mode Overrun Error Interrupt Disable */
    uint32_t ENDRX:1;                   /**< bit:      2  End of Reception Transfer Interrupt Disable   */
    uint32_t RXBUFF:1;                  /**< bit:      3  Reception Buffer Full Interrupt Disable       */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __PORT_PCIDR_bits_t;

#define PORT_PCIDR_DRDY_Pos                   (0)                                            /**< (PORT_PCIDR) Parallel Capture Mode Data Ready Interrupt Disable Position */
#define PORT_PCIDR_DRDY_Msk                   (0x1U << PORT_PCIDR_DRDY_Pos)                  /**< (PORT_PCIDR) Parallel Capture Mode Data Ready Interrupt Disable Mask */
#define PORT_PCIDR_OVRE_Pos                   (1)                                            /**< (PORT_PCIDR) Parallel Capture Mode Overrun Error Interrupt Disable Position */
#define PORT_PCIDR_OVRE_Msk                   (0x1U << PORT_PCIDR_OVRE_Pos)                  /**< (PORT_PCIDR) Parallel Capture Mode Overrun Error Interrupt Disable Mask */
#define PORT_PCIDR_ENDRX_Pos                  (2)                                            /**< (PORT_PCIDR) End of Reception Transfer Interrupt Disable Position */
#define PORT_PCIDR_ENDRX_Msk                  (0x1U << PORT_PCIDR_ENDRX_Pos)                 /**< (PORT_PCIDR) End of Reception Transfer Interrupt Disable Mask */
#define PORT_PCIDR_RXBUFF_Pos                 (3)                                            /**< (PORT_PCIDR) Reception Buffer Full Interrupt Disable Position */
#define PORT_PCIDR_RXBUFF_Msk                 (0x1U << PORT_PCIDR_RXBUFF_Pos)                /**< (PORT_PCIDR) Reception Buffer Full Interrupt Disable Mask */
#define PORT_PCIDR_Msk                        (0x0000000FUL)                                 /**< (PORT_PCIDR) Register Mask  */

/* -------- PORT_PCIMR : (PORT Offset: 0x15c) (R/ 32) Parallel Capture Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t DRDY:1;                    /**< bit:      0  Parallel Capture Mode Data Ready Interrupt Mask */
    uint32_t OVRE:1;                    /**< bit:      1  Parallel Capture Mode Overrun Error Interrupt Mask */
    uint32_t ENDRX:1;                   /**< bit:      2  End of Reception Transfer Interrupt Mask      */
    uint32_t RXBUFF:1;                  /**< bit:      3  Reception Buffer Full Interrupt Mask          */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __PORT_PCIMR_bits_t;

#define PORT_PCIMR_DRDY_Pos                   (0)                                            /**< (PORT_PCIMR) Parallel Capture Mode Data Ready Interrupt Mask Position */
#define PORT_PCIMR_DRDY_Msk                   (0x1U << PORT_PCIMR_DRDY_Pos)                  /**< (PORT_PCIMR) Parallel Capture Mode Data Ready Interrupt Mask Mask */
#define PORT_PCIMR_OVRE_Pos                   (1)                                            /**< (PORT_PCIMR) Parallel Capture Mode Overrun Error Interrupt Mask Position */
#define PORT_PCIMR_OVRE_Msk                   (0x1U << PORT_PCIMR_OVRE_Pos)                  /**< (PORT_PCIMR) Parallel Capture Mode Overrun Error Interrupt Mask Mask */
#define PORT_PCIMR_ENDRX_Pos                  (2)                                            /**< (PORT_PCIMR) End of Reception Transfer Interrupt Mask Position */
#define PORT_PCIMR_ENDRX_Msk                  (0x1U << PORT_PCIMR_ENDRX_Pos)                 /**< (PORT_PCIMR) End of Reception Transfer Interrupt Mask Mask */
#define PORT_PCIMR_RXBUFF_Pos                 (3)                                            /**< (PORT_PCIMR) Reception Buffer Full Interrupt Mask Position */
#define PORT_PCIMR_RXBUFF_Msk                 (0x1U << PORT_PCIMR_RXBUFF_Pos)                /**< (PORT_PCIMR) Reception Buffer Full Interrupt Mask Mask */
#define PORT_PCIMR_Msk                        (0x0000000FUL)                                 /**< (PORT_PCIMR) Register Mask  */

/* -------- PORT_PCISR : (PORT Offset: 0x160) (R/ 32) Parallel Capture Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t DRDY:1;                    /**< bit:      0  Parallel Capture Mode Data Ready              */
    uint32_t OVRE:1;                    /**< bit:      1  Parallel Capture Mode Overrun Error           */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __PORT_PCISR_bits_t;

#define PORT_PCISR_DRDY_Pos                   (0)                                            /**< (PORT_PCISR) Parallel Capture Mode Data Ready Position */
#define PORT_PCISR_DRDY_Msk                   (0x1U << PORT_PCISR_DRDY_Pos)                  /**< (PORT_PCISR) Parallel Capture Mode Data Ready Mask */
#define PORT_PCISR_OVRE_Pos                   (1)                                            /**< (PORT_PCISR) Parallel Capture Mode Overrun Error Position */
#define PORT_PCISR_OVRE_Msk                   (0x1U << PORT_PCISR_OVRE_Pos)                  /**< (PORT_PCISR) Parallel Capture Mode Overrun Error Mask */
#define PORT_PCISR_Msk                        (0x00000003UL)                                 /**< (PORT_PCISR) Register Mask  */

/* -------- PORT_PCRHR : (PORT Offset: 0x164) (R/ 32) Parallel Capture Reception Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t RDATA:32;                  /**< bit:  0..31  Parallel Capture Mode Reception Data          */
  };
  uint32_t w;
} __PORT_PCRHR_bits_t;

#define PORT_PCRHR_RDATA_Pos                  (0)                                            /**< (PORT_PCRHR) Parallel Capture Mode Reception Data Position */
#define PORT_PCRHR_RDATA_Msk                  (0xFFFFFFFFU << PORT_PCRHR_RDATA_Pos)          /**< (PORT_PCRHR) Parallel Capture Mode Reception Data Mask */
#define PORT_PCRHR_RDATA(value)               (PORT_PCRHR_RDATA_Msk & ((value) << PORT_PCRHR_RDATA_Pos))
#define PORT_PCRHR_Msk                        (0xFFFFFFFFUL)                                 /**< (PORT_PCRHR) Register Mask  */

