zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/** \brief PORT register offsets definitions */
#define PORT_PER_OFFSET              (0x00)         /**< (PORT_PER) PORT Enable Register Offset */
#define PORT_PDR_OFFSET              (0x04)         /**< (PORT_PDR) PORT Disable Register Offset */
#define PORT_PSR_OFFSET              (0x08)         /**< (PORT_PSR) PORT Status Register Offset */
#define PORT_OER_OFFSET              (0x10)         /**< (PORT_OER) Output Enable Register Offset */
#define PORT_ODR_OFFSET              (0x14)         /**< (PORT_ODR) Output Disable Register Offset */
#define PORT_OSR_OFFSET              (0x18)         /**< (PORT_OSR) Output Status Register Offset */
#define PORT_IFER_OFFSET             (0x20)         /**< (PORT_IFER) Glitch Input Filter Enable Register Offset */
#define PORT_IFDR_OFFSET             (0x24)         /**< (PORT_IFDR) Glitch Input Filter Disable Register Offset */
#define PORT_IFSR_OFFSET             (0x28)         /**< (PORT_IFSR) Glitch Input Filter Status Register Offset */
#define PORT_SODR_OFFSET             (0x30)         /**< (PORT_SODR) Set Output Data Register Offset */
#define PORT_CODR_OFFSET             (0x34)         /**< (PORT_CODR) Clear Output Data Register Offset */
#define PORT_ODSR_OFFSET             (0x38)         /**< (PORT_ODSR) Output Data Status Register Offset */
#define PORT_PDSR_OFFSET             (0x3C)         /**< (PORT_PDSR) Pin Data Status Register Offset */
#define PORT_IER_OFFSET              (0x40)         /**< (PORT_IER) Interrupt Enable Register Offset */
#define PORT_IDR_OFFSET              (0x44)         /**< (PORT_IDR) Interrupt Disable Register Offset */
#define PORT_IMR_OFFSET              (0x48)         /**< (PORT_IMR) Interrupt Mask Register Offset */
#define PORT_ISR_OFFSET              (0x4C)         /**< (PORT_ISR) Interrupt Status Register Offset */
#define PORT_MDER_OFFSET             (0x50)         /**< (PORT_MDER) Multi-driver Enable Register Offset */
#define PORT_MDDR_OFFSET             (0x54)         /**< (PORT_MDDR) Multi-driver Disable Register Offset */
#define PORT_MDSR_OFFSET             (0x58)         /**< (PORT_MDSR) Multi-driver Status Register Offset */
#define PORT_PUDR_OFFSET             (0x60)         /**< (PORT_PUDR) Pull-up Disable Register Offset */
#define PORT_PUER_OFFSET             (0x64)         /**< (PORT_PUER) Pull-up Enable Register Offset */
#define PORT_PUSR_OFFSET             (0x68)         /**< (PORT_PUSR) Pad Pull-up Status Register Offset */
#define PORT_ABCDSR_OFFSET           (0x70)         /**< (PORT_ABCDSR) Peripheral ABCD Select Register 0 Offset */
#define PORT_IFSCDR_OFFSET           (0x80)         /**< (PORT_IFSCDR) Input Filter Slow Clock Disable Register Offset */
#define PORT_IFSCER_OFFSET           (0x84)         /**< (PORT_IFSCER) Input Filter Slow Clock Enable Register Offset */
#define PORT_IFSCSR_OFFSET           (0x88)         /**< (PORT_IFSCSR) Input Filter Slow Clock Status Register Offset */
#define PORT_SCDR_OFFSET             (0x8C)         /**< (PORT_SCDR) Slow Clock Divider Debouncing Register Offset */
#define PORT_PPDDR_OFFSET            (0x90)         /**< (PORT_PPDDR) Pad Pull-down Disable Register Offset */
#define PORT_PPDER_OFFSET            (0x94)         /**< (PORT_PPDER) Pad Pull-down Enable Register Offset */
#define PORT_PPDSR_OFFSET            (0x98)         /**< (PORT_PPDSR) Pad Pull-down Status Register Offset */
#define PORT_OWER_OFFSET             (0xA0)         /**< (PORT_OWER) Output Write Enable Offset */
#define PORT_OWDR_OFFSET             (0xA4)         /**< (PORT_OWDR) Output Write Disable Offset */
#define PORT_OWSR_OFFSET             (0xA8)         /**< (PORT_OWSR) Output Write Status Register Offset */
#define PORT_AIMER_OFFSET            (0xB0)         /**< (PORT_AIMER) Additional Interrupt Modes Enable Register Offset */
#define PORT_AIMDR_OFFSET            (0xB4)         /**< (PORT_AIMDR) Additional Interrupt Modes Disable Register Offset */
#define PORT_AIMMR_OFFSET            (0xB8)         /**< (PORT_AIMMR) Additional Interrupt Modes Mask Register Offset */
#define PORT_ESR_OFFSET              (0xC0)         /**< (PORT_ESR) Edge Select Register Offset */
#define PORT_LSR_OFFSET              (0xC4)         /**< (PORT_LSR) Level Select Register Offset */
#define PORT_ELSR_OFFSET             (0xC8)         /**< (PORT_ELSR) Edge/Level Status Register Offset */
#define PORT_FELLSR_OFFSET           (0xD0)         /**< (PORT_FELLSR) Falling Edge/Low-Level Select Register Offset */
#define PORT_REHLSR_OFFSET           (0xD4)         /**< (PORT_REHLSR) Rising Edge/High-Level Select Register Offset */
#define PORT_FRLHSR_OFFSET           (0xD8)         /**< (PORT_FRLHSR) Fall/Rise - Low/High Status Register Offset */
#define PORT_LOCKSR_OFFSET           (0xE0)         /**< (PORT_LOCKSR) Lock Status Offset */
#define PORT_WPMR_OFFSET             (0xE4)         /**< (PORT_WPMR) Write Protection Mode Register Offset */
#define PORT_WPSR_OFFSET             (0xE8)         /**< (PORT_WPSR) Write Protection Status Register Offset */
#define PORT_SCHMITT_OFFSET          (0x100)        /**< (PORT_SCHMITT) Schmitt Trigger Register Offset */
#define PORT_DRIVER_OFFSET           (0x118)        /**< (PORT_DRIVER) I/O Drive Register Offset */
#define PORT_PCMR_OFFSET             (0x150)        /**< (PORT_PCMR) Parallel Capture Mode Register Offset */
#define PORT_PCIER_OFFSET            (0x154)        /**< (PORT_PCIER) Parallel Capture Interrupt Enable Register Offset */
#define PORT_PCIDR_OFFSET            (0x158)        /**< (PORT_PCIDR) Parallel Capture Interrupt Disable Register Offset */
#define PORT_PCIMR_OFFSET            (0x15C)        /**< (PORT_PCIMR) Parallel Capture Interrupt Mask Register Offset */
#define PORT_PCISR_OFFSET            (0x160)        /**< (PORT_PCISR) Parallel Capture Interrupt Status Register Offset */
#define PORT_PCRHR_OFFSET            (0x164)        /**< (PORT_PCRHR) Parallel Capture Reception Holding Register Offset */

