zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/port.h
/** \brief PORT register API structure */
typedef struct
{
  __O   __PORT_PER_bits_t              PORT_PER;      /**< Offset: 0x00 ( /W  32) PORT Enable Register */
  __O   __PORT_PDR_bits_t              PORT_PDR;      /**< Offset: 0x04 ( /W  32) PORT Disable Register */
  __I   __PORT_PSR_bits_t              PORT_PSR;      /**< Offset: 0x08 (R/   32) PORT Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   __PORT_OER_bits_t              PORT_OER;      /**< Offset: 0x10 ( /W  32) Output Enable Register */
  __O   __PORT_ODR_bits_t              PORT_ODR;      /**< Offset: 0x14 ( /W  32) Output Disable Register */
  __I   __PORT_OSR_bits_t              PORT_OSR;      /**< Offset: 0x18 (R/   32) Output Status Register */
  __I   uint8_t                        Reserved2[0x04];
  __O   __PORT_IFER_bits_t             PORT_IFER;     /**< Offset: 0x20 ( /W  32) Glitch Input Filter Enable Register */
  __O   __PORT_IFDR_bits_t             PORT_IFDR;     /**< Offset: 0x24 ( /W  32) Glitch Input Filter Disable Register */
  __I   __PORT_IFSR_bits_t             PORT_IFSR;     /**< Offset: 0x28 (R/   32) Glitch Input Filter Status Register */
  __I   uint8_t                        Reserved3[0x04];
  __O   __PORT_SODR_bits_t             PORT_SODR;     /**< Offset: 0x30 ( /W  32) Set Output Data Register */
  __O   __PORT_CODR_bits_t             PORT_CODR;     /**< Offset: 0x34 ( /W  32) Clear Output Data Register */
  __IO  __PORT_ODSR_bits_t             PORT_ODSR;     /**< Offset: 0x38 (R/W  32) Output Data Status Register */
  __I   __PORT_PDSR_bits_t             PORT_PDSR;     /**< Offset: 0x3C (R/   32) Pin Data Status Register */
  __O   __PORT_IER_bits_t              PORT_IER;      /**< Offset: 0x40 ( /W  32) Interrupt Enable Register */
  __O   __PORT_IDR_bits_t              PORT_IDR;      /**< Offset: 0x44 ( /W  32) Interrupt Disable Register */
  __I   __PORT_IMR_bits_t              PORT_IMR;      /**< Offset: 0x48 (R/   32) Interrupt Mask Register */
  __I   __PORT_ISR_bits_t              PORT_ISR;      /**< Offset: 0x4C (R/   32) Interrupt Status Register */
  __O   __PORT_MDER_bits_t             PORT_MDER;     /**< Offset: 0x50 ( /W  32) Multi-driver Enable Register */
  __O   __PORT_MDDR_bits_t             PORT_MDDR;     /**< Offset: 0x54 ( /W  32) Multi-driver Disable Register */
  __I   __PORT_MDSR_bits_t             PORT_MDSR;     /**< Offset: 0x58 (R/   32) Multi-driver Status Register */
  __I   uint8_t                        Reserved4[0x04];
  __O   __PORT_PUDR_bits_t             PORT_PUDR;     /**< Offset: 0x60 ( /W  32) Pull-up Disable Register */
  __O   __PORT_PUER_bits_t             PORT_PUER;     /**< Offset: 0x64 ( /W  32) Pull-up Enable Register */
  __I   __PORT_PUSR_bits_t             PORT_PUSR;     /**< Offset: 0x68 (R/   32) Pad Pull-up Status Register */
  __I   uint8_t                        Reserved5[0x04];
  __IO  __PORT_ABCDSR_bits_t           PORT_ABCDSR[2]; /**< Offset: 0x70 (R/W  32) Peripheral ABCD Select Register 0 */
  __I   uint8_t                        Reserved6[0x08];
  __O   __PORT_IFSCDR_bits_t           PORT_IFSCDR;   /**< Offset: 0x80 ( /W  32) Input Filter Slow Clock Disable Register */
  __O   __PORT_IFSCER_bits_t           PORT_IFSCER;   /**< Offset: 0x84 ( /W  32) Input Filter Slow Clock Enable Register */
  __I   __PORT_IFSCSR_bits_t           PORT_IFSCSR;   /**< Offset: 0x88 (R/   32) Input Filter Slow Clock Status Register */
  __IO  __PORT_SCDR_bits_t             PORT_SCDR;     /**< Offset: 0x8C (R/W  32) Slow Clock Divider Debouncing Register */
  __O   __PORT_PPDDR_bits_t            PORT_PPDDR;    /**< Offset: 0x90 ( /W  32) Pad Pull-down Disable Register */
  __O   __PORT_PPDER_bits_t            PORT_PPDER;    /**< Offset: 0x94 ( /W  32) Pad Pull-down Enable Register */
  __I   __PORT_PPDSR_bits_t            PORT_PPDSR;    /**< Offset: 0x98 (R/   32) Pad Pull-down Status Register */
  __I   uint8_t                        Reserved7[0x04];
  __O   __PORT_OWER_bits_t             PORT_OWER;     /**< Offset: 0xA0 ( /W  32) Output Write Enable */
  __O   __PORT_OWDR_bits_t             PORT_OWDR;     /**< Offset: 0xA4 ( /W  32) Output Write Disable */
  __I   __PORT_OWSR_bits_t             PORT_OWSR;     /**< Offset: 0xA8 (R/   32) Output Write Status Register */
  __I   uint8_t                        Reserved8[0x04];
  __O   __PORT_AIMER_bits_t            PORT_AIMER;    /**< Offset: 0xB0 ( /W  32) Additional Interrupt Modes Enable Register */
  __O   __PORT_AIMDR_bits_t            PORT_AIMDR;    /**< Offset: 0xB4 ( /W  32) Additional Interrupt Modes Disable Register */
  __I   __PORT_AIMMR_bits_t            PORT_AIMMR;    /**< Offset: 0xB8 (R/   32) Additional Interrupt Modes Mask Register */
  __I   uint8_t                        Reserved9[0x04];
  __O   __PORT_ESR_bits_t              PORT_ESR;      /**< Offset: 0xC0 ( /W  32) Edge Select Register */
  __O   __PORT_LSR_bits_t              PORT_LSR;      /**< Offset: 0xC4 ( /W  32) Level Select Register */
  __I   __PORT_ELSR_bits_t             PORT_ELSR;     /**< Offset: 0xC8 (R/   32) Edge/Level Status Register */
  __I   uint8_t                        Reserved10[0x04];
  __O   __PORT_FELLSR_bits_t           PORT_FELLSR;   /**< Offset: 0xD0 ( /W  32) Falling Edge/Low-Level Select Register */
  __O   __PORT_REHLSR_bits_t           PORT_REHLSR;   /**< Offset: 0xD4 ( /W  32) Rising Edge/High-Level Select Register */
  __I   __PORT_FRLHSR_bits_t           PORT_FRLHSR;   /**< Offset: 0xD8 (R/   32) Fall/Rise - Low/High Status Register */
  __I   uint8_t                        Reserved11[0x04];
  __I   __PORT_LOCKSR_bits_t           PORT_LOCKSR;   /**< Offset: 0xE0 (R/   32) Lock Status */
  __IO  __PORT_WPMR_bits_t             PORT_WPMR;     /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __PORT_WPSR_bits_t             PORT_WPSR;     /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved12[0x14];
  __IO  __PORT_SCHMITT_bits_t          PORT_SCHMITT;  /**< Offset: 0x100 (R/W  32) Schmitt Trigger Register */
  __I   uint8_t                        Reserved13[0x14];
  __IO  __PORT_DRIVER_bits_t           PORT_DRIVER;   /**< Offset: 0x118 (R/W  32) I/O Drive Register */
  __I   uint8_t                        Reserved14[0x34];
  __IO  __PORT_PCMR_bits_t             PORT_PCMR;     /**< Offset: 0x150 (R/W  32) Parallel Capture Mode Register */
  __O   __PORT_PCIER_bits_t            PORT_PCIER;    /**< Offset: 0x154 ( /W  32) Parallel Capture Interrupt Enable Register */
  __O   __PORT_PCIDR_bits_t            PORT_PCIDR;    /**< Offset: 0x158 ( /W  32) Parallel Capture Interrupt Disable Register */
  __I   __PORT_PCIMR_bits_t            PORT_PCIMR;    /**< Offset: 0x15C (R/   32) Parallel Capture Interrupt Mask Register */
  __I   __PORT_PCISR_bits_t            PORT_PCISR;    /**< Offset: 0x160 (R/   32) Parallel Capture Interrupt Status Register */
  __I   __PORT_PCRHR_bits_t            PORT_PCRHR;    /**< Offset: 0x164 (R/   32) Parallel Capture Reception Holding Register */
} port_registers_t;
/** @}  end of Port */

#endif /* _PIC32CZ_CA70_PORT_COMPONENT_H_ */
